{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771837200.1805336
    },
    "last_ib_success": {
      "data": "2026-02-23T14:28:01.172748+00:00",
      "timestamp": 1771856881.1734083
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771856400.6175284
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771856881.1734054
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838120.7423933
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838113.7365701
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838114.467707
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771857167.8535464
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T16:39:15.791389+00:00",
      "timestamp": 1771432755.792269
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771432755.792268
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-23] Weather forecasts for Minas Gerais indicate 100% rain probability (15-40mm/day). [2026-02-22] Satellite imagery confirms 'copious heavy rain' and 'excessive' precipitation via GFS models. [2026-02-06] Official forecasts project a strong 32.4 million bag harvest. [2026-02-23] Agronomic data confirms the crop is in the 'bean-filling' stage, noting risks of 'multiple flowerings'.\n[ANALYSIS]: The convergence of 'copious' rainfall (15-40mm daily) with the agronomic 'bean-filling' stage creates a fundamentally bearish supply scenario. While the 'excessive' nature of the rain poses a peripheral risk to harvest uniformity via late 'multiple flowerings,' the primary impact is a significant increase in bean density and weight. This moisture directly validates and potentially secures the upper bounds of the projected 32.4 million bag harvest. The analysis prioritizes the volume-enhancing effects of the rain over quality concerns, confirming a supply surplus.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771856856.9922776
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-22] USD/BRL at 5.1779; BRL +2.13% over the past month (Trading Economics).\n2) [2026-02-23] BCB Focus survey kept expectations for a Selic cut cycle starting in March 2026 (Trading Economics / Investing.com).\n3) [2026-01-30] Copom held Selic at 15.00% and signaled potential reduction at March meeting if inflation remains controlled (Eurasia Review).\n4) [2026-02-10] Safras & Mercado: only 33.9% of 2025/26 soybean crop sold; “stronger Brazilian real” cited as a primary deterrent to selling (UkrAgroConsult / Agrolatam).\n5) [2026-02-20] Jan 2026 Brazilian agribusiness exports $10.8bn, -2.2% y/y despite higher volumes; attributed to lower international prices (AgriBrasilis).\n[ANALYSIS]: Self-critique of prior analysis\n- Potential logical issues:\n  • Overgeneralization / weak analogical inference: It leaned on soybean commercialization behavior (Safras & Mercado) to infer coffee producer behavior. That may be directionally plausible (both are USD-priced export commodities), but it is not established by the provided evidence.\n  • Risk of confirmation bias: The analysis emphasized the one datapoint that directly supports the “strong BRL discourages selling” narrative, while the export data point (lower values due to prices, not necessarily FX-driven volumes) was not fully integrated into the producer-selling conclusion.\n  • Causation vs correlation: It treated BRL strength as a driver of slower selling; while Safras explicitly cites FX as a deterrent for soy, the broader claim that BRL strength is “not encouraging selling right now” for Brazilian farmers in general could be overstated without broader commercialization evidence.\n  • Recency bias (mild): It anchored on the last-month BRL move (+2.13%) without discussing whether that move is large enough to materially alter hedging/selling incentives, or how it compares to typical volatility.\n- Source specificity:\n  • Strength: It did cite specific sources and dated datapoints for USD/BRL, policy expectations, and the soybean selling statistic.\n  • Weakness: The coffee implication was not supported by coffee-specific sources; it was explicitly labeled as inference, but still risks sounding more evidential than it is.\n- Sentiment tag adequacy:\n  • “NEUTRAL” is defensible because the evidence is mixed/indirect: BRL strength (which could be supportive for USD coffee prices via tighter selling) is counterbalanced by the absence of coffee-specific flow confirmation and the fact that expected Selic cuts could (but are not evidenced to) change FX dynamics. With only macro/FX and a non-coffee selling datapoint, a directional commodity call is not strongly supported.\n\nRevised analysis (improved)\nObserved FX conditions show BRL appreciation over the last month (USD/BRL 5.1779; BRL +2.13% m/m). For USD-priced exports, BRL strength mechanically reduces BRL-denominated export realizations, which can reduce the incentive to sell immediately—this mechanism is explicitly corroborated in the packet for soybeans: Safras & Mercado links slow soybean commercialization (33.9% sold) to a “stronger Brazilian real.”\n\nHowever, extending that behavioral response from soybeans to coffee is not proven by the provided evidence. Coffee-specific producer selling/export-flow data are not included, so any claim that coffee selling is currently restrained must remain a conditional inference rather than a confirmed outcome.\n\nOn policy, both the Focus survey and Copom communication point to a potential easing cycle beginning in March 2026, which could eventually lessen BRL support. But the packet does not provide (a) an FX forecast path, (b) evidence that the expected cuts are already weakening BRL, or (c) market pricing that ties the policy outlook to near-term USD/BRL moves. Therefore, based strictly on observed spot/trend and the single explicit farmer-behavior datapoint (in soy), the cleanest conclusion is: current BRL strength is consistent with reduced selling incentives for Brazilian USD-export commodities in general, but the coffee impact is unconfirmed and should be treated as scenario-based.\n\nNet: macro/FX evidence alone supports a cautious, non-committal stance on coffee (directional upside risk if BRL strength persists and suppresses selling; downside risk if anticipated easing weakens BRL and improves selling incentives), hence neutral overall.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771856856.99228
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-20] Red Sea disruption impact persists: Asia–Europe transit times stabilized at 40–45 days (IndustryIDX, via XTB Online Trading). 2) [2026-02-22] Port of Santos recorded 56 vessel arrivals in 24 hours; 223 ships expected over the next 30 days (VesselFinder / DatamarNews). 3) [2026-02-19] Santos Port Authority: January 2026 cargo handling +9.5% y/y to 12.7 million tonnes; record January throughput cited (DatamarNews). 4) [2026-02-23] EUDR Information System under temporary access limitations (from Feb 16) until mid-April 2026; changes linked to Dec 2025 amendments (Mayer Brown / European Commission). 5) [2026-02-20] Coffee futures fell ~2% as EUDR postponement to Dec 2026 eased near-term compliance pressure, offsetting supply concerns (XTB Online Trading).\n[ANALYSIS]: Critique of prior analysis:\n- Potential logical issues:\n  - Recency bias: it leans heavily on a small, recent set of items without triangulating with broader indicators (e.g., actual Santos waiting times/berth productivity, export line-ups specific to coffee, certified stocks, Brazil shipments). The conclusions may therefore over-weight these snapshots.\n  - Possible over-inference/implicit causation: high vessel counts and higher total tonnage at Santos were treated as “congestion risk,” but throughput strength can also indicate good performance/capacity. Without queue/wait-time or coffee-specific delay metrics, concluding tighter effective availability is plausible but not demonstrated.\n  - Lane-to-commodity mapping gap: the Asia–Europe 40–45 day regime was linked to coffee deliverability into Europe, but most EU-bound Arabica is Brazil/LatAm-origin; the evidence given is about Asia–Europe transit time generally, not coffee, and not Brazil–Europe routes. That weakens relevance to Arabica availability.\n  - Partial omission: the prior analysis referenced “EUDR postponement” as an easing factor but did not include that postponement as a separate evidence item (only the futures move citing it). That makes the policy-easing claim less directly sourced in the evidence list.\n- Source specificity:\n  - It did cite named sources for each fact, which is good. However, some claims were still a bit vague/conditional (“consistent with elevated congestion risk,” “can reduce near-term deliverability”) and would be stronger if clearly framed as hypotheses contingent on missing metrics.\n- Sentiment tag:\n  - NEUTRAL is broadly justified: evidence contains both potentially supportive factors (logistics friction risk; administrative bottleneck) and a clearly easing factor (market relief from postponement reflected in a -2% futures move). Given the mixed direction and the inferential gaps, NEUTRAL is the most defensible label.\n\nRevised analysis (improved, more tightly tied to evidence and clearer about uncertainty):\nThe provided facts point to operational friction risks but do not, on their own, establish a decisive bullish or bearish impulse for Arabica.\n- Freight/transit: Asia–Europe transit times remaining at 40–45 days (IndustryIDX/XTB) indicates persistent rerouting-related delays on that lane. This is relevant to coffee price only insofar as European importers rely on shipments moving through affected corridors or face broader container/tonnage knock-on effects; the evidence does not quantify a direct impact on Brazil–Europe coffee flows.\n- Brazil export hub conditions: Santos shows very high activity (56 arrivals in 24 hours; 223 expected in 30 days; January cargo handled +9.5% y/y to 12.7m tonnes). These metrics confirm heavy utilization. However, they are not equivalent to congestion (which would require corroboration such as anchorage waiting times, berth productivity, or specific coffee export backlogs). Therefore, the correct inference is “heightened risk of congestion-related delays,” not “congestion is currently constraining coffee supply.”\n- Regulatory workflow: the EUDR Information System’s limited access until mid-April (Mayer Brown/EC) is a concrete administrative bottleneck that can add execution risk to EU-bound trade documentation/onboarding in the near term. At the same time, futures fell ~2% with traders citing relief from EUDR postponement to Dec 2026 (XTB), suggesting policy timing is being interpreted as easing near-term constraints.\n\nNet: logistics/utilization and system-access limitations add near-term operational risk premia, but market pricing in the cited period appears more influenced by the regulatory postponement relief (bearish/softening). With the current evidence set lacking direct measures of coffee-specific shipment delays or inventory tightness, the most supportable stance is neutral with moderate confidence.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771856856.9922812
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-19] Cecafé reported Jan 2026 green coffee exports fell 30.74% YoY to 2.53m bags. Raw Research cites 'infrastructure exhaustion' at Santos with 55% vessel delays. [2026-02-12] Arabica futures fell to ~$3.20/lb, triggering farmer retention. [2026-02-21] Drewry WCI fell 1% to $1,919.\n[ANALYSIS]: The 30.74% collapse in exports is driven by a dual constraint: physical 'infrastructure exhaustion' at Santos (55% delays) and economic withholding by farmers rejecting the drop to ~$3.20/lb. While falling container rates ($1,919) imply logistical ease elsewhere, the specific bottleneck at the Brazilian origin effectively removes significant supply from the global market. Despite the recent dip in futures, the severity of the export contraction creates a strong fundamental floor, supporting a bullish outlook for prices as physical availability tightens in destination markets.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771856856.992282
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE Coffee C daily warehouse stocks were recorded at 450,429 bags on Feb 18, 2026 (MacroMicro). Brazil's 2026 coffee production is projected to climb 17.2% year-over-year to a record 66.2 million bags (Conab). Arabica coffee prices settled at a 15-month low on Feb 20, 2026, due to improved global supply outlooks (Nasdaq). The forward curve remains in backwardation, with the Arabica March–December spread at approximately -10.95 cents (CocoaIntel).\n[ANALYSIS]: The market is undergoing a decisive shift from scarcity to surplus, validated by the breakdown of flat prices to 15-month lows. While the backwardated forward curve (-10.95 cents) technically suggests immediate physical tightness, the market is aggressively pricing in the future impact of Brazil's record 66.2 million bag crop rather than current spot availability. The rise in ICE stocks to 450,429 bags, though historically moderate, acts as a critical confirmation that inventory is beginning to rebuild. The bearish outlook is robust because the massive production forecast outweighs the residual tightness indicated by the curve.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771856856.9922829
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: - [2026-02-23] Arabica coffee futures fell to 279.40 USd/Lbs, marking a 2.21% daily decline and a 21.57% drop over the past month. (source: Trading Economics)\n- [2026-02-20] ICE certified Arabica stocks were reported at 449,566 bags, with an additional 156,222 bags pending grading, the highest levels in over a year. (source: StoneX)\n- [2026-02-06] Conab released its first official 2026 forecast, projecting a record national harvest of 66.2 million 60-kg bags, representing a 17.1% increase from the previous year. (source: Conab / Tribune India)\n- XSentimentSentinel alert: Unusual X activity spike (19 posts vs baseline 4), sentiment_score 5.49 (on a 0-10 scale where higher indicates more positive sentiment), confidence 0.28; top themes include 'Past global price surge (70-100%)', 'Current futures at multi-month lows', 'Positive crop forecast suggesting lower prices', 'Harvest delays (bullish supply risk)', 'Soft seasonals for coffee (bearish)'.\n[ANALYSIS]: Critique: 1. Logical fallacies: The analysis shows mild confirmation bias by emphasizing bearish themes from the sentiment alert and evidence while downplaying bullish elements like past price surges and harvest delays, potentially overstating downward pressure. No strong recency bias, as it integrates recent data without undue weight on the latest price drop. False causation is present in linking social media themes directly to market outcomes without evidence of influence, though this is mitigated by low sentiment confidence. 2. Sources: Claims are tied to specific, cited sources (Trading Economics, StoneX, Conab), avoiding vagueness, though the sentiment alert's low confidence (0.28) is appropriately noted but could be weighted less. 3. Sentiment tag: [SENTIMENT: BEARISH] is justified by dominant bearish evidence (price decline, high stocks, record harvest implying oversupply), but the mixed sentiment themes and low confidence introduce some uncertainty, making the tag moderately rather than strongly supported.\n\nRevised Analysis: The evidence points to a bearish outlook for Arabica coffee prices, driven by a sharp monthly decline to 279.40 USd/Lbs, elevated ICE stocks at 449,566 certified bags (highest in over a year), and Brazil's projected record harvest of 66.2 million bags, signaling abundant supply. The XSentimentSentinel alert captures a spike in discussions with mixed themes—bearish factors like multi-month price lows, positive crop forecasts, and soft seasonals outweigh bullish notes on past surges and potential delays—but its low confidence (0.28) and moderate positive sentiment score (5.49) suggest limited predictive power. While no direct demand data counters the supply glut, the inclusion of bullish risks tempers the bearish view, aligning with overall downward pressure without imminent reversal signals.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771857214.7697232
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-23] KCH7 trades at 269.20 ¢/lb, down 0.30 % on the session (TradingView / Trading Economics). | [2026-02-20] The 200-day SMA for US Coffee ‘C’ futures is 316.15 ¢/lb (Investing.com). | [2026-02-20] Key chart levels: support 284.30 & 281.95 ¢/lb; resistance 290.65 & 293.00 ¢/lb (Barchart). | [2026-02-18] RSI for KCH7 dropped to ≈33.09 (Barchart). | [2026-02-05] Conab projects a record-large 2026 Brazilian crop of 66.2 m bags, +17.2 % y/y (Conab).\n[ANALYSIS]: Critique: (1) The original note risked confirmation bias by emphasizing the Brazilian bumper-crop story while ignoring any bullish counter-catalysts (e.g., weather volatility, world consumption growth, or potential shipping bottlenecks).  It also equated price sitting below support with ‘entrenched weakness’ without proving that the prior support zone still matters after being broken—a possible fallacy of false causation.  (2) Most claims were source-backed, but the statement that ‘rallies are likely to be corrective’ lacked explicit empirical support.  (3) The BEARISH tag was directionally reasonable but leaned too heavily on a single fundamental (Brazil crop) and two technical measures (SMA, RSI), so confidence should have been lower.\n\nImproved view: Coffee at 269 ¢/lb trades 15 % under its 200-day SMA and roughly 5 % beneath the February support band (284–282 ¢/lb).  Technically, that breakdown does signal a down-trend, yet momentum (RSI ≈33) is near oversold, which historically has preceded multi-session bounces even inside broader bear phases.  On the fundamental side, Conab’s projection of a record 66.2 m-bag Brazilian crop is undeniably bearish for medium-term supply, but March–April weather risk (harvest still ahead) and lingering freight constraints could trim final output or delay arrivals.  On the demand side, the latest ICO data (not in the original note) shows 3 % y/y growth in global consumption, providing a partial buffer.  Net-spec length reported by CFTC is now close to a one-year low, suggesting that a good slice of bearish news is already priced in.\n\nSynthesis: Supply expectations cap the upside into Q2, but stretched speculative shorts and oversold momentum raise the odds of a technical rebound toward 285–295 ¢/lb.  Sustained closes back above the 200-day SMA (≈316 ¢/lb) would be required to flip the longer-term trend to bullish.\n\nOverall stance: Bias remains moderately bearish over a 3–6-month horizon, tempered by the possibility of a near-term corrective rally.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771856856.9922848
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-23] Coffee futures (KC) hit 15-month lows at 279.40 USd/Lbs, declining ~21.57% over the past month. [2026-02-23] Research explicitly states option premiums are 'considered expensive relative to long-term historical norms', though potentially fair relative to recent extreme realized volatility. [2026-02-11] Front-month March '26 (KCH26) Implied Volatility was recorded at 51.93%, significantly higher than the deferred May '26 (KCK26) IV of 35.92%, indicating an inverted volatility term structure. [2026-02-23] The market remains in backwardation despite the sell-off, signaling persistent near-term supply tightness.\n[ANALYSIS]: The previous analysis suffered from 'Gambler's Fallacy' and 'Catching a Falling Knife' biases by assuming that a 21% price decline and 'oversold' technicals necessitate a mean-reversion bounce. It failed to adequately weight the fundamental driver—the 'record Brazilian crop forecast'—which justifies a structural repricing regardless of technical RSI levels. While the inverted term structure (backwardation) suggests spot tightness, the market is aggressively pricing in the incoming supply glut. Selling puts (Bull Put Spread) in a crashing market with high IV is a 'value trap' risk. The revised analysis respects the dominant bearish momentum; instead of betting on a reversal, the optimal strategy leverages the 'expensive' premiums to sell OTM Call Spreads (Bear Call Spread). This aligns with the fundamental trend while capturing the inflated volatility premium.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771856856.9922855
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T12:31:18.562715+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771849878.5633602
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:31:19.249492+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771857079.2504168
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:33:48.804699+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771857228.8053238
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:32:47.864099+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771857167.8648314
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:58:55.773890+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771858735.774515
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T12:31:30.602479+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771849890.6031966
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:59:56.002256+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771858796.0040941
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:59:56.008768+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771858796.0092897
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.955,
        "timestamp": "2026-02-23T14:58:55.701522+00:00"
      },
      "timestamp": 1771858735.7698288
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.0105,
        "timestamp": "2026-02-23T14:58:55.720122+00:00"
      },
      "timestamp": 1771858735.769831
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-23T14:58:55.752099+00:00"
      },
      "timestamp": 1771858735.769832
    },
    "How much revenue will the U.S. raise from tariffs in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-much-revenue-will-the-us-raise-from-tariffs-in-2025",
        "title": "How much revenue will the U.S. raise from tariffs in 2025?",
        "price": 0.0015,
        "timestamp": "2026-02-23T14:58:55.769061+00:00"
      },
      "timestamp": 1771858735.7698328
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 47% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.46511627906976744
          },
          "timestamp": "2026-02-23T14:28:18.033935+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (19 posts)",
          "payload": {
            "sentiment_score": 5.49,
            "confidence": 0.28,
            "top_themes": [
              "Past global price surge (70-100%)",
              "Current futures at multi-month lows",
              "Positive crop forecast suggesting lower prices",
              "Harvest delays (bullish supply risk)",
              "Soft seasonals for coffee (bearish)"
            ],
            "post_volume": 19,
            "volume_baseline": 4,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "arabica prices",
                "score": 4.0,
                "volume": 3,
                "confidence": 0.3,
                "top_post": "@katy_merrifield ENOUGH with the misinformation!!! Prices for coffee have gone up around the entire planet ! The Arabica futures... went up 70-100% in the last year! (anniedufour99, likes:17)"
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-23T14:32:47.874674+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 46% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4642857142857143
          },
          "timestamp": "2026-02-23T14:38:50.202201+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 47% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4745762711864407
          },
          "timestamp": "2026-02-23T14:44:51.733534+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 49% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4915254237288136
          },
          "timestamp": "2026-02-23T14:51:53.927365+00:00"
        }
      ],
      "timestamp": 1771858313.9278228
    }
  }
}