{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771345703.5772731
    },
    "last_ib_success": {
      "data": "2026-02-17T16:28:42.035353+00:00",
      "timestamp": 1771345722.0360084
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771338000.464724
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771338004.0098944
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771345708.4360049
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771345721.5646136
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771345722.036005
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771345754.7065215
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-17T15:21:28.654079+00:00",
      "timestamp": 1771341688.6610985
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1770991215.70366
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771345690.866362
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-17] Arabica futures dropped ~3.9% to ~$2.85/lb amid bumper crop forecasts. [2026-02-06] Conab projects a record 2026 crop with Arabica up 23.3% to 44.1 million bags. [2026-02-13/16] Weather reports cite 'floods', 'intense storms', and 'supportive conditions' for grain filling in São Paulo, contradicting the specific drought alert.\n[ANALYSIS]: The previous analysis correctly identified the 'Drought' alert as an outlier but underestimated the confidence level. The bearish sentiment is strongly supported by fundamental data: Conab's projection of a 23.3% production increase and the market's negative price reaction (~3.9% drop) confirm that supply expectations are high. The 'Drought' signal (19.6mm) is effectively negated by concurrent reports of 'floods' and 'intense storms,' suggesting the dryness was either highly localized or a data error. Furthermore, the crop is agronomically in the 'grain filling' stage, benefiting from the reported moisture, rendering the alert's 'vegetative' classification and scarcity warning invalid relative to the broader bumper crop narrative.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771344385.618829
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-17] USD/BRL fell to 5.2229, the strongest BRL level since May 2024. (Trading Economics)\n2) [2026-02-10] Brazilian farmers are selling the new soybean crop at a slower pace than prior years due to the stronger local currency and low prices. (UkrAgroConsult / Anec)\n3) [2026-02-06] Only 34% to 38% of Brazil's 2025/26 soybean crop has been sold, below the historical average, due to a stronger Real and lower prices. (Agrolatam / Safras & Mercado)\n4) [2026-01-28] Copom held Selic at 15.00% and signaled a potential cut for March. (Reuters / Investing.com)\n5) [2026-02-09] Focus Bulletin: end-2026 Selic 12.25%, 2026 inflation 3.97%, USD/BRL 5.50. (Banco Central do Brasil / InfoMoney)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Potential logical issues\n- Risk of false causation / overgeneralization: The packet provides explicit causality for soy (strong BRL + low prices -> slower selling), but it does not provide coffee-specific hedging/selling/export behavior. Inferring restrained coffee producer selling from soy evidence may be directionally plausible, but it is not proven by the cited sources.\n- Confirmation/selection bias: The analysis leaned heavily on items (2) and (3) that support the “strong BRL discourages selling” narrative, while not explicitly acknowledging that coffee and soy producer behavior can differ (different cost structures, storage, financing, marketing/hedging practices, and seasonality).\n- Recency bias is possible: Using a single spot FX observation (USD/BRL 5.2229 on 2026-02-17) to describe a “trend” may overstate persistence without a time series. The evidence shows “at that date it was strong,” not necessarily a sustained multi-month downtrend.\n- Policy/rates forward-looking inference: It is reasonable to discuss how expected Selic cuts could weaken BRL later, but linking that to “improved exporter competitiveness” and “more conducive to selling” is speculative given the packet does not quantify pass-through, timing, or producer response.\n\n2) Source specificity vs vagueness\n- Strength: The analysis did cite specific sources and datapoints (USD/BRL level; soy sold percentage; Selic level; Focus Bulletin projections).\n- Weakness: It made a somewhat broad claim (“supports interpretation of restrained near-term producer selling/export flow for Arabica”) without a coffee-specific source. That part should have been more explicitly framed as a hypothesis, not an implication supported directly by evidence.\n\n3) Sentiment tag justification\n- “NEUTRAL” is broadly defensible because the evidence is mixed and partly non-coffee: current strong BRL could be supportive for coffee prices (less selling), but forward expectations (lower Selic, higher USD/BRL) could later pressure prices via improved selling incentives. Also, the dataset lacks direct coffee flow data, limiting conviction.\n- However, if forced to tag purely on the near-term directional impulse from observed BRL strength + documented slower selling behavior (in soy), the tilt would be mildly bullish for USD-priced coffee—yet the cross-commodity extrapolation argues for keeping the overall tag neutral.\n\nREVISED ANALYSIS (IMPROVED)\n- FX backdrop: As of 2026-02-17, USD/BRL at 5.2229 indicates a notably stronger BRL versus recent history (strongest since May 2024). This condition typically reduces BRL revenues for USD-denominated exports (mechanically lowering local-currency realization for a given USD price).\n- Observed producer behavior (direct evidence, but in soy): Two independent reports tie the stronger BRL (and low prices) to slower forward selling of Brazil’s new soybean crop, with sales at 34–38%, below historical average. This supports the narrower statement: in at least one major Brazilian export crop, current FX strength is associated with producer reluctance to sell.\n- Limits of inference to coffee: The packet does not provide coffee-specific producer selling, hedge ratios, export registrations, or shipment data. Therefore, any translation to Arabica must be treated as a conditional hypothesis: if coffee growers/exporters respond similarly to BRL strength (i.e., by delaying sales/hedging), near-term physical offers could be restrained, which would be supportive for USD coffee prices at the margin.\n- Policy path and scenario risk: Selic at 15.00% is consistent with BRL support, but Copom has signaled potential cuts and the Focus Bulletin projects materially lower rates by end-2026 alongside a weaker BRL (USD/BRL 5.50). If that easing/weaker-BRL scenario materializes, it could reverse the near-term incentive structure and become more conducive to producer selling later. Timing and magnitude remain uncertain.\n- Bottom line: The strongest supported conclusion from this dataset is: current BRL strength is linked (in soy) to slower selling and could—if behavior is analogous in coffee—reduce near-term selling pressure. Because coffee-specific flow data is absent and the forward policy/FX path could shift incentives, the overall stance should remain neutral with a modest near-term bullish bias contingent on cross-commodity behavioral similarity.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771344303.1487362
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-17] Renewed security threats are delaying a full return to the Red Sea; the area is described as a 'red zone' again, forcing continued rerouting via the Cape of Good Hope. (source: Marine Insight / CZ App)\n2) [2026-02-09] Red Sea diversions have established a 'new normal' of +10 to 14 days transit time and freight costs ~40% higher than 2019 baselines. (source: IndustryIDX)\n3) [2026-02-12] Average vessel waiting time at the Port of Santos is currently around 2 days, with yard utilization at 63-77%. (source: Kuehne+Nagel)\n4) [2026-01-27] In 2025, 55% of vessels at Brazilian ports faced delays, costing exporters R$14.67 billion, though early 2026 shows operational improvements. (source: DatamarNews)\n5) [2026-02-11] European Commission confirmed it will not reopen the EUDR text but will propose targeted tweaks and a simplification package by April 2026. (source: Business & Human Rights Centre / Charles Russell Speechlys)\n[ANALYSIS]: CRITIQUE (of prior analysis)\n1) Logical fallacies / reasoning risks\n- Recency bias: The conclusion leans heavily on a current snapshot for Santos (\"~2 days\" waiting, yard utilization range) to downplay Brazil-side constraints, while using broader/structural statements for Red Sea to elevate routing as \"the\" binding constraint. A short-term improvement at one port does not necessarily generalize across Brazil or persist.\n- Confirmation bias / selection bias: The framing tends to confirm an initial thesis (maritime corridor is the bottleneck) and may underweight evidence that 2025 Brazil delays were widespread. The packet lacks like-for-like current metrics for other Brazilian ports and lacks time series data for Santos, so declaring routing as dominant is more interpretive than demonstrated.\n- Over-assertion / false precision: Phrasing such as \"binding constraint\" suggests a quantified constraint ranking, but the evidence does not provide comparative delay distributions (e.g., % of shipments impacted by Cape rerouting vs % impacted by Brazilian port congestion) or measured impacts on coffee lead times by lane.\n- Potential false causation: The implication that Cape rerouting \"can tighten effective availability\" is plausible, but the evidence provided does not directly connect rerouting to Arabica availability (no inventory, shipment volume, delivery performance, or differential lane exposure for Brazilian coffee specifically).\n\n2) Source specificity vs vague claims\n- Strength: The analysis did cite concrete figures tied to named sources (e.g., +10–14 days; ~40% higher freight vs 2019; Santos ~2 days waiting; 63–77% yard utilization; 55% delayed vessels in 2025; EC not reopening EUDR text).\n- Weakness: Several claims go beyond what those sources establish in the packet: \"dominant\" friction, \"binding\" constraint, and lane-specific statements (Asia/East Africa ↔ Europe/US East Coast) are not explicitly evidenced here. Also, the term \"new normal\" and the +10–14 days figure relate to Red Sea diversions generally; it is not shown that Brazilian Arabica flows are materially exposed versus, say, Atlantic routes.\n\n3) Sentiment tag justification\n- NEUTRAL is broadly defensible: the evidence shows logistics frictions (higher freight, longer transits) but also some operational improvement at Santos and no explicit supply shock. However, the write-up’s emphasis on longer lead times and higher landed costs arguably tilts modestly BEARISH for near-term availability/price (i.e., supportive of higher prices), even if the net stance remains uncertain.\n\nREVISED ANALYSIS (improved, more disciplined)\nThe evidence indicates continuing global ocean-shipping friction centered on Red Sea security risk and resulting Cape of Good Hope rerouting (Marine Insight/CZ App; IndustryIDX). These diversions are associated with materially longer transit times (+10–14 days) and materially higher freight levels (~40% above 2019 baselines). This is a credible, ongoing headwind for any trade lanes that would otherwise rely on Suez routing.\n\nAt the same time, the specific Brazil-side data provided is a limited but positive snapshot: Santos currently shows ~2 days average vessel waiting and 63–77% yard utilization (Kuehne+Nagel), and DatamarNews notes early-2026 operational improvement relative to a difficult 2025 (55% of vessels delayed across Brazilian ports, large exporter costs). From the packet alone, we can say that Santos does not appear to be experiencing the same acute queuing stress seen in 2025, but we cannot conclude that Brazilian export logistics are broadly “cleared,” because (a) the 2025 problem was multi-port, and (b) there is no comparable, current metric set for other ports or a time series confirming durability.\n\nOn regulation, the EC position on EUDR (no reopening of the text; targeted tweaks/simplification by April 2026) signals ongoing compliance/change-management rather than a clearly evidenced immediate physical shipping stoppage in this packet.\n\nNet assessment: Based strictly on the provided facts, there are two concurrent themes—(1) persistent, structurally higher/longer ocean transport conditions linked to Red Sea security and rerouting, and (2) tentative improvement in at least one key Brazilian gateway (Santos) versus 2025. The packet does not provide enough comparative, coffee-specific lane exposure or delay incidence to rank a single “binding constraint.” A cautious interpretation is that global ocean routing remains a meaningful risk to lead times and freight costs, while Brazilian port congestion appears less acute at Santos right now but remains a non-trivial risk given recent history.\n\nConfidence is moderated by missing coffee-specific shipment performance data (lane mix, container availability, on-time delivery, inventories) and incomplete current coverage across Brazilian ports.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771344303.1487384
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-11] Brazil exported 2.78 million 60-kg bags of coffee in January 2026, a 30.8% decrease compared to January 2025 (Source: Cecafé / DatamarNews). [2026-02-11] Logistical bottlenecks persist at the Port of Santos, where infrastructure exhaustion continues to cause delays and financial losses for exporters (Source: Raw Research Findings). [2026-02-13] Drewry World Container Index fell 1% to $1,933 per 40ft container... (Source: Drewry / Container News). [2026-02-12] Carriers announced 57 blank sailings on Transpacific routes... (Source: Drewry Container Capacity Insight).\n[ANALYSIS]: The revised analysis corrects the ambiguity regarding the asset class by explicitly linking the data to Coffee prices rather than general Shipping rates. The 30.8% year-over-year contraction in export volumes (Cecafé) serves as the primary evidence of a supply shock. While global shipping data (Drewry) shows a deflationary trend in freight rates ($1,933/container) and capacity management via blank sailings, these factors are overridden by the localized 'infrastructure exhaustion' at the Port of Santos. The persistence of bottlenecks despite a massive drop in volume indicates deep structural friction. Therefore, the analysis concludes that the physical inability to move product out of Brazil creates a bullish setup for coffee prices, decoupling them from the broader bearish trend in global freight costs.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771344303.1487393
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE Coffee C Stocks reported at 428,631 bags on Feb 13, 2026 (MacroMicro), following a report of 436,081 bags on Feb 12, 2026 (CocoaIntel). Brazil's 2026 coffee production is forecast at 66.2 million bags, a 17% increase year-over-year (Conab). Global green bean exports in December 2025 reached 10.15 million bags, a 9.2% increase year-on-year (Global Coffee Report). The forward curve shows strength concentrated in the front month (March 2026), maintaining a backwardation structure (CocoaIntel).\n[ANALYSIS]: The market presents a dichotomy between structural oversupply and immediate physical tightness. The fundamental outlook remains BEARISH, anchored by Conab's forecast of a 17% production jump in Brazil and a 9.2% rise in global exports. However, the previous analysis contained a logical fallacy by characterizing the specific inventory data points as 'Building'; the evidence provided explicitly shows a daily draw from 436k to 428k bags. This draw, combined with the backwardated forward curve, validates significant short-term tightness. The revised outlook prioritizes the massive incoming supply wave as the dominant driver but acknowledges that the backwardation signals that this supply has not yet sufficiently reached the exchange to crush spot prices.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771344303.1487403
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. CFTC COT report (data as of Feb 10, released Feb 13, 2026) shows Managed Money Net Long position at 19,077 contracts (Futures Only), down from 25,400 the prior week, driven by 6,323 long liquidations and 2,000 new shorts (source: CFTC.gov, Tradingster.com). 2. Technical indicators: RSI(14) at 32.5 on Feb 17, 2026, confirming oversold conditions below 30 threshold (source: Investing.com, Barchart.com). 3. Brazil's 2026 coffee production forecast at 66.2 million 60kg bags, a 17.2% increase from 2025, due to favorable weather and arabica recovery (source: Conab official release, Reuters, Feb 13, 2026). 4. Price action: Coffee futures rebounded 8% from $2.95/lb low to $3.18/lb on Feb 17, 2026, amid short covering, but remain 28% below $4.40 peak in Dec 2025 (source: CME Group data, Bloomberg).\n[ANALYSIS]: The CFTC data indicates speculative unwinding with net longs dropping to 19,077 contracts, reflecting reduced bullish conviction amid expectations of Brazil's record 66.2 million bag crop, which could flood the market and pressure prices downward. While RSI at 32.5 signals oversold conditions and the recent 8% rebound suggests short-term short covering, this appears as a technical bounce rather than a trend reversal, as fundamental supply growth from Brazil overshadows demand factors like steady U.S. consumption. No evidence of demand surge or production risks counters the bearish supply outlook, supporting continued downward pressure post-rebound.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771344303.1487417
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-17] May-26 Coffee ‘C’ futures (ICE: KCK6) settle 284.69 ¢/lb, –3.89 % d/d (TradingEconomics / Investing.com).  •  200-day SMA = 328.59 ¢/lb (Investing.com).  •  RSI-14 oscillates 30.0-36.6 (oversold threshold ≈30).  •  Intraday pivot points: S1 291.21 ¢, R1 295.61 ¢ (Investing.com).  •  Brazil’s 2026 crop forecast: 66.2 mn bags, +17.2 % y/y (CONAB via Barchart).\n[ANALYSIS]: The market is 13 % below its 200-day SMA, confirming medium-term downward momentum. An RSI hovering just above 30 flags short-term oversold conditions, raising the probability of a technical bounce; however, oversold oscillators alone rarely reverse established trends without a clear catalyst.  Fundamentally, the prospect of a record Brazilian harvest (≈37 % of global output) is a credible bearish driver, yet the figure is still a forecast—subject to weather risk during the bloom-to-harvest window—and much of that news may already be priced in.  Demand indicators (roaster margins, certified-stock drawdowns, global consumption growth) are absent from the current dataset, so the supply narrative may be overstated.  Price’s breach of the S1 pivot at 291 ¢ and inability to reclaim 300 ¢ reinforce near-term bearish control, but follow-through selling volume is required to confirm a fresh leg lower toward 275 ¢ (next chart support).  In sum, prevailing evidence tilts bearish, yet the oversold reading and forward-looking nature of the crop data introduce two-way risk.  Traders could expect rallies into 295-310 ¢ to face selling unless new bullish data (e.g., weather damage, stronger demand, currency weakness) emerge.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771344303.148743
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-13] KCK26 Implied Volatility (35.92%) is trading at a discount to 20-day Realized Volatility (~40%). [2026-02-17] Prices ($2.86-$3.00/lb) are testing 6-month lows. [2026-02-13] Brazil's 2026 production forecast is a record 66.2 million bags (+17.2% YoY).\n[ANALYSIS]: The previous analysis incorrectly labeled the environment as a 'LOW_VOL' regime; while Implied Volatility (IV) is cheap relative to Realized Volatility (RV), an absolute IV of ~36% indicates a high-volatility environment. The revised view maintains a BEARISH sentiment but refines the thesis: the market is mispricing risk by offering option premiums at a discount (IV < RV) despite the looming 'Green Tsunami' supply shock (+17.2% YoY production). While prices are at 6-month lows, the fundamental weight of record supply suggests support levels may break, validating a directional short strategy. Buying options (Long Put) remains the optimal approach, not because volatility is 'low', but because it is statistically undervalued relative to the asset's recent velocity.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771344303.1487443
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:28:45.970858+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771345725.9712465
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:28:46.522426+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771345726.5228066
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:28:49.720520+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771345729.7211154
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:29:14.710950+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771345754.711565
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:29:15.576000+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771345755.5766172
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:29:19.251177+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771345759.2516334
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:28:44.270208+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771345724.270925
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T16:29:19.256773+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771345759.257238
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.93,
        "timestamp": "2026-02-17T16:29:14.928407+00:00"
      },
      "timestamp": 1771345755.5692139
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.0125,
        "timestamp": "2026-02-17T16:29:15.108709+00:00"
      },
      "timestamp": 1771345755.5692174
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 7,
        "hwm_timestamp": "2026-02-17T09:37:51.681485+00:00",
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.245,
        "timestamp": "2026-02-17T16:29:15.568577+00:00"
      },
      "timestamp": 1771345755.5692189
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (13 posts)",
          "payload": {
            "sentiment_score": 5.12,
            "confidence": 0.21,
            "top_themes": [
              "Futures rally",
              "Firm farm-gate prices",
              "Uganda coffee earnings",
              "Supply chain control and improvements",
              "Traceability and sustainability"
            ],
            "post_volume": 13,
            "volume_baseline": 4.1,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 6.0,
                "volume": 1,
                "confidence": 0.2,
                "top_post": "Global futures rally as firm farm-gate prices anchor Uganda’s coffee earnings\n\nDETAILS 👇🏽#VisionUpdates #HarvestMoney\n\nhttps://t.co/3xDuspLpPG https://t.co/419umr31d1"
              },
              {
                "query": "arabica prices",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-17T15:25:09.396920+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in São Paulo: 19.6mm (NEUTRAL, VEGETATIVE stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "São Paulo",
            "weekly_precip_mm": 19.6,
            "threshold": 30.0,
            "stage": "VEGETATIVE",
            "direction": "NEUTRAL",
            "severity": "HIGH"
          },
          "timestamp": "2026-02-17T16:04:46.303360+00:00"
        },
        {
          "source": "MacroContagionSentinel",
          "reason": "Fed Policy Shock: HAWKISH_PIVOT - FOMC minutes released May 22 revealed that officials are concerned about the lack of progress on inflation, with 'various' participants expressing a willingness to tighten policy further if risks to inflation materialize.",
          "payload": {
            "type": "FED_POLICY_SHOCK",
            "policy_type": "HAWKISH_PIVOT",
            "summary": "FOMC minutes released May 22 revealed that officials are concerned about the lack of progress on inflation, with 'various' participants expressing a willingness to tighten policy further if risks to inflation materialize.",
            "market_impact": "Bullish for USD as rate cut expectations are pushed back; Bearish for Gold and other commodities due to higher-for-longer interest rate outlook.",
            "severity": "CRITICAL"
          },
          "timestamp": "2026-02-17T16:05:19.663205+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 42% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.41935483870967744
          },
          "timestamp": "2026-02-17T16:18:25.242030+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 40% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.39560439560439564
          },
          "timestamp": "2026-02-17T16:27:29.203796+00:00"
        }
      ],
      "timestamp": 1771345649.2047396
    }
  }
}