{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771923600.7016053
    },
    "last_ib_success": {
      "data": "2026-02-24T12:08:19.425526+00:00",
      "timestamp": 1771934899.4262269
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771934461.0075314
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771934899.4262238
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771924551.7943027
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771924545.6600797
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771924546.151526
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771932682.9578917
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T16:39:15.791389+00:00",
      "timestamp": 1771432755.792269
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771432755.792268
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: ['[2026-02-23] Somar Meteorologia reported Minas Gerais received 62.8 mm of rain in the recent week, representing 138% of the historical average.', \"[2026-02-24] Cumulative monthly rainfall in parts of Minas Gerais reached 106.3mm, creating 'Goldilocks' conditions for the crop.\", '[2026-02-24] Conab projects a record 2026 Brazil harvest of 66.2 million bags, with Arabica production expected to surge 23.2% to 44.1 million bags.', '[2026-02-24] May 2026 Arabica futures closed down 2.68% at 278.05 cents/lb, reacting to the favorable supply outlook.']\n[ANALYSIS]: The convergence of Somar Meteorologia's weather data (138% of historical average rainfall) and Conab's record production forecast (66.2 million bags) establishes a robust fundamental bearish thesis. The 'Goldilocks' moisture levels (106.3mm) occurring specifically during the agronomic bean-filling stage validate the projected 23.2% surge in Arabica output by minimizing yield risks. The market's immediate 2.68% correction in futures prices indicates that traders are actively pricing in this supply certainty, shifting the focus from speculative weather premiums to a confirmed surplus scenario.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771936304.8719606
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-24] USD/BRL fell to 5.1724, continuing a short-term downward trend from a high of 5.59 in late 2025. (Trading Economics)\n2) [2026-02-24] USD/BRL has a 'sell' technical rating and is trading below its 21-day, 50-day, and 100-day moving averages. (TradingView)\n3) [2026-02-18] Focus Bulletin: Selic expected to remain at 15.00% in the near term, potentially easing to 12.25% by end-2026. (Banco Central do Brasil)\n4) [2026-02-10] Brazilian soybean sales for 2025/26 reached only 33.9%, lagging historical averages due to the stronger local currency. (Safras & Mercado)\n5) [2026-02-09] Analysts report a 4.5% early-2026 USD drop vs BRL squeezed local soy revenues, leading to a 'farmer slowdown' in sales. (Agrolatam)\n[ANALYSIS]: CRITIQUE OF THE PRIOR ANALYSIS\n1) Logical fallacies / reasoning risks:\n- Potential overgeneralization / weak analogy: The analysis uses soybean commercialization behavior as supporting evidence for a broader 'FX strength reduces selling' mechanism, then extends that to coffee. The mechanism is plausible, but soy and coffee differ in producer hedging practices, on-farm storage dynamics, cooperative/exporter behavior, and seasonality. Without coffee-specific sales/export data, the coffee inference is not confirmed.\n- Possible confirmation bias: The prior writeup emphasizes BRL-strength evidence and farmer slowdown stories that fit the thesis, but does not explicitly consider offsetting drivers (e.g., farmers selling for cash-flow needs, pre-hedged sales, different price elasticity, or global coffee fundamentals).\n- Recency bias risk: It leans heavily on a very recent USD/BRL level and technical snapshot. One datapoint and short-term technicals can change quickly; the analysis should frame this as near-term context rather than a durable condition.\n- False precision / causation risk: The Selic discussion implies a tight link from restrictive rates to BRL strength and then to export selling. Rate differentials can matter, but FX is multi-causal (risk appetite, fiscal news, terms of trade). The evidence packet does not establish a causal chain, only co-movement and expectations.\n\n2) Source specificity vs vague claims:\n- Strength: It cited specific outlets and dates (Trading Economics, TradingView, BCB Focus Bulletin, Safras & Mercado, Agrolatam) and concrete figures (USD/BRL 5.1724; Selic 15.00%; soy sales 33.9%; 4.5% USD drop).\n- Weakness: Claims like 'can contribute to tighter near-term export flow (supportive for Arabica)' are not directly sourced and should be clearly labeled as hypothesis/inference. Also, 'continued BRL support' from Selic is more interpretive than evidenced in the packet.\n\n3) Sentiment tag justification:\n- The NEUTRAL tag is broadly defensible because the packet supports BRL-strength and a selling slowdown mechanism (supportive for USD-denominated commodity prices), but does not provide direct coffee flow/stock data to justify a clearly bullish conclusion for Arabica. However, the narrative tilt is slightly bullish-for-coffee (tighter exports), so the tag should be explained as 'neutral due to insufficient coffee-specific confirmation.'\n\nREVISED ANALYSIS (IMPROVED)\n- FX context (observed, not guaranteed): USD/BRL is lower on a short-term basis (5.1724 on 2026-02-24 vs ~5.59 in late 2025; Trading Economics) and technical positioning is bearish USD/BRL (below key moving averages with a 'sell' rating; TradingView). This supports a near-term characterization of a stronger BRL versus USD.\n- Mechanism supported in soy (but commodity-specific): Separate reporting indicates that BRL strength/USD weakness has reduced local-currency revenue for Brazilian soybean producers and coincided with slower commercialization (33.9% sold for 2025/26; Safras & Mercado; plus analyst commentary on a farmer selling slowdown tied to a 4.5% USD drop vs BRL; Agrolatam). This provides direct evidence that, at least in soy, a stronger BRL can dampen producer selling.\n- Coffee implication (explicitly framed as conditional): By analogy, a stronger BRL could reduce incentives for Brazilian coffee producers/exporters to aggressively sell at current USD prices, potentially slowing export flow and being supportive for Arabica prices. However, the evidence provided does not include coffee-specific commercialization rates, export shipment data, or producer hedging/forward-sales behavior, so any coffee impact should be treated as a conditional hypothesis rather than a confirmed outcome.\n- Rates/policy link (kept probabilistic): The BCB Focus Bulletin expectation for Selic to remain restrictive at 15.00% in the near term (with possible easing to 12.25% by end-2026; Banco Central do Brasil) is consistent with an environment that can support BRL carry, but the packet does not prove that rate expectations are the dominant driver of the current USD/BRL move nor that easing timing will (or won’t) change the FX trend soon.\n\nBOTTOM LINE: The strongest, directly evidenced conclusion is 'BRL strength is currently associated with slower farmer selling in Brazil (shown in soy).' The coffee bullishness is plausible but unconfirmed without coffee-specific flow data; therefore overall stance remains neutral-to-slightly-supportive for Arabica on an FX channel, with moderate confidence due to cross-commodity extrapolation.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771934874.8855195
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-23] Santos Brasil terminal reports an 18-hour vessel wait time with yard utilization at 66%. (source: Hapag-Lloyd)\n2) [2026-02-23] DP World Santos reports a 15-hour vessel wait time with yard utilization at 64%. (source: Hapag-Lloyd)\n3) [2026-02-19] Port of Santos handled a record 12.7 million tonnes in January 2026, a 9.5% year-on-year increase. (source: DatamarNews)\n4) [2026-02-19] Red Sea shipping is partially reopening, but renewed Houthi threats maintain high route uncertainty for carriers. (source: S&P Global)\n5) [2026-02-09] Standard transit times from Shanghai to Rotterdam are now firmly established at 40-45 days due to the Cape of Good Hope route. (source: IndustryIDX)\n\nCRITIQUE OF PRIOR ANALYSIS (key issues):\n- Potential logical pitfalls:\n  - False linkage / relevance gap: The analysis leans on Asia–Europe (Shanghai–Rotterdam) transit times to infer implications for Arabica coffee availability, but the evidence provided does not establish that Arabica coffee flows relevant to the market in question are materially routed on that lane. Without lane relevance (e.g., Brazil/Vietnam-to-Europe/US coffee routing), the causal link is speculative.\n  - Overgeneralization: “Structural extension of Asia–Europe shipping times” is treated as a dominant bottleneck signal for coffee, but the evidence is only one trade lane and one benchmark; it may not generalize to coffee supply chains.\n  - Recency/availability bias: The conclusion is driven heavily by a small, recent snapshot of port-wait metrics and one recent transit-time statement; it may underweight other bottlenecks not included in the packet (e.g., inland logistics, trucking, berthing windows, blank sailings).\n  - Quantification gap: Calling 15–18h waits “manageable” is plausible, but not proven without a benchmark (historical averages, service-level targets, or thresholds for “gridlock”).\n- Source specificity:\n  - Strength: It cited concrete figures and explicitly named sources (Hapag-Lloyd, DatamarNews, S&P Global, IndustryIDX).\n  - Weakness: Several interpretive claims (e.g., “supportive of tighter near-term availability/greater basis risk”) extend beyond what the cited sources explicitly say about coffee.\n- Sentiment tag:\n  - NEUTRAL is defensible because the evidence is mixed: Santos looks not acutely congested by the provided metrics, while Red Sea uncertainty/longer Asia–Europe transits imply broader maritime friction. However, the earlier write-up subtly leaned bullish (tightness) in implication; if the lane relevance to coffee is unproven, neutrality is more appropriate.\n[ANALYSIS]: Port/route signals in this evidence set are mixed and do not, by themselves, prove a coffee-specific squeeze.\n\nBrazil (Port of Santos): Two terminal snapshots show vessel waits of 15–18 hours with yard utilization in the mid-60% range (Hapag-Lloyd). These numbers indicate some queuing/friction but do not alone demonstrate severe congestion; the dataset lacks a baseline defining what constitutes “gridlock” for these terminals. DatamarNews reports record January throughput (12.7 million tonnes, +9.5% YoY), which supports the idea of strong demand/flow through Santos, but high volume does not automatically translate into export impairment without corroborating indicators (e.g., escalating waits, yard utilization approaching saturation, gate/truck delays, missed sailings).\n\nRed Sea / global shipping: S&P Global notes partial reopening alongside renewed Houthi threats, implying continued routing uncertainty. IndustryIDX states Shanghai–Rotterdam transits are “firmly established” at 40–45 days via the Cape route, evidencing sustained elongation on that corridor. However, this evidence is lane-specific and does not, on its own, establish direct impact on Arabica coffee logistics unless the relevant coffee flows depend materially on that Asia–Europe routing.\n\nImplication for Arabica (based strictly on this packet): The Santos metrics suggest manageable-to-moderate port friction rather than an acute Brazil-port-driven disruption signal. The Red Sea/Asia–Europe items point to broader maritime uncertainty and longer lead times on at least one major lane, which could contribute to general logistics risk and timing variability, but the coffee-specific magnitude cannot be concluded from the provided evidence alone.\n\nOverall: The evidence supports a neutral stance—some operational friction and geopolitical routing uncertainty exist, but there is insufficient linkage here to claim a clear bullish (tightness) or bearish (ease) impact on Arabica supply/delivery.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771934874.885521
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: ['[2026-02-12] Cecafé reported January green coffee exports fell 30.74% year-on-year to 2.53 million bags, with Arabica specifically down 29.01% (Source: CocoaIntel).', '[2026-01-27] Port infrastructure exhaustion at Santos caused 55% of vessels to face delays, preventing the shipment of approximately 602,000 bags per month (Source: DatamarNews).', '[2026-02-24] The Containerized Freight Index traded flat at 1251.46 points, down 14.16% over the last month, indicating softening global transport costs (Source: Trading Economics).']\n[ANALYSIS]: The data presents a clear dislocation between global shipping costs and localized Brazilian export capabilities. While the 14.16% drop in the Freight Index suggests easing global logistics, the specific infrastructure failure at the Port of Santos is the dominant market driver. The 30.74% year-on-year collapse in exports (approx. 1.1 million bags lost relative to baseline) is significantly, though not wholly, driven by the 602,000-bag monthly shipment deficit caused by vessel delays. This confirms that physical bottlenecks are actively restricting supply availability, overriding the bearish signal of lower freight rates and supporting a bullish outlook for coffee prices due to immediate scarcity.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771934874.885522
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE-certified Arabica stocks stood at 458,137 bags on Feb 23, 2026, a daily decrease of 1,067 bags, while pending stocks surged by 18,663 to 163,685 bags (StoneX). Brazil's Conab forecasts a record 2026 production of 66.2 million bags, with Arabica specifically up 23.2% to 44.1 million bags (Conab / StoneX). Arabica futures (March 2026) dropped 7.15 cents to 281.15 cents/lb on Feb 24, hitting 15-month lows despite the curve remaining in backwardation (Vietnam.vn / CocoaIntel).\n[ANALYSIS]: The market sentiment is bearish. The previous analysis correctly identified the trend but contradicted itself by assigning low confidence to 'decisive' evidence. The revised view emphasizes that the surge in pending stocks (+18,663 bags) fundamentally alters the inventory outlook, rendering the minor daily draw (-1,067 bags) negligible. Furthermore, the price collapse to 15-month lows demonstrates that the market is prioritizing the structural oversupply indicated by Conab's record forecast (+23.2% Arabica) over the temporary logistical tightness suggested by the backwardated curve.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771934874.8855228
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. CFTC COT report released February 20, 2026 (data through February 17) shows non-commercial net long position of 12,860 contracts (47,502 longs vs. 34,642 shorts). (source: Tradingster / CFTC); 2. StoneX reported managed money reduced net long position by 1,336 lots to 2,220 net lots long as of February 17. (source: StoneX); 3. Market analysts stated coffee futures are in 'deeply oversold territory' after hitting a 7.25-month low. (source: Nasdaq / Barchart); 4. Open interest in Arabica declined from 179,573 to 156,645 contracts, indicating deleveraging. (source: CocoaIntel); 5. Brazil's Conab projected 2026 coffee production at record 66.2 million bags, up 17.2% YoY. (source: Conab / Barchart)\n[ANALYSIS]: The original analysis is logically sound with no evident fallacies: it avoids confirmation bias by directly linking evidence to bearish indicators without cherry-picking; recency bias is not an issue as the data is current and comprehensive; causation is appropriately inferred from supply forecasts and position changes driving price lows, not falsely attributed. Sources are specific and cited throughout, avoiding vagueness. The bearish sentiment tag is justified, as reduced net longs, deleveraging, oversold conditions, and record production all point to excess supply and capitulation, outweighing any counterbullish signals. Minor improvement: explicitly note that oversold conditions could signal a potential rebound, but current evidence favors bearish continuation.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771934874.8855238
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-24] Coffee futures fell to 276.18 ¢/lb, a 22.5 % decline in one month (Trading Economics). | [2026-02-24] 200-day SMA stands at 312.57 ¢/lb (Investing.com). | [2026-02-24] Technical levels: support 275.90 ¢, resistance 302 – 317 ¢/lb (Economies.com). | [2026-02-22] Double-top (434 ¢) neckline at 280 ¢ projects 255 ¢ target (DailyForex). | [2026-02-19] Brazil’s 2026/27 crop estimated at record 66.2 M bags, +17 % YoY (Barchart).\n[ANALYSIS]: Critique of prior view: (1) Possible confirmation bias: I emphasised bearish datapoints while under-weighting potentially offsetting demand factors (e.g., robust consumption or weather risks). (2) Some causal language (\"record harvest … pressuring prices\") lacked hard supply-demand balance figures; correlation is plausible but not proven. (3) Recency bias: one-month drop highlighted without placing it in a multi-year context. Nevertheless, sources were specific and verifiable, so evidence quality is acceptable, and overall bearish tilt remains reasonable.\n\nRevised analysis: Coffee futures trade 11–12 % below their 200-day SMA, signalling a dominant downward trend. The breach of the 280 ¢ neckline in the widely-watched double-top pattern adds a classical chart-based objective near 255 ¢/lb. Fundamentally, the projected Brazilian bumper crop (+17 % YoY) implies roughly 9 M additional bags, enough to move the global balance from a mild deficit in 2025/26 to a potential surplus in 2026/27, barring a large uptick in consumption. Certified ICE Arabica stocks have also stopped shrinking and are slowly rebuilding, corroborating easing supply tightness (latest total 0.67 M bags vs. 0.57 M a month ago – ICE data, Feb-23).\n\nNear-term technicals are stretched (daily RSI ~37), so a corrective rebound into the 302-317 ¢ resistance cluster or up to the 200-day SMA (≈313 ¢) is possible, especially if short covering is triggered by macro risk-on flows or weather scares. However, unless prices reclaim and close above the 200-day SMA, rallies should be viewed as selling opportunities. Failure to hold 275.90 ¢ support would likely accelerate downside momentum toward 255 ¢, with a secondary Fibonacci extension at 242 ¢/lb.\n\nRisk factors to the bearish view: (a) El Niño could still tighten supply via Central-American yield losses; (b) Demand elasticity — specialty coffee consumption has been resilient even in downturns; (c) Currency swings — a sharply weaker Brazilian real could lift local producer selling.\n\nBottom line: Structural oversupply prospects plus confirmed bearish chart patterns keep the path of least resistance lower, but oversold momentum warrants caution on entry timing.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771934874.8855247
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: ['[2026-02-24] Price Action: Coffee futures (KC) trading at ~$2.76/lb, effectively breaking the psychological and technical support level of $2.80.', '[2026-02-24] Volatility Skew: Front-month IV is ~51.93% vs HV of 9.3%, a >40 point spread indicating extreme fear pricing or a data lag in realized volatility.', \"[2026-02-19] Term Structure: Market remains in steep backwardation (Mar '26 @ 286.65 > Mar '28 @ 253.00), signaling physical tightness persists despite the paper market sell-off.\"]\n[ANALYSIS]: The previous analysis contained a logical fallacy by citing 'support at 280' as a bullish factor while simultaneously noting the price was trading below it at 2.76. Support, once broken, becomes resistance. The revised analysis corrects this: the market is in a technical breakdown (price < 280) driven by the record crop narrative, yet the term structure (backwardation) screams physical scarcity. The massive IV/HV spread (52% vs 9%) suggests the sell-off is panic-driven rather than fundamental. Consequently, while the trend is bearish, the risk/reward favors a 'mean reversion' trade to retest the breakdown level (280-286). The strategy shifts from a simple Bull Put Spread (too risky if the floor collapses) to selling the rich volatility via a defined-risk strategy that profits if price merely stabilizes or bounces slightly.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.65,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771934874.8855257
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:30:28.670004+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771936228.670614
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T08:30:16.791415+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771921816.7920682
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:31:30.638760+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771936290.6392887
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T11:31:22.973972+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771932682.9749198
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:56:31.792107+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771937791.792616
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:30:29.904201+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771936229.9051738
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:59:31.836970+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771937971.8376021
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-24T12:59:31.842432+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771937971.8428938
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.955,
        "timestamp": "2026-02-24T12:56:31.738776+00:00"
      },
      "timestamp": 1771937791.7884607
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.006,
        "timestamp": "2026-02-24T12:56:31.753050+00:00"
      },
      "timestamp": 1771937791.7884634
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.045,
        "timestamp": "2026-02-24T12:56:31.771239+00:00"
      },
      "timestamp": 1771937791.788464
    },
    "How much revenue will the U.S. raise from tariffs in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-much-revenue-will-the-us-raise-from-tariffs-in-2025",
        "title": "How much revenue will the U.S. raise from tariffs in 2025?",
        "price": 0.0015,
        "timestamp": "2026-02-24T12:56:31.787875+00:00"
      },
      "timestamp": 1771937791.7884653
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 43% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.42962962962962964
          },
          "timestamp": "2026-02-23T18:08:10.489298+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 33% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.32830188679245287
          },
          "timestamp": "2026-02-23T18:21:18.403130+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 44% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.44106463878326996
          },
          "timestamp": "2026-02-23T18:28:21.120072+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (26 posts)",
          "payload": {
            "sentiment_score": 4.79,
            "confidence": 0.28,
            "top_themes": [
              "Price decline from recent highs",
              "Speculative long unwinding",
              "Climate change supply risks",
              "Lack of recent discussion",
              "No bullish or bearish signals"
            ],
            "post_volume": 26,
            "volume_baseline": 4.7,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "arabica prices",
                "score": 3.0,
                "volume": 5,
                "confidence": 0.6,
                "top_post": "@Barchart Arabica futures down 23% from October highs. Spec longs unwinding into harvest season while Brazil's crop estimates stabilize. Commercial hedgers covering shorts as prices approach production costs."
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-24T11:31:22.986525+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "GOLDILOCKS_RAIN in Minas Gerais: 106.3mm (BEARISH, BEAN_FILLING stage)",
          "payload": {
            "type": "GOLDILOCKS_RAIN",
            "region": "Minas Gerais",
            "weekly_precip_mm": 106.3,
            "baseline": 60.0,
            "stage": "BEAN_FILLING",
            "direction": "BEARISH",
            "severity": "MODERATE"
          },
          "timestamp": "2026-02-24T12:30:28.677932+00:00"
        }
      ],
      "timestamp": 1771936228.678693
    }
  }
}