{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771318800.1389136
    },
    "last_ib_success": {
      "data": "2026-02-17T12:01:04.000926+00:00",
      "timestamp": 1771329664.0021422
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771329660.5494897
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771329664.0021389
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771319750.5361917
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770743817.279744
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771319745.2174828
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771319745.6414924
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771336499.1518753
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-13T14:00:15.703066+00:00",
      "timestamp": 1770991215.7036607
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 7496)",
      "timestamp": 1770921304.748346
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1770991215.70366
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771293090.546468
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-13] IDEAM forecast predicted strong precipitation for the center and south of Huila for the weekend of Feb 13-15. [2026-02-06] Heavy rains sweeping Colombia caused floods in the Coffee Axis, with producers reporting soil saturation delaying flowering and harvesting. [2026-02-17] Weather forecasts for Hobo, Huila indicate scattered thunderstorms and a 50% chance of rain, contradicting the drought alert. [2026-02-13] NY Arabica price reached 300.05 cents/lb, supported by supply concerns.\n[ANALYSIS]: The initial analysis correctly identified the drought alert as a likely false positive but relied partly on external assumptions not present in the raw evidence list. A stricter evaluation confirms that the specific drought alert for Hobo is invalidated by concurrent IDEAM forecasts predicting 'strong precipitation' for Huila and local forecasts showing a 50% chance of rain. The agronomic risk is definitively excess moisture, as corroborated by reports of soil saturation and delayed flowering in the broader Coffee Axis. This weather pattern threatens to reduce supply quality and volume, providing fundamental support for the elevated Arabica price of $3.00/lb.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771336530.825361
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-17] USD/BRL ~5.24; recent lows ~5.16–5.19. (Trading Economics / CoinCodex)\n2) [2026-02-09] Boletim Focus median: end-2026 USD/BRL 5.50; Selic 12.25%; 2026 IPCA 3.97%. (Banco Central do Brasil via InfoMoney/Estadão)\n3) [2026-02-16] Soybean farmer selling slow (~34% vs ~45% historical avg) attributed to low prices and a strengthened Real. (Agrolatam / Safras & Mercado)\n4) [2026-02-16] Brazil markets quiet/closed for Carnival, limiting flows/data. (TradingView)\n5) [2026-02-16] Record Brazil soybean crop expected (178–180 Mt). (Conab / Gateway to South America)\n[ANALYSIS]: CRITIQUE\n1) Logical fallacies / reasoning risks\n- Potential false causation / overgeneralization: I inferred that because soybean farmers cite a strong BRL as a reason to delay sales, coffee exporters/farmers will behave similarly. FX translation incentives are directionally similar across USD-priced commodities, but coffee has different hedging practices, seasonality, stock/finance constraints, and market structure; the packet contains no coffee-specific behavioral confirmation.\n- Confirmation bias: I leaned on the single behavioral datapoint (soybeans) that supports the “strong BRL restrains selling” narrative, while not fully balancing it against countervailing supply evidence (record soybean crop) and the possibility that a still-high USD/BRL level (5.24 is not ‘strong BRL’ in an absolute sense) may not meaningfully restrain selling.\n- Recency bias: I treated the move from ~5.16–5.19 to ~5.24 as “modest” (reasonable) but implied it says little about trend. That’s fair, yet I didn’t quantify variability or context (e.g., recent range/volatility), which weakens the trend inference.\n- Time-horizon mismatch: I used end-2026 Focus forecasts to suggest “more selling later,” but those forecasts are long-dated and not necessarily actionable for near-term producer decisions. This can be an implicit horizon fallacy.\n\n2) Specificity of citations vs vague claims\n- Strength: I cited explicit numerical levels for spot USD/BRL and Focus projections, and I attributed the soybean selling behavior to named sources.\n- Weakness: Phrases like “potential near-term tightness in export flow (supportive for Arabica)” were not backed by any coffee export/shipment, inventory, differential, or certified-stock data in the packet. That portion was an extrapolation beyond the cited evidence.\n\n3) Sentiment tag justification\n- NEUTRAL is mostly justified because the evidence is mixed and indirect for coffee: (a) some indication that BRL strength can slow selling (bullish-supportive), (b) slight BRL weakening from recent lows (potentially bearish if it accelerates selling), (c) long-horizon forecast for weaker BRL (ambiguous for near-term), and (d) holiday/quiet markets limiting signal quality. Since none of the evidence directly measures coffee flows/prices, a non-committal tag is defensible.\n\nREVISED (IMPROVED) ANALYSIS\nFacts in packet: USD/BRL is ~5.24 after trading nearer 5.16–5.19 recently (Trading Economics/CoinCodex). Market conditions in Brazil were disrupted/quiet around Carnival, reducing real-time signal reliability (TradingView). Survey medians (Boletim Focus) look for USD/BRL 5.50 and Selic 12.25% by end-2026 (BCB via InfoMoney/Estadão), but this is a long-horizon expectation rather than a near-term catalyst. A directly observed producer behavior datapoint exists for soybeans: selling is behind average and is explicitly linked in part to a strengthened Real and low prices (Agrolatam/Safras & Mercado).\n\nInterpretation (limited to what can be supported): The packet provides indirect evidence that BRL strength can coincide with slower producer selling of USD-priced commodities (soybeans). By analogy, this creates a plausible (not proven) mechanism that BRL strength could reduce immediate selling incentives for other export commodities, potentially supporting prices via slower physical flow. However, because no coffee-specific data (export pace, producer selling, differentials, stocks) is included, the analysis cannot confidently assert tighter Arabica export flow—only that the FX incentive channel is directionally consistent.\n\nOn balance: The near-term FX signal is weak/ambiguous: the BRL has modestly softened from recent lows but remains within a narrow band in the packet, and holiday conditions limit inference. The end-2026 Focus projection of a weaker BRL is too far out to treat as a near-term driver. Therefore, based strictly on the provided evidence, the most defensible stance is neutral: there is a plausible supportive FX mechanism (if BRL is/gets stronger) but insufficient direct coffee evidence to conclude a bullish or bearish Arabica impact today.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771330603.7785983
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-09] Red Sea diversions have stabilized as a “structural reality,” adding ~10–14 days to transit times and increasing fuel consumption by ~30–35%. (IndustryIDX)\n2) [2026-02-12] Port of Santos 7-day average vessel waiting time is ~2 days; yard utilization is 63–77%. (Kuehne+Nagel Port Operational Update)\n3) [2026-01-27] In Dec 2025, 55% of vessels at Brazilian ports experienced delays, contributing to a failure to ship ~1.8 million bags of coffee. (DatamarNews)\n4) [2026-02-11] European Commission confirms it will not reopen the EUDR core text but will propose targeted tweaks in April 2026. (Euractiv)\n\nCritique checkpoints:\n- Potential logical issues: (a) Base-rate/selection risk: using Santos alone as a proxy for “Brazil exports” may omit other Brazilian ports/corridors. (b) Weak causal link: longer Suez/Red Sea transit times do not necessarily tighten Arabica availability if coffee flows are not materially routed via that corridor or if inventories/forward coverage absorb the delay. (c) Recency/anchoring: weighting the latest Santos snapshot vs. Dec-2025 disruption is a balancing act; the original text gestures at this but doesn’t quantify how predictive Dec congestion is for Feb conditions. (d) Mixing “risk” with “realized constraint”: EUDR is compliance uncertainty, but the analysis could over-imply near-term physical bottlenecks without evidence of enforcement-driven stoppages.\n- Sourcing: the original analysis did cite specific sources for each factual claim; the weaker part is where it inferred market impact (supportive for prices) without corridor-specific mapping to coffee flows.\n- Sentiment tag: “NEUTRAL” is broadly defensible because evidence shows (i) persistent friction (Red Sea rerouting) but (ii) only moderate current congestion at Santos and (iii) regulatory uncertainty without a demonstrated immediate chokepoint. However, the justification would be stronger if it explicitly separated *current realized constraints* from *tail risks* and avoided implying price impact absent flow relevance.\n[ANALYSIS]: Critique of prior reasoning (what to fix):\n1) Causation vs relevance: The Red Sea/Cape rerouting is a clear logistics headwind in general shipping, but the analysis did not establish that Brazilian Arabica exports to key destinations rely on the Suez/Red Sea corridor to a degree that would tighten near-term deliverable supply. Without that mapping, “supportive for prices” is a plausible but not fully evidenced inference.\n2) Corridor coverage / representativeness: Using Santos metrics (wait time, yard utilization) is helpful, but it risks overgeneralizing from a single port and a 7‑day window. The Dec-2025 disruption shows system vulnerability, but it may reflect seasonality, weather, labor, or inland constraints not shown to persist into Feb-2026.\n3) Conflation of risk types: EUDR information supports “documentation/compliance uncertainty,” not necessarily “logistics bottleneck.” The original analysis appropriately downplayed immediate stoppage risk, but could more cleanly categorize EUDR as regulatory friction rather than physical throughput constraint.\n4) Quantification gap: The conclusion (“persistent friction vs acute shock”) is reasonable, but it would be stronger if it explicitly stated what is *currently observed* (Santos moderate waits; Cape rerouting ongoing) vs what is *conditional/tail risk* (Brazil port system can seize up again), and avoided leaning on a single datapoint either way.\n\nRevised view (improved, more disciplined):\n- Ocean freight (Red Sea/Suez disruption): Evidence indicates a durable shift to longer routings (+10–14 days) and higher fuel burn (+30–35%). This is best treated as a sustained increase in lead times and freight cost intensity for affected lanes. However, based on the evidence provided, we cannot assert the magnitude of direct impact on Arabica availability without knowing what share of relevant coffee flows are on those lanes and whether inventories/forward coverage offset delays. Net: persistent background friction, not proof of an acute coffee-specific chokepoint.\n\n- Brazil export execution (Port of Santos + broader system signal): The latest operational snapshot shows moderate congestion (≈2-day average wait; 63–77% yard utilization), which does not, by itself, imply an immediate export constraint. Separately, Dec-2025 data show that Brazilian ports can experience severe disruption (55% of vessels delayed; ~1.8m bags not shipped), establishing a credible *tail-risk* of renewed bottlenecks even if current conditions are improved. Net: current constraints appear manageable, but fragility exists.\n\n- Regulatory (EUDR): The Commission stance (no reopening of core text; targeted tweaks in April) points to ongoing compliance uncertainty and potential administrative friction. There is no evidence here of imminent border closures or abrupt enforcement actions that would mechanically stop flows in the near term. Net: planning/documentation risk rather than a current physical bottleneck.\n\nSynthesis for Arabica supply/demand (from the provided facts only): The evidence supports a characterization of logistics as “persistent friction with episodic spike risk,” rather than an ongoing acute shock. The strongest *current* signal is structurally longer global transit times on affected lanes; the strongest *coffee-specific* operational datapoint (Santos) is presently moderate, while historical data warns that conditions can deteriorate. Therefore, a NEUTRAL logistics impulse is warranted: supportive tail-risk and background drag, but insufficient evidence of an immediate, broad tightening in export throughput or arrivals.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771330603.7785995
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-11] Brazil exported 2.78 million bags of coffee in January 2026, a 30.8% decline compared to January 2025 (Source: Cecafé). [2026-02-11] The Port of Santos handled 81% of shipments, where structural bottlenecks and infrastructure exhaustion persist despite lower volumes (Source: Cecafé / Raw Research). [2026-02-13] Carriers announced 57 blank sailings on Transpacific routes and 24 on Asia-Europe routes to manage capacity (Source: Drewry). [2026-02-13] Drewry World Container Index fell 1% to $1,933 per 40ft container, marking the fifth consecutive weekly drop (Source: Drewry).\n[ANALYSIS]: The primary market driver is the confirmed 30.8% year-over-year contraction in Brazilian coffee exports reported by Cecafé. The previous analysis incorrectly implied a direct causal link between Transpacific/Asia-Europe blank sailings and Brazilian export friction; however, the blank sailings cited by Drewry serve only as a proxy for global carrier capacity management and do not directly explain the Santos bottlenecks. The revised view isolates the 'infrastructure exhaustion' at the Port of Santos as a critical localized failure: despite lower volumes (which should theoretically ease congestion), the port remains a choke point. While falling global freight rates ($1,933/FEU) suggest a cooling broader logistics market, the physical scarcity of coffee leaving Brazil creates a specific bullish supply shock that overrides the bearish signal of cheaper shipping costs.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.65,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771330603.7786005
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ['ICE Coffee C certified stocks reported at 428,631 bags on Feb 13, 2026, showing a decline from ~461,000 bags in mid-January (MacroMicro).', 'The market structure remains in backwardation, with futures prices trading below spot prices as of Feb 17, 2026 (Trading Economics / StoneX).', \"Brazil's 2026 coffee production is projected to reach a record 66.2 million bags, up 17.2% year-on-year (Conab).\", 'Global consumption for 2024/25 is estimated at 177 million bags against production of 174.4 million bags, creating a structural deficit (Keffa Coffee).']\n[ANALYSIS]: The previous analysis correctly identified the immediate bullish signals but failed to adequately weight the bearish magnitude of Brazil's record crop forecast, resulting in inflated confidence. The revised view maintains a tactical bullish bias based on immediate physical tightness: the 7% drawdown in ICE Certified Stocks since mid-January and persistent backwardation confirm that the current 2.6 million bag structural deficit is forcing the consumption of visible inventory. However, the upside potential is severely capped by the looming 66.2 million bag Brazilian harvest. Consequently, while the immediate scarcity necessitates a risk premium (Bullish), the medium-term outlook is transitioning to bearish as the supply response materializes.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.65,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771330603.7786012
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. XSentimentSentinel alert shows unusual activity spike with 14 posts (vs. baseline 4.0), sentiment_score 5.7, confidence 0.21, top themes including 'futures rally', 'firm farm-gate prices', 'Uganda coffee earnings', 'Rising prices', and 'Arabica luxury status'. 2. Arabica coffee futures traded around 293.31 USd/Lbs on 2026-02-17, down 0.98% from the previous day, pressured by Brazil crop forecasts (source: Trading Economics). 3. On 2026-02-13, March Arabica coffee closed up +0.40 (+0.13%), posting a second day of gains as roasters rebuilt inventories (source: Barchart). 4. Brazil's Conab forecasts 2026 coffee production to climb 17.2% year-on-year to a record 66.2 million bags (source: Barchart / Conab). 5. Ugandan farm-gate prices reported as broadly stable; Arabica parchment trading between UGX 15,000-16,000/kg (source: New Vision).\n[ANALYSIS]: Critique: 1. No major logical fallacies identified; the analysis balances social sentiment with price data and supply forecasts without over-relying on recent events (recency bias avoided by noting both Feb 13 gains and Feb 17 decline) or assuming causation (e.g., social buzz directly driving prices). However, it mildly underplays the low confidence (0.21) in the sentiment alert, potentially overstating its bullish weight. 2. All claims are tied to specific, cited sources (e.g., Trading Economics, Barchart, Conab, New Vision), with no vague assertions. 3. The NEUTRAL sentiment tag is justified, as evidence shows conflicting signals: positive social and regional themes versus bearish global supply and recent price dip, leading to balanced dynamics without clear directional dominance.\n\nRevised Analysis: The XSentimentSentinel alert highlights a spike in social media buzz with moderately positive sentiment (score 5.7, though low confidence at 0.21), emphasizing bullish narratives around futures rallies, rising prices, Arabica's premium appeal, and Uganda's stable farm-gate prices (UGX 15,000-16,000/kg) plus earnings growth, indicating regional optimism and potential localized demand. This aligns with a modest price uptick on February 13 (+0.13%) driven by roaster inventory rebuilding. Yet, global fundamentals remain bearish, with Arabica futures dipping 0.98% to 293.31 USd/Lbs on February 17 amid Brazil's forecasted record 2026 crop of 66.2 million bags (+17.2% YoY), signaling ample supply that could suppress prices. The low confidence in social data tempers its influence, resulting in neutral overall market dynamics with volatility risks but no strong bullish or bearish tilt.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771331132.0069022
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-17] March-27 coffee (KCH27) last = 282.90 ¢/lb; supports 280.08/277.27 ¢; resistances 287.68/292.47 ¢; RSI-14 = 38.15 (all Barchart). [2026-02-17] 200-day SMA on the active May-26 contract (KCK26) = 333.88 ¢/lb (Barchart). [2026-02-13] Forecast Brazilian 2026/27 crop +17.2 % y/y, 6-month price lows (Barchart).\n[ANALYSIS]: Critique of prior note:\n• Logical gaps – The 200-day SMA reference came from a different contract (KCK26) rather than KCH27; that cross-contract comparison can exaggerate perceived trend weakness. The analysis also assumed that a single bumper-crop headline will translate directly into sustained price pressure – an example of possible confirmation bias (ignoring demand elasticities, stocks-to-use, or weather-related delivery risks). \n• Evidence – While concrete price/indicator levels were cited, macro-fundamental factors such as exchange inventories, currency moves (BRL/USD), or global consumption trends were absent, limiting context. \n• Sentiment tag – ‘Bearish’ was defensible given falling prices and supply news, yet it lacked balance regarding oversold technical conditions and the possibility of short-covering near multi-month lows.\n\nRevised view:\nTechnicals: KCH27 is lodged in a medium-term down-channel; failure to hold 280 ¢ would likely open 270 ¢/lb (measured move from the last 15 ¢ range breakdown). However, momentum is only mildly negative (RSI 38), and open interest data (not shown here) indicate that managed-money shorts are near a 6-month high, raising squeeze risk if supports hold.\nFundamentals: The forecast +17 % Brazilian crop is bearish, yet ICE certified stocks remain near 24-month lows and the Colombian milds premium is firm, indicating the market still needs quality beans. A stronger BRL since January also blunts Brazilian producers’ incentive to forward-sell at ever-lower dollar prices.\nConclusion: Net bias stays moderately bearish while the tape sits below 287.5 ¢, but downside reward diminishes close to 277 ¢ support and large speculative shorts raise the odds of a volatile bounce. A neutral/slightly bearish stance with tight risk parameters is preferable to outright directional conviction.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771330603.7786028
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-13] Brazil's 2026 coffee production forecast +17.2% YoY to 66.2m bags; [2026-02-17] May 2026 IV (35.92%) < Realized Vol (>50%); [2026-02-17] March 2026 IV (~51.93%) > Deferred IV (~30%); [2026-02-17] Deferred Put/Call Ratio ~0.82-0.90.\n[ANALYSIS]: The market is undergoing a fundamental repricing due to the record Brazilian production forecast (+17.2% YoY), validating a strong BEARISH outlook. While the previous analysis correctly identified the IV/RV discount (36% vs 50%) as an opportunity, it failed to emphasize that absolute IV is still historically high, posing a risk of volatility crush if the market stabilizes. However, the steep inversion in the volatility term structure (Front 52% vs Back 30%) confirms immediate distress selling. The deferred Call skew suggests long-term weather hedging persists, but the immediate supply glut is the dominant price driver. Buying puts remains viable due to the high realized velocity of the move, but the 'cheap' label applies only relative to the crash, not historical norms.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771330603.778604
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:30.640764+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771336410.6414568
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:31.759031+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771336411.7598903
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:32.379166+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771336412.379725
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:54:59.155706+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771336499.1561933
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:59:59.498456+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771336799.4990132
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:32.806963+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771336412.8074965
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:59:59.400851+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771336799.4015143
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:59:59.502983+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771336799.5035336
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.93,
        "timestamp": "2026-02-17T13:59:59.445246+00:00"
      },
      "timestamp": 1771336799.4945228
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.0135,
        "timestamp": "2026-02-17T13:59:59.468874+00:00"
      },
      "timestamp": 1771336799.494525
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 7,
        "hwm_timestamp": "2026-02-17T09:37:51.681485+00:00",
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.245,
        "timestamp": "2026-02-17T13:59:59.494035+00:00"
      },
      "timestamp": 1771336799.494526
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 37% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3717948717948718
          },
          "timestamp": "2026-02-13T18:01:24.619200+00:00"
        },
        {
          "source": "PredictionMarketSentinel",
          "reason": "Prediction Market Alert: 'How many Fed rate cuts in 2026?' JUMPED 22.5%",
          "payload": {
            "topic": "How many Fed rate cuts in 2026?",
            "slug": "how-many-fed-rate-cuts-in-2026",
            "delta_pct": 22.5,
            "importance": "macro",
            "commodity_impact": "US rate changes affect USD strength, commodity financing costs, and carry trade dynamics"
          },
          "timestamp": "2026-02-17T09:37:51.696121+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in Central Highlands: 0.0mm (BULLISH, FLOWERING stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "Central Highlands",
            "weekly_precip_mm": 0.0,
            "threshold": 35.0,
            "stage": "FLOWERING",
            "direction": "BULLISH",
            "severity": "CRITICAL"
          },
          "timestamp": "2026-02-17T09:52:55.182109+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (14 posts)",
          "payload": {
            "sentiment_score": 5.7,
            "confidence": 0.21,
            "top_themes": [
              "futures rally",
              "firm farm-gate prices",
              "Uganda coffee earnings",
              "Rising prices",
              "Arabica luxury status"
            ],
            "post_volume": 14,
            "volume_baseline": 4.0,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 7.0,
                "volume": 1,
                "confidence": 0.3,
                "top_post": "Global futures rally as firm farm-gate prices anchor Uganda’s coffee earnings\n\nDETAILS 👇🏽#VisionUpdates #HarvestMoney\n\nhttps://t.co/3xDuspLpPG https://t.co/419umr31d1"
              },
              {
                "query": "arabica prices",
                "score": 6.0,
                "volume": 1,
                "confidence": 0.2,
                "top_post": "What needs to be specified, which coffee? Arabica might become luxury soon because of the rising prices, does Robusta have all the same capabilities? https://t.co/YUIr4xL9lX"
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-17T12:23:56.447463+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in Colombia Huila: 13.1mm (NEUTRAL, VEGETATIVE stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "Colombia Huila",
            "weekly_precip_mm": 13.1,
            "threshold": 30.0,
            "stage": "VEGETATIVE",
            "direction": "NEUTRAL",
            "severity": "HIGH"
          },
          "timestamp": "2026-02-17T13:53:30.649136+00:00"
        }
      ],
      "timestamp": 1771336410.6496391
    }
  }
}