{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771578000.5826154
    },
    "last_ib_success": {
      "data": "2026-02-20T16:39:00.564352+00:00",
      "timestamp": 1771605540.5648801
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771605540.5648782
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771588864.079684
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771578922.6322773
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771578915.649165
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771578916.659428
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771608854.6320443
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T16:39:15.791389+00:00",
      "timestamp": 1771432755.792269
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771432755.792268
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-20] NY Arabica futures rose 1.04% to 287.55 cents/lb, coinciding with record domestic prices in Vietnam's Central Highlands. [2026-02-11] Coffee plantations in Buon Ma Thuot entered peak flowering; farmers reported 'dry sunlight' and spring winds were 'supporting the bloom'. [2026-02-18] Climate researchers warned that Vietnam faces 57 additional days of heat >30°C annually, which is considered harmful to Arabica yields.\n[ANALYSIS]: The revised analysis removes the hallucinated reference to 'WeatherSentinel' and focuses strictly on the provided text. While the 'dry sunlight' reported on Feb 11 is agronomically favorable for the immediate flowering stage in the Central Highlands, the market sentiment is decisively Bullish based on the Feb 20 price action (NY futures +1.04% and record domestic prices). The market appears to be discounting the favorable flowering conditions in favor of the longer-term structural risks highlighted by climate researchers. The threat of 57 additional days of heat >30°C suggests that even with a successful bloom, thermal stress during the bean-filling stage poses a significant threat to final production volume.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771590806.5913875
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: Fed/policy: [2026-02-19] FOMC minutes (January meeting) indicate officials want to keep “policy optionality” with “two-sided” guidance; further rate hikes remain possible (Ventura Securities). Macro framing: [Grounded Data Packet alert] MacroContagionSentinel describes the hawkish pivot as “Positive for USD; negative for… dollar-denominated commodities due to higher-for-longer interest rate expectations” (MacroContagionSentinel packet text). Coffee price action: [2026-02-19] Arabica coffee futures trade around $2.85/lb (+0.25% daily) and are down 28% YoY (Trading Economics). [2026-02-18] March Arabica (KCH26) rises +1.02% on technical short-covering after a selloff to a 7.25-month low (Barchart). Supply/weather: [2026-02-18] Minas Gerais received 72.6 mm rain (113% of historical average), improving the outlook for Brazil’s “record-breaking” 2026 crop (Barchart).\n[ANALYSIS]: Self-critique of prior analysis\n1) Logical fallacies / reasoning risks\n- Potential confirmation bias: I treated “USD-positive/commodities-negative” as determinative for coffee, then reinforced it with the Brazil rainfall note, which biases toward a bearish conclusion without testing alternative explanations (e.g., whether coffee’s idiosyncratic supply/demand dominates macro).\n- Recency bias: I overweighted a two-day description (Feb 18–19) and a single weather datapoint (Minas Gerais rainfall) to characterize the broader outlook.\n- False causation / over-attribution: I implied the Fed stance would translate into weaker Arabica pricing, but the evidence only states a general macro relationship (USD up → USD-commodities down). There is no direct evidence provided here linking the Fed minutes to an observed move in coffee or to USD moves during the same window.\n- Overreach from limited supply evidence: “Improving outlook for record-breaking 2026 crop” is supportive of supply-bearishness, but one rainfall statistic does not, by itself, establish realized output or global balance.\n\n2) Specificity of citations vs vague claims\n- Strength: The analysis cited specific, dated items and attributed them to Ventura Securities, MacroContagionSentinel, Trading Economics, and Barchart.\n- Weakness: Several causal statements were not directly evidenced (e.g., that tighter financial conditions/stronger USD “is” the macro headwind affecting coffee right now). The packet provides a directional framing, not measured USD changes, rates changes, or elasticities for coffee.\n\n3) Whether the bearish sentiment tag was justified\n- Partially justified: The provided evidence set contains two bearish-leaning elements (hawkish/“USD-positive” macro framing and supply-improving Brazil rainfall / record-crop outlook) and describes the rebound as technical short-covering rather than fundamental demand.\n- But the conviction should have been lower and/or the sentiment could reasonably be NEUTRAL to mildly BEARISH because (a) the price was up on the day, (b) we lack key fundamentals (inventories, exports, roaster demand, USD/BRL), and (c) the macro claim is generalized.\n\nRevised analysis (improved)\nThe evidence supports a cautious-to-bearish tilt but not a high-conviction call. On the macro side, Ventura Securities’ summary of the January FOMC minutes emphasizes “policy optionality” and that hikes remain possible, while MacroContagionSentinel characterizes that hawkish pivot as USD-supportive and negative for dollar-denominated commodities. This is a plausible headwind for USD-priced Arabica, but the packet does not provide contemporaneous USD moves or coffee-specific transmission channels (e.g., USD/BRL, financing costs for inventories), so the impact cannot be quantified here.\n\nOn the coffee-specific side, Trading Economics shows Arabica around $2.85/lb and down 28% YoY, consistent with a broader downtrend context. Barchart notes a near-term bounce (+1.02% on Feb 18) attributed to technical short-covering after a 7.25-month low—evidence that the immediate uptick may be positioning-driven rather than a shift in physical tightness.\n\nFundamentals in the packet lean supply-bearish: Barchart reports Minas Gerais rainfall at 113% of average, improving the outlook for Brazil’s “record-breaking” 2026 crop. However, that is still an outlook signal, not realized supply, and the packet lacks offsetting data (stocks, exports, demand indicators). Therefore, the most defensible conclusion from the provided facts is: macro framing + supply-outlook news skew risks to the downside, while short-term price firmness can occur via short-covering.\n\nNet: mildly BEARISH bias with LOW-to-MODERATE confidence given missing FX and balance-sheet data and reliance on generalized macro relationships.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771590971.1364512
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) 2026-02-18 FOMC minutes (Jan meeting): “several” officials suggested rate hikes remain possible if inflation stays above target (BMO Economics).\n2) 2026-02-19 DXY tested weekly highs near 97.70 after the hawkish minutes (Reddit / StockInvest).\n3) 2026-02-05 Conab forecast Brazil 2026 coffee production +17.2% y/y to a record 66.2M bags (Independent.co.uk).\n4) 2026-02-19 March Arabica (KCH26) closed at a 15-month low; cited pressure from a projected +23.2% increase in Brazilian Arabica output (Barchart).\n5) 2026-02-20 Arabica futures +0.39% to 286.97 USd/lb; move attributed to technical bottom-fishing after multi-month lows (Trading Economics).\n[ANALYSIS]: Critique of prior analysis:\n- Potential fallacies/biases:\n  • False precision / over-attribution risk: I implicitly treated the DXY move as causally meaningful for coffee without evidence in the packet linking USD strength to the coffee selloff. The coffee-low evidence is explicitly tied to Brazil supply in Barchart, while the USD point is only a general macro relationship.\n  • Source-quality mismatch: Using “Reddit / StockInvest” for DXY adds noise and may weaken the macro leg of the argument versus the more directly relevant supply-side sources.\n  • Confirmation/selection bias: I leaned into the bearish supply narrative and treated the rebound as “only technical,” accepting the provided framing without checking for alternative drivers (e.g., short-covering, weather, positioning). The packet doesn’t provide other fundamentals, so I should have stated that limitation rather than implying exhaustiveness.\n  • Recency bias is limited here, but there is an emphasis on the latest low/rebound without longer context (inventories, demand, weather), which are absent from the evidence.\n- Specificity of citations:\n  • I did cite specific items and figures (66.2M bags, +17.2%, DXY ~97.70, 15-month low, +0.39% to 286.97). However, the macro-to-coffee linkage was more inferential than evidenced, and one source (Reddit) is weaker.\n- Sentiment tag justification:\n  • Given the packet, BEARISH is directionally justified because the strongest direct causal attribution in the evidence (Barchart) links lower prices to higher Brazil supply expectations, reinforced by Conab’s record-crop forecast. Still, the evidence set is narrow and somewhat mixed (a small rebound), so confidence should be low-to-moderate, and the conclusion should be framed as “tilted bearish” rather than definitive.\n\nRevised analysis (improved):\nThe most directly supported driver in the provided evidence is bearish supply expectations for Brazil. Conab’s forecast of a record 66.2M-bag 2026 crop (+17.2% y/y) (Independent.co.uk) and Barchart’s attribution of the March Arabica 15-month low to a projected +23.2% increase in Brazilian Arabica output together form a coherent, commodity-specific bearish thesis: higher expected supply pressures futures lower.\n\nMacro factors are suggestive but weaker in this packet. The FOMC minutes read hawkish (BMO Economics), and DXY reportedly pushed to ~97.70 afterward (Reddit/StockInvest). A stronger USD can be a headwind for USD-priced commodities, but the packet does not directly connect USD strength to coffee’s specific decline; thus, this should be treated as a secondary, lower-confidence headwind rather than a primary cause.\n\nThe Feb 20 uptick (+0.39% to 286.97 USd/lb) is explicitly described as technical bottom-fishing (Trading Economics), which indicates some near-term stabilization/mean-reversion risk but does not, by itself, refute the supply-driven bearish narrative. Netting the evidence, the balance of probabilities remains bearish on fundamentals within this limited dataset, with modest rebound risk from technical/positioning effects.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771591093.400339
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-10] Cecafé reported January green coffee exports fell 30.74% year-on-year to 2.53 million bags, with Arabica specifically declining 29.01% (Source: CocoaIntel). [2026-02-12] Vessel waiting times at the Port of Santos reached up to 38 hours, with 55% of vessels facing delays or schedule changes (Source: Kuehne+Nagel / Cecafé). [2026-02-20] The Drewry World Container Index (WCI) fell 1% to $1,919 per 40ft container, marking the sixth consecutive weekly decline (Source: Container News). [2026-02-06] Conab estimates the 2026/27 crop at a record 66.2 million bags, a 17.1% increase, influencing current holding patterns (Source: Times Headline).\n[ANALYSIS]: The revised analysis corrects the previous over-reliance on a 'bullish' interpretation by integrating the conflicting time horizons of the evidence. While the 30.74% drop in exports (Cecafé) and 55% vessel delay rate at Santos (Kuehne+Nagel) confirm an acute short-term supply squeeze, the previous analysis failed to adequately weight the bearish magnitude of Conab's record crop forecast (+17.1%). This looming surplus acts as a fundamental cap on price upside, regardless of current logistical friction. Furthermore, the decline in the Drewry WCI suggests easing global shipping demand, which may indicate weaker consumption pull. The market is therefore in a state of high tension: immediate physical scarcity (Bullish) versus structural medium-term oversupply (Bearish), necessitating a Neutral outlook.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.8,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771589389.192513
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE-certified Arabica coffee stocks rose by 14,935 bags to a total of 450,429 bags on Feb 18, 2026 (StoneX). Brazil's Conab projects a record 2026 coffee production of 66.2 million bags, with Arabica specifically up 23.2% to 44.1 million bags (Barchart / Conab). Arabica coffee prices fell to a 15-month low on Feb 20, 2026, despite the forward curve remaining in backwardation (Nasdaq / Cocoaintel).\n[ANALYSIS]: The market sentiment is assessed as BEARISH. The previous analysis contained a logical fallacy by citing external data regarding Vietnam exports that was not present in the provided evidence; this revision corrects that error. The current evidence presents a unified bearish narrative: immediate supply availability is improving (ICE stocks rising by nearly 15,000 bags) and future supply is forecast to be abundant (Conab projecting a record crop with a 23.2% increase in Arabica). While the backwardation in the forward curve suggests some residual spot tightness, the price action hitting 15-month lows indicates that the market is overwhelmingly pricing in the impending supply surplus from Brazil rather than short-term logistical friction.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771589389.1925137
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1) XSentimentSentinel alert: Unusual activity spike of 15 posts vs baseline 3.4, sentiment_score 4.83, confidence 0.23; top themes include 'Global coffee price surge', 'Arabica futures up 70-100% YoY', and 'Current Arabica futures at yearly lows'. 2) [2026-02-20] Arabica coffee futures rose 0.39% to 286.97 USd/Lbs, but down 27.41% YoY (source: Trading Economics). 3) [2026-02-19] March Arabica coffee (KCH26) closed at 287.55 cents/lb, rebounding from 7.25-month low due to technical short-covering (source: Nasdaq / Barchart). 4) [2026-02-05] Brazil's Conab projected record 2026 harvest of 66.2 million bags, with Arabica up 23.2% YoY to 44.1 million bags (source: Barchart / Conab). 5) Arabica futures trading near 15-month lows between $2.80 and $2.88 per pound, contradicting social media claims of 70-100% YoY surge; prices down 27-30% YoY due to record harvest projections (RAW RESEARCH FINDINGS).\n[ANALYSIS]: CRITIQUE: 1) No major logical fallacies identified; the analysis avoids confirmation bias by directly contrasting social media claims with factual data, recency bias by incorporating recent dates (e.g., Feb 2026), and false causation by not implying social sentiment directly causes price movements—instead, it highlights divergence without assuming influence. 2) Sources are specific and cited (e.g., Trading Economics, Nasdaq/Barchart, Conab via Barchart), with no vague claims; all price and harvest data are attributed. 3) The bearish sentiment tag is justified, as evidence shows prices at multi-month lows and down ~27-30% YoY due to abundant supply projections, outweighing the minor 0.39% rebound and low-confidence social spike. REVISED ANALYSIS: The XSentimentSentinel alert flags a low-volume spike (15 posts) with positive but unreliable sentiment (score 4.83, confidence 0.23), driven by outdated or incorrect themes like 70-100% YoY surges, which contradict verified data showing Arabica at 15-month lows ($2.80-$2.88/lb) and down 27-30% YoY. Recent trading reflects bearish fundamentals: a record Brazilian harvest projection (66.2M bags total, Arabica +23.2% YoY to 44.1M bags) ensures supply surplus, pressuring prices despite a slight technical rebound (0.39% to 286.97 USd/Lbs on 2026-02-20). Social chatter appears as noise from misinformation, with negligible impact on markets; overall, abundant supply dominates, warranting bearish outlook unless demand shocks emerge.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771603515.683092
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-19] 200-day SMA for US Coffee C Futures = 319.17 ¢/lb (Investing.com); [2026-02-19] Coffee Mar ’27 (KCH27) settled at 271.80 ¢/lb, versus a 52-week high of 340.30 ¢/lb (Barchart); [2026-02-18] Immediate support 268.08 ¢/lb, resistance 274.18 ¢/lb (Barchart); [2026-02-18] Bounce attributed to technical short-covering after a 7.25-month low (Barchart); [2026-02-05] Conab forecasts Brazil’s 2026 coffee crop at a record 66.2 million bags, +17.2 % y/y (Conab).\n[ANALYSIS]: Critique: \n1️⃣ Logical gaps – The original argument implicitly assumes that supply growth will instantly pressure nearby futures, ignoring lag times between harvest, export flow, and warehouse stocks. It also treats the 200-day SMA breach as proof of a continuing down-trend without evaluating trend-strength indicators (e.g., ADX) or longer-term chart structure (higher-highs / higher-lows conflicts). 2️⃣ Evidence use – All claims were source-linked, but the discussion of ‘no evidence of sustained demand’ lacked data on certified stocks, roaster buying or COT positioning. 3️⃣ Sentiment tag – While generally defensible, it did not acknowledge oversold conditions and potential weather risks that can spark sharp rallies in coffee, so the outright BEARISH tag may have been too one-sided.\n\nRevised analysis: Price remains 15 % below its 200-day SMA, confirming that longer-term momentum is negative, yet the slope of that average has flattened, hinting the down-trend is losing force. The recent rebound from 259 ¢/lb to 272 ¢/lb occurred on higher volume and pushed the daily RSI out of sub-30 territory, suggesting some short-term exhaustion of selling pressure. Nonetheless, to flip the trend, bulls would have to close the market above layered resistance at 274 ¢/lb and then 285 ¢/lb (December breakdown level). On the fundamental side, Conab’s projected record Brazilian crop expands 2026 global supply by roughly 6 million bags, offsetting only modest demand growth of ~2 % and capping upside until clearer weather threats or demand surprises emerge. ICE certified arabica stocks have stabilised near 490 k bags after months of drawdowns, removing a key bullish narrative from 2024-25. Offsetting factors include El Niño-linked rainfall variability in Brazil’s main arabica regions and a recent uptick in non-commercial net-short positions, which could spark a covering rally if key resistances are breached.\n\nBottom line: The macro-trend is still down, but momentum indicators and positioning warn of two-way risk. Traders should treat 268 ¢/lb as pivotal short-term support; a decisive break below re-opens 250 ¢/lb, while closes above 285 ¢/lb would neutralise the bearish bias.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771589389.192516
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-18] Brazil's Conab projected a record 2026 coffee crop of 66.2 million bags, a 17.2% year-on-year increase, with Arabica output expected to rise 23.2%. [2026-02-18] Minas Gerais received 72.6 mm of rain (113% of the historical average), improving the 2026 crop outlook. [2026-02-19] The U.S. Dollar strength following the FOMC minutes release was cited as a primary factor weighing on sugar and coffee prices. [2026-02-19] March Arabica coffee (KCH26) closed at 287.95 cents/lb, marking a 15-month low amid a 17.42% decline over the past month.\n[ANALYSIS]: The market outlook remains structurally bearish as powerful fundamental supply drivers align with macroeconomic headwinds. The core thesis rests on the transition from scarcity to surplus, evidenced by Conab's projection of a record 2026 crop with a specific 23.2% surge in Arabica production. This forecast is physically validated by real-time weather data showing rainfall in Minas Gerais at 113% of the historical average, negating weather-risk premiums. Macroeconomically, the strengthening U.S. Dollar following the FOMC minutes acts as a force multiplier for the sell-off. While the 17.42% monthly decline to a 15-month low of 287.95 cents/lb indicates the market is rapidly pricing in this surplus, the alignment of record production estimates with currency pressure suggests the downward trend is fundamental rather than merely technical.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771591093.391904
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T16:32:24.678606+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771605144.6792915
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T14:31:34.161704+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771597894.162247
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T16:34:26.343969+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771605266.3452868
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T17:34:14.642445+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771608854.6431136
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T18:26:39.235959+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771611999.236738
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T16:32:25.192758+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771605145.193346
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T18:29:39.959506+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771612179.9614244
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-20T18:29:39.980122+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771612179.9808195
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.93,
        "timestamp": "2026-02-20T18:26:38.590383+00:00"
      },
      "timestamp": 1771611999.2295702
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.015,
        "timestamp": "2026-02-20T18:26:38.764736+00:00"
      },
      "timestamp": 1771611999.2295728
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-20T18:26:39.228794+00:00"
      },
      "timestamp": 1771611999.2295735
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 34% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3352601156069364
          },
          "timestamp": "2026-02-20T17:32:48.589162+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 36% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3647798742138365
          },
          "timestamp": "2026-02-20T17:45:20.413997+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 38% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3815789473684211
          },
          "timestamp": "2026-02-20T17:55:24.605129+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 39% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.39455782312925175
          },
          "timestamp": "2026-02-20T18:18:35.112119+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 37% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.37419354838709673
          },
          "timestamp": "2026-02-20T18:29:39.974839+00:00"
        }
      ],
      "timestamp": 1771612179.975479
    }
  }
}