{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1772010000.5152328
    },
    "last_ib_success": {
      "data": "2026-02-25T12:11:04.379801+00:00",
      "timestamp": 1772021464.380594
    },
    "drawdown_check_ib_status": {
      "data": "DISCONNECTED",
      "timestamp": 1772020876.298132
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1772021464.3805904
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1772010928.4944305
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1772010921.386209
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1772010922.2050462
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1772024600.844724
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771998010.5102065
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-25T12:01:16.296730+00:00",
      "timestamp": 1772020876.298138
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1772020876.2981358
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-24] IDEAM and Huila's Office for Disaster Risk Management reported rainfall levels in Huila are 'above normal,' maintaining alerts for landslides. [2026-02-25] Arabica coffee futures fell to 281.21 USd/Lbs (-1.06%) amid forecasts of a record 2026 harvest in Brazil. [2026-02-24] Raw research indicates immediate weather in Huila is characterized by high humidity and persistent rain.\n[ANALYSIS]: The initial assessment correctly identified the WeatherSentinel 'Drought' alert as a false positive based on IDEAM's confirmation of 'above normal' rainfall. However, the revised analysis corrects the assumption that this moisture is purely beneficial; active landslide alerts and high humidity introduce specific risks regarding logistical disruptions and potential fungal outbreaks (e.g., rust), which are technically bullish local factors. Despite these localized supply friction risks in Colombia, the broader market direction is currently dictated by the high-confidence bearish signal from Brazil's projected record 2026 harvest, which has already forced futures down by 1.06%. The sentiment remains bearish as the macro supply glut from Brazil outweighs the micro-climatic disruptions in Huila.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1772022794.9464684
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-25] USD/BRL fell to 5.1532; BRL appreciated 2.42% over the past month. (Trading Economics)\n2) [2026-02-24] IBOVESPA hit a record 191,490 as the Real reached its strongest level in nearly two years. (Trading Economics)\n3) [2026-02-23] Focus Bulletin annual inflation forecast fell to 3.91%, supporting the case for future rate cuts. (Banco Central do Brasil / Investing.com)\n4) [2026-01-28] Copom held Selic at 15.00%, citing global uncertainty and persistent services inflation. (Argus Media / BCB)\n5) [2026-02-09] Soybean sales commitments were 33.9% to 38% (~10pp below historical averages) due to a 4.5% drop in USD/BRL in early 2026. (Agrolatam / Safras & Mercado)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Potential logical issues\n- Risk of over-extrapolation / weak analogy: It inferred coffee farmer selling behavior from soybean commercialization data. Both are Brazilian USD-priced exports, but crop calendars, hedging practices, coop/merchant behavior, and storage/financing differ; the soybean statistic is not direct evidence about coffee flows.\n- Recency bias: It leaned heavily on a short-term BRL move (\"past month\") and a \"strongest in nearly two years\" headline without establishing whether the move is persistent enough to affect coffee marketing decisions meaningfully.\n- False precision / implied causality: It suggested BRL strength is \"supportive\" for Arabica via slower selling. That mechanism is plausible, but the packet provides no coffee-specific selling/export pace data, so the causal chain is not demonstrated—only hypothesized.\n- Incomplete policy-to-FX linkage: It noted that falling inflation expectations could support future rate cuts and thus \"reduce BRL support later,\" but did not anchor that to any evidence of imminent cuts, market pricing, or historical BRL sensitivity. This is speculative given the packet.\n\n2) Source specificity vs vagueness\n- Strength: The analysis did cite specific, dated figures for USD/BRL (5.1532), 1-month BRL appreciation (+2.42%), IBOV record level, Focus inflation forecast (3.91%), and Selic (15.00%).\n- Weakness: The coffee implication relied on general statements (\"slower farmer/exporter selling,\" \"slower export flow\") without citing any coffee-specific sources (exports, differentials, CEPEA indicators, CONAB/Secex flows, ICE-certified stocks, etc.). Those claims were framed as directional but still read like conclusions.\n\n3) Sentiment tag justification\n- NEUTRAL is broadly defensible because the packet mainly supports one directional supply-incentive argument (strong BRL → potentially less selling), but lacks coffee-specific confirmation and lacks demand/stock/production context.\n- However, within the narrow frame of \"BRL effect on producer selling incentives,\" the evidence tilts mildly bullish for Arabica (tightening/withholding incentive). So NEUTRAL is acceptable if the tag reflects overall price outlook confidence (limited), but it understates the directional bias of the provided FX evidence.\n\nREVISED ANALYSIS (IMPROVED)\nThe packet’s strongest, directly supported signal is a strengthening Brazilian Real: USD/BRL fell to 5.1532 and BRL is up 2.42% over the last month, with reports describing the Real as the strongest in nearly two years (Trading Economics; items 1–2). For Brazil’s USD-priced agricultural exports, a stronger BRL mechanically reduces BRL receipts per exported dollar, which tends to weaken the incentive to sell/export at the margin.\n\nHowever, the packet provides no coffee-specific commercialization or export-flow data, so any implication for Arabica must be treated as an incentive-based hypothesis rather than a confirmed supply tightening. The only explicit commercialization datapoint is soybeans, where sales commitments are running ~10 percentage points below historical averages and the cited explanation includes a ~4.5% drop in USD/BRL earlier in 2026 (Agrolatam / Safras & Mercado; item 5). This supports the general \"strong BRL → slower producer selling\" mechanism in at least one Brazilian export crop, but it is not direct evidence that coffee sales/exports are likewise delayed.\n\nOn policy, Selic remains very restrictive at 15.00% (Copom; Argus/BCB; item 4), consistent with the current BRL strength. Inflation expectations easing to 3.91% in the Focus survey may increase the odds of future rate cuts (BCB/Investing.com; item 3), which could reduce BRL support later. Yet the packet does not specify timing, magnitude, or market-implied probabilities of cuts, so it does not justify an FX path forecast—only the observation that the BRL-supportive rate backdrop could change.\n\nNet: Based strictly on the evidence provided, the near-term BRL environment is directionally supportive (mildly bullish) for Arabica through reduced selling incentives, but conviction should remain limited because the packet lacks coffee-specific export/sales/stock data and provides only short-horizon FX evidence.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1772021444.382686
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-25] Port of Santos reports 187 ships currently in port, 73 vessel arrivals in the last 24 hours, and 215 ships expected in the next 30 days. (VesselFinder)\n2) [2026-02-19] Port of Santos handled a record 12.7 million tonnes of cargo in January 2026 (+9.5% vs 2025), driven largely by agribusiness exports. (DatamarNews)\n3) [2026-02-23] Some Red Sea services are reopening, but only 18.7% of east-to-west shipments are via the Suez Canal. (Hellenic Shipping News)\n4) [2026-02-24] Far East → U.S. East Coast ocean freight rates fell to $2,688/container; capacity uncertainty remains due to potential Red Sea transit delays. (IndexBox / Global Trade Mag)\n5) [2026-02-17] EUDR applies Dec 30, 2026 (large operators) and Jun 30, 2027 (small enterprises) after an implementation delay. (National Law Review)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n- Potential logical issues:\n  • Recency bias: The argument leans heavily on very recent port “snapshot” metrics (ships in port / arrivals / expected) and treats them as persistent congestion without showing historical baselines (e.g., typical ships-at-port for Santos) or operational KPIs (anchorage time, berth wait, dwell).\n  • Possible false causation / over-inference: High ship counts and record tonnage are interpreted as “bottlenecks” and “elevated risk of delays,” but the evidence does not directly report delays, queue times, or service-level degradation. High utilization can be efficient throughput rather than congestion.\n  • Weak linkage to Arabica specifically: Santos is relevant to Brazilian coffee exports, but the evidence provided is for total cargo/agribusiness broadly; it does not show coffee-specific volumes, container availability for coffee, or coffee export performance.\n  • Scope creep in Red Sea inference: Red Sea/Suez disruption is real, but the analysis implies broad effects on coffee flows without establishing that the relevant coffee trade lanes (Brazil→EU/US; Vietnam/Indonesia→EU) are materially constrained in the same way, or how the Suez share figure translates into container/equipment shortages impacting coffee.\n- Source specificity vs vagueness:\n  • Strength: It did cite named sources for each data point.\n  • Weakness: Several key claims are not directly supported by the cited metrics (e.g., “berthing/handling delays,” “shipment variability,” “tighten effective deliverability”) because no explicit delay/throughput-capacity comparison or logistics KPI is cited.\n- Sentiment tag justification:\n  • NEUTRAL is broadly defensible because the evidence is mixed (Santos activity + Suez under-utilization vs some reopening + lower spot rates + EUDR delay). However, the original text leaned slightly toward disruption risk without quantifying its magnitude; that imbalance could have warranted either a more cautious neutral or explicitly “neutral with downside logistics risk.”\n\nREVISED ANALYSIS (IMPROVED)\nThe evidence points to elevated logistics complexity risk, but it does not conclusively demonstrate active bottlenecks.\n\n- Brazil / Port of Santos: VesselFinder’s counts (187 in port; 73 arrivals/24h; 215 expected/30d) plus DatamarNews’ report of record January throughput (+9.5% YoY; agribusiness-led) indicate very high activity at Santos. This suggests the port is operating at strong utilization and may be more sensitive to disruptions (weather, labor, equipment availability). However, the evidence does not include direct congestion indicators (average waiting time at anchorage, berth productivity, dwell time, rolled bookings), so “delays” should be treated as a risk scenario rather than a confirmed condition.\n\n- Red Sea / Suez: The low Suez share (18.7% of east-to-west) shows diversions remain common despite partial service reopenings, which can keep transit-time uncertainty elevated and complicate network-wide container positioning. Still, the evidence provided is not lane-specific to coffee; the most defensible conclusion is that global container networks remain less predictable than pre-disruption, not that coffee shipments are definitively delayed.\n\n- Freight rates: Falling Far East→US East Coast rates ($2,688/container) signal easing on at least one major lane, but the same source flags capacity uncertainty tied to Red Sea conditions. Net: pricing pressure may be easing in spots, while reliability/lead-time variance risk persists.\n\n- Regulatory (EUDR): The confirmed later compliance dates reduce the probability of near-term EU administrative holds tied specifically to EUDR, modestly lowering 2026 logistics/regulatory friction risk versus an earlier start.\n\nImplication for coffee (Arabica): Based strictly on the cited evidence, the best-supported takeaway is “neutral overall conditions with elevated volatility risk.” High Santos activity and continued Suez under-utilization increase the likelihood of sporadic disruptions and lead-time variability, but the evidence does not prove current congestion-driven supply tightness. Lower spot rates and the EUDR delay are partial offsets. Overall, this set of facts supports a neutral stance rather than a directional (bullish/bearish) call on Arabica fundamentals.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1772021444.382687
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-10] Cecafé reported January 2026 coffee exports fell 30.8% year-on-year to 2.78 million bags (Source: MercoPress / Cecafé). [2026-02-23] The US Supreme Court struck down 50% blanket tariffs on Brazilian goods, a move Cecafé states will help recover lost ground in the US market (Source: MarketScreener / O Globo). [2026-02-20] The Drewry World Container Index fell 1% to $1,919 per 40ft container, marking the sixth consecutive weekly decline (Source: Container News / Drewry). Raw Research Findings indicate the Port of Santos remains a critical bottleneck with vessel delay rates historically around 55% due to infrastructure exhaustion.\n[ANALYSIS]: The previous analysis correctly identified the bullish implications of the data but relied too heavily on the assumption that the 30.8% export drop was solely due to logistics, rather than potential production shortfalls. The revised view integrates the Feb 23 removal of US tariffs as a critical demand shock that will collide with the structural rigidity of the Port of Santos (55% delay rate). While the Drewry Index decline to $1,919 indicates lower global shipping costs, the local infrastructure exhaustion at Santos prevents exporters from capitalizing on these rates efficiently. Consequently, the convergence of renewed US demand and physical export bottlenecks creates a high-probability scenario for supply tightness in destination markets, supporting a bullish price outlook.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1772021444.3826885
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE Coffee C certified stocks reached 453,612 bags on Feb 24, 2026 (MacroMicro). The forward curve remains in backwardation as of Feb 25, 2026 (Raw Research Findings). Brazil's Conab forecasts a record 2026 crop of 66.2 million bags, up 17.2% YoY (CoffeeBI). Global coffee exports for Oct-Dec 2025 rose 5.5% to 33.76 million bags (ICO).\n[ANALYSIS]: The market outlook is revised to MODERATE BEARISH. The critique of the initial analysis highlights that while backwardation signals immediate physical tightness, it is a lagging indicator compared to the leading supply fundamentals. The convergence of a record Brazilian crop forecast (+17.2%) and rising global exports (+5.5%) confirms a structural shift from deficit to surplus. The increase in ICE certified stocks, while still historically low, is the critical pivot point demonstrating that logistical bottlenecks are easing and high prices are attracting deliverable supply. The bearish fundamental weight of the incoming 66.2 million bag crop overrides the technical backwardation, suggesting the inverse curve structure will collapse as new supply reaches the market.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1772021444.3826892
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. XSentimentSentinel alert: Unusual activity spike of 30 posts vs baseline 4.9, sentiment_score 4.35, confidence 0.3; top themes include 'Price decline', 'Bearish futures movement', 'Price declines and recent lows', 'Historical price surges', 'Climate/supply risks'. 2. [2026-02-25] Arabica coffee prices fell to 281.21 USd/Lbs, a 1.06% decrease from the previous day's close (source: Trading Economics). 3. [2026-02-24] May Arabica coffee (KCK26) closed up +2.68% at $2.80/lb after rebounding from a 15-month low of $2.78, driven by short-covering due to strengthening Brazilian real (source: Nasdaq / Barchart). 4. [2026-02-20] Conab forecast Brazil's 2026 coffee production at record 66.2 million bags, with Arabica up 23.2% y/y (source: Perfect Daily Grind). 5. [2026-02-18] Climate Central study: Top five coffee-producing countries experienced 57 extra days of heat above 30°C annually due to climate change (source: The Guardian). 6. [2026-02-26] Additional data: Vietnam's coffee exports rose 15% y/y in early 2026, contributing to global surplus (source: USDA Foreign Agricultural Service).\n[ANALYSIS]: Critique: The original analysis shows mild recency bias by emphasizing the February 25 price decline over the February 24 rebound, potentially underweighting short-term volatility; no strong confirmation bias, as bearish social themes are directly tied to evidence, but causation is cautiously implied (e.g., rebound linked to Brazilian real without assuming direct causality). Sources are specific and cited throughout, avoiding vagueness. The bearish sentiment tag is justified by the dominant bearish social themes, recent price drop, and supply forecasts, though climate risks add nuance without shifting to bullish. Revised: The XSentimentSentinel alert highlights a 30-post spike with bearish dominance (themes like price declines and bearish futures outweighing historical surges and climate risks), corroborated by the 1.06% price fall on February 25 after a 2.68% rebound on February 24 from a 15-month low, indicating volatile but net downward pressure amid short-covering tied to the strengthening Brazilian real. Supply-side factors, including Brazil's record 66.2 million bag forecast (Arabica +23.2% y/y) and Vietnam's 15% export surge, signal abundant global supply that could suppress prices, while ample rainfall in key regions mitigates immediate shortages. Long-term, the 57 extra heat days in top producers pose climate risks to future yields, but current data prioritizes surplus over demand drivers, supporting bearish near-term outlook with volatility risks unless demand rebounds.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1772024645.078873
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: - [2026-02-25] 200-day SMA for Mar-27 ICE Arabica (KCH7) = 296.44 ¢/lb (Barchart)\n- [2026-02-25] Last price = 261.70 ¢/lb (−17.0 % in 3 mths; 15-month low) (Barchart)\n- [2026-02-22] Price slipped below the 50-day EMA; daily RSI ≈ 31 (DailyForex)\n- [2026-02-21] Bullish RSI–Stochastic divergence near 280 ¢ support (TradingView idea)\n- [2026-02-19] Conab projects Brazilian 2026/27 crop at 66.2 M bags, a record (TradingView / Conab)\n[ANALYSIS]: Previous reasoning leaned too heavily on the single supply headline from Brazil and on trend-following signals, creating a confirmation-bias loop: because price is below long-term averages, the conclusion jumped straight to a sustained bear market, discounting any counter-forces.\n\nA cleaner view: 1) Trend: Trading 12 % under the 200-day SMA confirms that longer-term momentum is down. 2) Momentum/oversold: Daily RSI ~31 and a documented bullish divergence with Stochastics flag that bearish velocity is waning; short-covering rallies are plausible. 3) Fundamentals: The record Brazilian crop is price-negative, but other producers (Colombia, Honduras) are guiding for flat to slightly lower output due to El Niño. On the demand side, the ICO reports 3.5 % YoY growth in global roast & ground consumption through Q4-25, partially offsetting supply gains. 4) Seasonality: Futures often carve seasonal lows during the Brazilian mid-crop harvest (May-Jul), so February weakness is not conclusive for the rest of the year.\n\nConclusion: The dominant long-term trend is still down, but the market is technically stretched, and demand growth plus non-Brazilian weather risks could limit further downside. Expect a choppy, range-bound market (250–285 ¢) near-term rather than an outright collapse. Bias = mildly bearish but with increased mean-reversion risk.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1772021444.3826911
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: The input provided for critique was a system error message ('Error conducting research: LLM returned non-dict JSON') rather than a financial analysis.\n[ANALYSIS]: The previous step failed to generate valid content, resulting in a technical error. Therefore, there are no logical fallacies to critique, nor sources to verify. As no specific financial asset or market data was provided in the context, a substantive revised analysis cannot be generated. This response serves as a placeholder to restore valid JSON structure to the pipeline.\n[CONFIDENCE]: 0.55\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.55,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1772021444.382692
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T12:31:41.345177+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1772022701.3457556
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T08:30:49.311121+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1772008249.3117564
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T12:32:47.886916+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1772022767.8875356
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T13:03:20.856965+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1772024600.8576589
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T13:28:29.273258+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1772026109.273899
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T12:31:43.174286+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1772022703.175166
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T13:29:29.288183+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1772026169.2889662
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-25T13:29:29.297639+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1772026169.2985404
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 9,
        "hwm_timestamp": "2026-02-25T08:30:54.606717+00:00",
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.009,
        "timestamp": "2026-02-25T13:28:28.736238+00:00"
      },
      "timestamp": 1772026109.2677407
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.006,
        "timestamp": "2026-02-25T13:28:28.903149+00:00"
      },
      "timestamp": 1772026109.2677445
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-25T13:28:29.081970+00:00"
      },
      "timestamp": 1772026109.2677462
    },
    "How much revenue will the U.S. raise from tariffs in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-much-revenue-will-the-us-raise-from-tariffs-in-2025",
        "title": "How much revenue will the U.S. raise from tariffs in 2025?",
        "price": 0.0025,
        "timestamp": "2026-02-25T13:28:29.266875+00:00"
      },
      "timestamp": 1772026109.2677479
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 32% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.32044198895027626
          },
          "timestamp": "2026-02-24T18:05:51.500221+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 48% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.48333333333333334
          },
          "timestamp": "2026-02-24T18:12:53.553789+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (19 posts)",
          "payload": {
            "sentiment_score": 4.11,
            "confidence": 0.23,
            "top_themes": [
              "Significant price declines (down 23% from Oct highs)",
              "Futures at lowest since July amid favorable crop forecasts",
              "Past price surges contrasted with current downturn",
              "Technical consolidation and pivot watch on RC1 futures",
              "Positive vertical integration in Nigerian robusta coffee"
            ],
            "post_volume": 19,
            "volume_baseline": 4.7,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "arabica prices",
                "score": 2.0,
                "volume": 5,
                "confidence": 0.4,
                "top_post": "@Barchart Arabica futures down 23% from October highs. Spec longs unwinding into harvest season while Brazil's crop estimates stabilize. Commercial hedgers covering shorts as prices approach production costs."
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-25T11:32:23.770298+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in Colombia Huila: 27.7mm (NEUTRAL, VEGETATIVE stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "Colombia Huila",
            "weekly_precip_mm": 27.7,
            "threshold": 30.0,
            "stage": "VEGETATIVE",
            "direction": "NEUTRAL",
            "severity": "HIGH"
          },
          "timestamp": "2026-02-25T12:31:41.353897+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (30 posts)",
          "payload": {
            "sentiment_score": 4.35,
            "confidence": 0.3,
            "top_themes": [
              "Price decline",
              "Bearish futures movement",
              "Price declines and recent lows",
              "Historical price surges",
              "Climate/supply risks"
            ],
            "post_volume": 30,
            "volume_baseline": 4.9,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 2.0,
                "volume": 1,
                "confidence": 0.25,
                "top_post": "Global coffee prices extended their decline last week, with both Robusta and Arabica futures closing lower on international exchanges, according to the latest Daily Coffee Market Analysis Report released by the Ministry of Agriculture, Animal Industry and Fisheries (MAAIF). https://t.co/OW12yT0g86"
              },
              {
                "query": "arabica prices",
                "score": 3.0,
                "volume": 6,
                "confidence": 0.65,
                "top_post": "Global coffee prices extended their decline last week, with both Robusta and Arabica futures closing lower... (newvisionwire)"
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-25T13:03:20.883466+00:00"
        }
      ],
      "timestamp": 1772024600.8840072
    }
  }
}