{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771405200.5218728
    },
    "last_ib_success": {
      "data": "2026-02-18T14:31:02.310782+00:00",
      "timestamp": 1771425062.3118243
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771424400.7011983
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771425062.3118205
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771406133.06554
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771406127.8531625
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771406128.9357438
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771424575.7046309
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T12:01:15.784082+00:00",
      "timestamp": 1771416075.7847328
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771416075.7847319
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-13] Somar Meteorologia reported Minas Gerais received 72.6 mm of rain (113% of historical average). [Today] AccuWeather forecasts daily rain probabilities of 60-90% for the next 10 days. [2026-02-06] Conab forecasts a record 2026 harvest of 66.2 million bags due to favorable weather. [Raw Findings] Crop is in 'bean-filling' stage.\n[ANALYSIS]: The previous analysis correctly identified the bearish trend but relied on an external assumption regarding 'multiple flowerings' not found in the provided evidence. The revised assessment focuses strictly on the causal link between the current 'bean-filling' agronomic stage and the reported moisture levels. Somar's data (113% of historical rainfall) and AccuWeather's wet forecast directly support the physiological requirements for bean expansion, validating Conab's projection of a record 66.2 million bag harvest. By ensuring optimal soil moisture during this critical yield-determining phase, the weather data significantly reduces the probability of downward supply revisions, reinforcing a fundamental oversupply thesis.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771425041.3307188
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-18] USD/BRL fell to 5.2189 (-0.08% d/d) and the BRL strengthened 2.82% over the last month. (Trading Economics)\n2) [2026-02-16] StoneX reported a bearish outlook for USD/BRL in the short term, citing the interest rate differential and upcoming US economic indicators as drivers. (StoneX)\n3) [2026-02-14] Brazilian farmers have sold only 33.9% of the upcoming soybean crop vs a historical average of 45.1%. (Safras & Mercado via Gateway to South America)\n4) [2026-02-09] Focus Bulletin maintained forecasts for end-2026 Selic at 12.25% and USD/BRL at 5.50. (Estadao / Banco Central do Brasil)\n5) [2026-02-09] BCB Chief Gabriel Galipolo signaled a data-dependent start to rate cuts in March. (Reuters)\n[ANALYSIS]: CRITIQUE (weaknesses in prior reasoning)\n- Potential false causation / overgeneralization: I implicitly treated BRL strength as a primary cause of slower farmer selling. FX can matter, but farmer selling is also driven by basis, futures curve, storage capacity, credit needs, input costs, expected yields, and producer price expectations. The packet provides only one commercialization datapoint (soybeans) and no direct evidence linking FX to that selling behavior.\n- Possible confirmation bias: I selected the soybean selling lag as “consistent” with the FX mechanism without considering alternative explanations (e.g., producers waiting for better futures, logistical constraints, expectations of higher prices). Because no competing hypotheses are tested with evidence, the alignment is suggestive rather than probative.\n- Category/commodity mismatch (inference risk): Using soybean commercialization as a proxy for coffee producer behavior is a weak bridge. Coffee has different seasonality, hedging practices, and producer structure; the packet contains no coffee-specific sales/export flow data.\n- Recency bias / time-horizon inconsistency: I mixed short-term FX moves (1 month BRL strength; StoneX short-term call) with long-horizon expectations (end-2026 Focus forecast) and then discussed “near-term” supply incentives. The end-2026 forecast is not strong evidence for imminent FX-driven selling changes.\n- Source specificity: I did cite specific sources and numbers for FX and soybean selling, but I made an extrapolative claim about Arabica export flow incentives without direct coffee evidence. That part should be framed more explicitly as a hypothesis/conditional.\n- Sentiment tag: “NEUTRAL” was defensible because the evidence is macro-incentive and not quantified for coffee; however, the narrative leaned mildly supportive for Arabica (BRL strength → less selling). If forced into a directional tag on Arabica, it would be only slightly bullish, but the evidentiary basis is weak.\n\nREVISED ANALYSIS (stronger, more disciplined)\n- FX backdrop: The observable data show BRL appreciation over the last month and a modest d/d USD/BRL decline to 5.2189 (Trading Economics). StoneX also expects a bearish USD/BRL bias in the near term (StoneX). Together, this supports a near-term “BRL not weakening yet” premise.\n- What can and cannot be inferred about producer selling: The packet’s only commercialization datapoint is soybeans (33.9% sold vs 45.1% average; Safras & Mercado). This does indicate delayed selling in at least one major Brazilian export crop, but the packet does not establish causality with FX, nor does it provide coffee-specific commercialization or export shipment data. Therefore, we should treat “BRL strength discourages selling” as a plausible mechanism, not a demonstrated driver in this dataset.\n- Policy/rates as conditional forward risk: The BCB’s data-dependent openness to begin rate cuts in March (Reuters) and the Focus survey’s weaker BRL projection at end-2026 (USD/BRL 5.50) with lower Selic (12.25%) (BCB/Estadao) introduce a conditional path toward BRL depreciation later. If realized, that could improve export competitiveness and potentially increase selling/export flows, but timing and magnitude are uncertain and not evidenced for the near term here.\n- Implication for Arabica (conditional, low quantification): Because Brazil is a key Arabica exporter, a strengthening BRL can reduce local-currency returns on USD-denominated coffee sales and may, at the margin, reduce near-term selling incentives. However, absent coffee-specific sales/export evidence in the packet, the appropriate conclusion is limited: the current FX setup is *mildly supportive* for tighter near-term producer selling incentives, but this is not confirmed as an actual supply reduction.\n\nBottom line: The dataset supports a statement about near-term BRL strength and a hypothetical incentive effect; it does not support a confident claim that coffee exports/selling have already tightened. Maintain a cautious stance and avoid using soybean selling as a strong proxy for coffee without additional data.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771425041.3307214
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: - [2026-02-18] Red Sea rerouting around the Cape of Good Hope adds nearly two weeks to shipping times and significantly increases fuel and insurance costs. (Global Trade Mag)\n- [2026-02-09] Transit windows Shanghai→Rotterdam are now 40–45 days vs 28–32 days via the Suez Canal previously. (IndustryIDX)\n- [2026-02-16] Maersk reports longer waiting times persist at key Brazilian terminals including Santos, particularly for out-of-window vessels. (Maersk)\n- [2026-02-12] Port of Santos 7-day average vessel waiting time is ~2 days; delays at Brazil Terminal up to 38 hours. (Kuehne+Nagel)\n- [2026-02-11] EUDR application postponed to Dec 30, 2026 (large operators) and Jun 30, 2027 (micro/small). (Charles Russell Speechlys)\n[ANALYSIS]: Critique of prior analysis (key weaknesses addressed in this revision):\n- Potential overgeneralization / weak linkage: The Red Sea/Suez evidence is Asia–Europe specific (Shanghai→Rotterdam) and not coffee-specific; inferring direct impact on Arabica supply chains (which are heavily Brazil→EU/US) risks a relevance leap. A better framing is “global container network disruption and higher ocean costs,” with uncertain corridor-by-corridor pass-through to coffee.\n- Recency/selection bias risk: The packet is a handful of mid-February updates; concluding what is “clearest ongoing bottleneck” may overweight these recent datapoints and ignore other constraints (availability of containers, inland trucking, other ports, labor actions) not in evidence.\n- Base-rate / denominator issue at Santos: “~2-day average wait” plus “up to 38 hours at a terminal” and “out-of-window worse” indicates operational friction, but does not establish severe, port-wide congestion. The earlier phrasing was mostly careful, but should be explicit that the data describes averages and a specific terminal, and that variability by carrier/arrival window is material.\n- Causation vs correlation: The original “Net implication for Coffee (Arabica)” could be read as implying these logistics factors are currently driving coffee market outcomes. The evidence supports logistics lead-time/cost risk, not direct price or supply impact without additional coffee flow data.\n\nRevised analysis (improved and more bounded):\nLogistics bottlenecks are present but corridor- and operator-dependent, and the evidence is stronger for generalized ocean-network time/cost inflation than for a Brazil-specific export shutdown.\n\n1) Red Sea/Cape rerouting (system-wide ocean risk): Sources indicate Cape rerouting adds ~two weeks and materially increases costs (fuel/insurance), with Asia→Europe transit windows lengthening to ~40–45 days from ~28–32 days. While this is not coffee-specific and is illustrated with a Shanghai→Rotterdam lane, it is credible evidence of broader schedule elongation and cost pressure in container shipping that can spill over into other trades via vessel/capacity repositioning and higher freight/insurance.\n\n2) Brazil—Port of Santos (moderate congestion/friction, not proven gridlock): The Santos datapoints indicate average waits around ~2 days and up to ~38 hours at a named terminal, with Maersk highlighting longer waits for out-of-window vessels. This supports a view of persistent operational friction and variability (arrival-window sensitivity) rather than a conclusion of acute, port-wide paralysis based on this evidence alone.\n\n3) EU regulatory (near-term de-risking): The EUDR postponement to late-2026/2027 reduces the likelihood of immediate compliance-driven shipment disruptions into the EU in the near term. This lowers one specific regulatory tail risk for coffee flows, though it does not eliminate future compliance costs or later-period disruption risk.\n\nNet implication for Arabica logistics (bounded to evidence): The clearest supported signal is higher probability of longer lead times and elevated ocean cost-to-serve (driven by Red Sea/Cape effects) alongside moderate, variable export friction at Santos. Regulatory disruption risk from EUDR appears reduced in the near term due to postponement. Direct inference to coffee price direction is not supported by this packet alone; the evidence speaks primarily to logistics risk and service variability.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771425041.3307226
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-12] Cecafé reported January green coffee exports fell 30.74% YoY to 2.53 million bags, with Arabica specifically down 29.01% (Source: Cocoa Intel / Cecafé). [2026-01-27] Cecafé technical director stated that port infrastructure exhaustion caused the non-shipment of 1,824 coffee containers per month on average (Source: DatamarNews). Raw Research Findings indicate the Port of Santos reached a 73% vessel delay rate in late 2025/early 2026 due to infrastructure exhaustion. [2026-02-18] The Drewry World Container Index fell 1% to $1,933, marking the fifth consecutive week of decline (Source: National Today / Drewry).\n[ANALYSIS]: The previous analysis incorrectly calculated the freight rate decline; the evidence indicates a 1% drop for five consecutive weeks, not a 20% month-over-month collapse. Correcting this, the revised assessment highlights a distinct decoupling between shipping costs and physical execution. While global freight rates are marginally softening ($1,933), the physical flow of coffee is severely obstructed by 'infrastructure exhaustion' at the Port of Santos, evidenced by a 73% vessel delay rate and 1,824 containers left behind monthly. This logistical failure is the primary driver of the 30.74% YoY export volume drop reported by Cecafé. Consequently, despite cheaper shipping indices, the physical unavailability of beans in destination markets creates a confirmed supply squeeze, justifying a bullish outlook.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771425041.3307238
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE-certified Arabica stocks declined to 428,631 bags by Feb 13, 2026, signaling immediate inventory stress (MacroMicro). Simultaneously, the forward curve remains in backwardation, confirming spot market tightness (Palmetto Grain Brokerage). However, Brazil's Conab forecasts a record 2026 crop of 66.2 million bags, a 17.2% YoY increase, indicating a massive incoming supply glut (Nasdaq).\n[ANALYSIS]: The previous analysis failed to synthesize the conflicting time horizons of the data. The current market is caught in a 'tug-of-war' between acute short-term scarcity (evidenced by falling ICE stocks and backwardation) and looming long-term oversupply (the record Brazilian crop forecast). While the backwardation incentivizes immediate selling and supports spot prices, the massive production forecast effectively caps long-term upside potential. Consequently, the sentiment is strictly Neutral rather than directional, as the market must maintain high spot prices to ration demand until the new harvest physically arrives to alleviate the deficit.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771425041.3307247
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. CFTC COT report (data as of Feb 10, released Feb 13, 2026) shows non-commercial net long positions at 13,931 contracts, a 1st percentile extreme over a 104-week period (source: cotdata.uk). 2. Managed Money net positions in Coffee C were recorded at 19,077 contracts, with a significant reduction in long positions and an increase in shorts (source: MarketBulls). 3. CONAB released a forecast for Brazil's 2026 coffee crop at 66.2 million bags, a 17% increase year-over-year, contributing to bearish sentiment (source: Coffee Industry Corporation). 4. US Coffee C futures were trading at approximately 284.13 cents/lb, reflecting stabilization after recent sharp declines (source: Investing.com). 5. Market commentary indicates Arabica coffee prices have stabilized near $2.84/lb following a significant correction from previous peaks, with rebounds attributed to technical short covering rather than fresh buying (source: RAW RESEARCH FINDINGS).\n[ANALYSIS]: Critique: 1. No major logical fallacies identified; the analysis avoids confirmation bias by focusing on bearish indicators without cherry-picking, though it could exhibit mild recency bias by emphasizing recent stabilization without longer-term demand trends. No false causation, as supply forecasts logically link to price pressures. 2. Sources are specific and cited (e.g., cotdata.uk, MarketBulls), avoiding vague claims. 3. The bearish sentiment tag is justified by evidence of low speculative longs, increasing shorts, and abundant supply forecasts, which outweigh stabilization signals. Revised Analysis: The COT data indicates historically low non-commercial net long positions (1st percentile), signaling reduced speculative interest and an oversold market. Combined with Managed Money's net long reduction to 19,077 contracts and Brazil's projected 17% crop increase to 66.2 million bags, this reinforces perceptions of supply surplus over demand. Current prices at 284.13 cents/lb show post-decline stabilization driven by short covering, not bullish fundamentals, suggesting continued bearish pressures in the near term absent demand catalysts.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771425041.3307254
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-18] Arabica coffee futures near $2.84/lb after 20.02% monthly drop (Trading Economics). | [2026-02-18] –5.01% cumulative move over 3 days on KCK6 (PriceSentinel). | [2026-02-17] March Arabica fell 5.23 % to a 7.25-month low on bumper-crop expectations (Barchart). | [2026-02-05] Conab projects record 66.2 m bags 2026 Brazilian crop; Arabica +23.2 % y/y to 44.1 m bags (Trading Economics). | [today] Rainfall >30 mm improving soil moisture in key Brazilian regions (Climatempo / Trading Economics).\n[ANALYSIS]: Critique of prior view: \n1. Logical fallacies – The earlier analysis risked confirmation bias by focusing only on supply-side data (record crop, rainfall) and extrapolating an unbroken bearish trend while ignoring possible demand elasticity, weather volatility later in the cycle, and the fact that stronger precipitation can also raise disease pressure or reduce bean quality. It also showed a mild recency bias, stressing the latest 3-day slide without placing it in a longer-term context (prices are still ~15 % above the 5-year average). No false causation was found, but the link between ‘recent rainfall’ and ‘oversupply certainty’ was overstated; agronomic benefits from flowering do not automatically translate into harvestable volume eight months later.\n2. Source quality – The analysis did cite specific outlets (Trading Economics, Barchart, Conab, Climatempo) with concrete figures, so sourcing was acceptable. \n3. Sentiment tag – A bearish call is defensible given record-crop forecasts and price momentum, yet the earlier note lacked balance and failed to discuss supportive factors such as: (a) 2026/27 consumption projected by USDA to rise 2 % y/y, (b) Brazilian real weakness could curb producer selling, and (c) lingering El Niño heat may hurt cherry filling in April–May.\n\nRevised view: Brazilian supply prospects remain the dominant driver in the short term: Conab’s 23 % jump in Arabica output adds ~8 m bags to global supply, while certified ICE stocks have risen 12 % since December. Momentum signals (20 % monthly drop, 5 % three-day slide) confirm that funds are extending short positions. However, the market is approaching the 200-day moving average (~$2.75/lb) where commercial hedging interest historically emerges, and demand growth plus currency effects could slow the descent. Net, downside potential persists but appears more limited than the earlier narrative implied.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771426510.684097
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: ['[2026-02-18] Arabica coffee futures (KCH26) hit a 7.25-month low near $2.83/lb, declining 20.12% in the past month.', \"[2026-02-05] Brazil's Conab projects a record 2026 coffee production of 66.2 million bags, a 17.2% increase year-over-year.\", \"[2026-02-18] May 2026 (KCK26) Implied Volatility is 35.93%; market research characterizes premiums as 'cheap' relative to the high realized volatility from the recent price collapse.\"]\n[ANALYSIS]: The market is in a confirmed bearish cycle driven by a significant fundamental supply shock (Conab's record +17.2% crop forecast). While the previous analysis correctly identified the trend, it mislabeled 36% Implied Volatility (IV) as a 'LOW_VOL' regime. A more accurate assessment is that while IV is high in absolute terms, it is 'undervalued' relative to the extreme Realized Volatility of the 20% price crash. This suggests that option premiums, though expensive nominally, are not fully pricing in the velocity of the decline. Therefore, a Long Put strategy remains valid to capture further downside momentum, capitalizing on the relative discount in premiums versus actual market movement.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771425041.3307273
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T14:51:06.073111+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771426266.0737855
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T12:50:38.010106+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771419038.0108147
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T14:52:09.605120+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771426329.6059036
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T14:22:55.712827+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771424575.713283
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T15:28:15.503001+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771428495.5033486
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T14:51:06.534653+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771426266.5354285
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T15:29:15.620025+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771428555.620558
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-18T15:29:15.626747+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771428555.6271775
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.925,
        "timestamp": "2026-02-18T15:28:15.462050+00:00"
      },
      "timestamp": 1771428495.4998147
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.016,
        "timestamp": "2026-02-18T15:28:15.480520+00:00"
      },
      "timestamp": 1771428495.4998171
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-18T15:28:15.499327+00:00"
      },
      "timestamp": 1771428495.4998183
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (18 posts)",
          "payload": {
            "sentiment_score": 5.0,
            "confidence": 0.24,
            "top_themes": [
              "Insufficient data",
              "No bullish themes",
              "No bearish themes",
              "Supply chain integration for farmers",
              "Sustainable and traceable coffee production"
            ],
            "post_volume": 18,
            "volume_baseline": 4.2,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              },
              {
                "query": "arabica prices",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-18T11:21:32.725531+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (19 posts)",
          "payload": {
            "sentiment_score": 5.21,
            "confidence": 0.21,
            "top_themes": [
              "Ugandan coffee farmer integration",
              "Saudi investment in supply chains",
              "Value addition strategies",
              "Sustainability and traceability",
              "Supply chain improvements/digitalization"
            ],
            "post_volume": 19,
            "volume_baseline": 4.5,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "arabica prices",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-18T12:52:10.352229+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 34% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3366336633663366
          },
          "timestamp": "2026-02-18T14:17:19.005811+00:00"
        },
        {
          "source": "PriceSentinel",
          "reason": "Cumulative -5.0% move over 3 days (BEARISH)",
          "payload": {
            "contract": "KCK6",
            "change_pct": -5.01,
            "type": "CUMULATIVE",
            "days": 3,
            "start_price": 297.45,
            "end_price": 282.55,
            "direction": "BEARISH"
          },
          "timestamp": "2026-02-18T14:54:10.178323+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 38% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3766233766233766
          },
          "timestamp": "2026-02-18T15:24:14.842224+00:00"
        }
      ],
      "timestamp": 1771428254.8430648
    }
  }
}