{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771837200.1805336
    },
    "last_ib_success": {
      "data": "2026-02-23T16:46:52.473250+00:00",
      "timestamp": 1771865212.4743068
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771864740.7457442
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771865212.4743032
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838120.7423933
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838113.7365701
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771838114.467707
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771868033.3892589
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T16:39:15.791389+00:00",
      "timestamp": 1771432755.792269
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771432755.792268
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-23] World Weather Inc. reports frequent showers and thunderstorms in Brazil's coffee areas through Feb 26, with drying expected in Sul de Minas starting Feb 28. [2026-02-20] Minas Gerais received 'ample rainfall' over the past two weeks, supporting a record national production forecast of 66.2 million bags. [2026-02-23] Market analysis clarifies the crop is currently in the 'cherry development and grain-filling stage', not the primary flowering stage, making recent rains beneficial rather than excessive. [2026-02-15] NOAA/CPC reports a 60% probability of transitioning to ENSO-neutral conditions during Feb-Apr 2026, suggesting stable precipitation patterns.\n[ANALYSIS]: Meteorological data from World Weather Inc. (Feb 23) and NOAA (Feb 15) confirms a highly favorable 'grain-filling' phase for Minas Gerais Arabica, effectively dispelling concerns regarding flowering damage. The 'ample rainfall' noted on Feb 20 directly supports the record 66.2 million bag forecast by improving bean density. Crucially, the forecast for drier conditions in Sul de Minas starting Feb 28 mitigates potential quality degradation from excess moisture. This combination of high yield potential and stabilizing weather patterns creates a robust supply outlook, supporting a bearish price trend.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771865188.0925806
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-23] USD/BRL spot fell to 5.1725; Trading Economics notes ~2.05% BRL strengthening over the past month. (Trading Economics)\n2) [2026-02-23] Focus Bulletin lowered the 2026 year-end USD/BRL forecast to 5.45 from 5.50. (Banco Central do Brasil Focus Bulletin / as cited)\n3) [2026-02-23] Focus Bulletin revised end-2026 Selic forecast down to 12.13% from 12.25%. (Banco Central do Brasil Focus Bulletin / as cited)\n4) [2026-01-28] COPOM maintained Selic at 15.00%. (Focus-Economics)\n5) [2026-02-19] USD closed at BRL 5.225 (+0.4% w/w), described as a slight incentive for local currency pricing. (CEPEA/ESALQ)\n[ANALYSIS]: CRITIQUE (what was weak in the prior reasoning):\n- Potential recency bias / cherry-picking: I leaned heavily on a short recent window (\"past month\" BRL strength; one weekly uptick) to infer producer-selling implications, which may not generalize.\n- Risk of false causation / overreach: I implied BRL strength \u00158 selling \u00158 supportive for Arabica. While directionally plausible (FX affects BRL revenues from USD-priced coffee), the packet does not contain direct data on farmer selling, export pace, hedge ratios, basis behavior, or FOB differentials. So the link from FX to actual supply flow was asserted more than demonstrated.\n- Internal tension not fully resolved: I treated a small w/w move (5.225, +0.4%) as meaningful enough to qualify incentives while also saying the broader trend is BRL strength. The magnitude and persistence of these moves were not quantified, so the practical importance is uncertain.\n- Rates discussion was under-anchored: I mentioned Selic levels/forecasts but did not clearly connect them (via carry, capital flows, or credit incentives) to USD/BRL or to near-term producer behavior. Also, comparing current Selic (15%) to an end-2026 expectation (12.13%) mixes horizons.\n- Source specificity: I did cite specific sources for each numeric claim, but some interpretive statements (e.g., \"restrained Brazilian selling\") were not explicitly supported by a cited dataset.\n\nREVISED ANALYSIS (tighter, better-scoped):\nThe evidence set supports a narrow FX conclusion: the BRL strengthened over the last month (USD/BRL down to 5.1725; ~2.05% BRL strength per Trading Economics) and survey expectations marginally shifted toward a slightly stronger BRL by end-2026 (Focus: 5.45 vs 5.50). On its face, a stronger BRL reduces BRL proceeds for a given USD coffee price, which can *reduce* the local-currency incentive to sell/export at unchanged USD prices.\n\nHowever, the packet also shows that short-term fluctuations can temporarily improve local pricing: CEPEA/ESALQ explicitly framed the week-over-week USD uptick to BRL 5.225 (+0.4% w/w on Feb 19) as a \"slight incentive\". This suggests incentives may be episodic and sensitive to tactical USD/BRL bounces rather than driven by a persistent BRL-weakening trend.\n\nOn monetary policy, the only near-term hard fact is Selic held at 15.00% (COPOM Jan 28). The Focus revision to a slightly lower end-2026 Selic (12.13% vs 12.25%) is small and long-dated; by itself it does not establish an imminent FX regime change. Therefore, within this evidence packet, the most defensible macro takeaway for Arabica is limited: recent BRL strength is not a clear catalyst for aggressive Brazilian selling, but the data are insufficient to claim materially tighter producer selling or a strong bullish supply impact. Net effect: macro/FX signals in this packet are mixed-to-neutral for near-term Arabica via the producer-selling channel, with a mild bias toward reduced selling incentives only if BRL strength persists.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771865188.0925834
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: - [2026-02-22] S&P Global flagged high risk of renewed Red Sea attacks if regional ceasefires collapse; CMA CGM reportedly rerouted three Asia–Europe services back via the Cape of Good Hope. (YemenExtra citing S&P Global; note: secondary reporting)\n- [2026-02-12] Port of Santos: 7-day average vessel waiting time ~2 days; yard utilization 63%–77%. (Kuehne+Nagel)\n- [2026-02-19] Port of Santos handled a record 12.7 million tonnes of cargo in January 2026. (DatamarNews)\n- [2026-02-19] EU Commission imposed temporary limitations on the EUDR Information System from Feb 16 until at least mid-April 2026 for technical updates. (Mayer Brown)\n- [2026-02-23] EUDR implementation remains postponed to Dec 30, 2026; experts cite physical segregation requirements as a key upstream cost driver. (Mongabay)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Logical fallacies / reasoning risks\n- Recency/availability bias: The conclusion overweighted a very recent Red Sea/Suez risk item and treated it as the “strongest” bottleneck without comparing magnitude versus other constraints (e.g., freight rates, actual delay statistics, or share of coffee volumes exposed).\n- Potential confirmation bias: The phrasing “reinforcing continued disruption risk” leaned toward emphasizing disruption, while the Santos datapoint (2-day wait) could also support a countervailing interpretation (no acute congestion). The analysis did not explicitly balance these.\n- Possible false precision/causation: It implied a direct linkage from Asia–Europe reroutings to “coffee moving via Vietnam’s Port of Ho Chi Minh toward Europe.” That corridor assumption was not supported by the cited packet (no coffee-specific routing/volume evidence). Also, using a single port-wait snapshot to infer broader “bottleneck severity” risks overgeneralization.\n- Source-strength issue: YemenExtra is secondary; the analysis did not clearly caveat that the S&P Global point was not a primary document in the packet.\n\n2) Specificity of sources vs vague claims\n- Strength: The write-up did cite specific outlets and datapoints (Santos wait time; yard utilization; January tonnage; EUDR dates; system limitations).\n- Weakness: Some claims were not directly evidenced in the packet: (a) that the rerouting is materially “relevant to coffee” and (b) the magnitude of impact on “near-term availability” and “delivered costs” was asserted qualitatively without quantified delay/cost evidence.\n\n3) Sentiment tag justification\n- NEUTRAL is broadly defensible because the evidence is mixed: higher route risk/variability (bearish for delivered supply reliability) versus Santos not showing acute congestion (neutral-to-bullish for Brazilian flow continuity) and EUDR enforcement postponed (reduces immediate regulatory shock).\n- However, the narrative emphasis leaned slightly bearish on logistics risk; if kept, it should be framed as “risk-skewed neutral” rather than implying disruption is the base case.\n\nREVISED ANALYSIS (IMPROVED)\nThe provided evidence indicates uneven logistics and administrative friction, with risk concentrated in specific corridors rather than a uniform global bottleneck.\n\n- Asia–Europe ocean risk (Red Sea/Suez): Secondary reporting (YemenExtra citing S&P Global) suggests elevated risk of renewed attacks and indicates CMA CGM has reportedly rerouted three Asia–Europe services around the Cape. This supports a conclusion of higher transit-time variability and potentially longer lead times for cargo on Suez-exposed Asia–Europe services. The packet does not quantify delays or freight-rate impacts, and it does not establish coffee-specific exposure; therefore, this should be treated as a corridor risk signal rather than definitive evidence of a broad coffee supply squeeze.\n\n- Brazil export gateway (Port of Santos): Two datapoints should be interpreted together: January 2026 throughput was a record (DatamarNews), yet the contemporaneous operational snapshot shows ~2-day average vessel waiting and 63%–77% yard utilization (Kuehne+Nagel). This combination implies high activity but not severe congestion at the time measured. The limitation is that it is a short-window metric and may miss episodic spikes; still, within the packet, Santos appears “busy but functioning,” suggesting no strong evidence here of an acute export bottleneck.\n\n- EU regulatory/administrative friction (EUDR): The compliance deadline remains postponed to Dec 30, 2026 (Mongabay), reducing near-term enforcement pressure. Separately, temporary limitations in the EUDR Information System through at least mid-April 2026 (Mayer Brown) create a near-term process risk (documentation/IT friction) for EU-bound flows, but the packet does not show that this is materially constraining physical shipments yet.\n\nNet implication (coffee logistics context): The evidence supports a neutral baseline with an upside in risk (i.e., a higher probability of episodic disruptions) driven mainly by Asia–Europe route security volatility and EU administrative frictions, while Brazilian port operations in the cited snapshot do not show acute congestion. Overall, the packet indicates uncertainty and variability more than a confirmed, broad-based bottleneck.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771865188.0925844
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-19] Cecafé technical data indicates that 77% of container ships at the Port of Santos faced delays or schedule changes (Source: Cecafé / StoneX). [2026-02-12] Brazil's January green coffee exports fell 30.74% year-on-year to 2.53 million bags, leaving over 600,000 bags unshipped due to delays (Source: CocoaIntel / Raw Research). [2026-02-23] The Containerized Freight Index traded flat at 1,251.46 points, down 14.16% over the past month (Source: Trading Economics).\n[ANALYSIS]: The convergence of a 77% vessel delay rate at the Port of Santos and a 30.74% year-on-year drop in exports confirms a severe physical supply dislocation. While the 600,000 bags explicitly trapped by delays account for over half of the export volume deficit, the magnitude of the decline suggests underlying crop availability issues may also be a factor. The 14.16% drop in the Containerized Freight Index creates a divergence; normally bearish, here it highlights that the bottleneck is specific to port infrastructure rather than global vessel shortages. The inability to move inventory despite cheaper freight rates exacerbates the supply squeeze in destination markets.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771865188.0925856
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE certified Arabica stocks increased by 9,638 bags to 449,566 bags on Feb 20, 2026 (StoneX). Brazil's Conab projects a record 2026 coffee crop of 66.2 million bags, a 17.2% year-over-year increase. Arabica coffee futures settled at a 15-month low on Feb 20, 2026. Global coffee exports for December 2025 reached 11.94 million bags (ICO). The forward curve remains in backwardation.\n[ANALYSIS]: The market sentiment is decisively BEARISH, driven by the convergence of technical price action and fundamental supply data. The 15-month low in futures prices serves as strong confirmation that the market is pricing in the massive supply influx indicated by Conab's projection of a record 66.2 million bag crop (+17.2% YoY). The previous analysis correctly identified the bearish signal from the build in ICE certified stocks (+9,638 bags), which alleviates concerns regarding exchange deliverable inventory. Although the forward curve remains in backwardation—typically a sign of near-term tightness—the simultaneous collapse in flat prices suggests that this structure is a legacy of past tightness rather than a signal of current bullishness; the market is effectively discounting the immediate future against a backdrop of overwhelming incoming supply. The rise in global exports further validates that flow constraints are easing.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771865188.0925863
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. CFTC Coffee COT report as of February 17, 2026 (released February 20) shows non-commercial net long position of 12,860 contracts (47,502 longs vs. 34,642 shorts), down from prior weeks' higher levels, with declining open interest. (source: Tradingster / CFTC); 2. Nasdaq reported oversold conditions in coffee futures, spurring technical short covering after significant price falls on February 19, 2026. (source: Nasdaq); 3. Coffee futures sank to multi-month lows (7.5-month low for Arabica) due to aggressive technical selling and long liquidation on February 18, 2026. (source: CocoaIntel); 4. Market analysis indicates the coffee market is currently oversold following a sharp sell-off, driven by improved supply projections from Brazil and a strengthening U.S. dollar, with no signs of overbought conditions. (source: RAW RESEARCH FINDINGS)\n[ANALYSIS]: The CFTC data reveals a notable reduction in the non-commercial net long position to 12,860 contracts, accompanied by falling open interest, which suggests a deliberate unwinding of speculative bullish bets rather than new short-selling pressure. This shift correlates with prices reaching multi-month lows and entering oversold territory, as confirmed by Nasdaq and CocoaIntel reports, primarily due to favorable supply outlooks from Brazil and USD strength suppressing demand. While short covering may provide temporary support, the overall evidence points to bearish sentiment from perceived supply abundance, without indications of speculative excess that could fuel a reversal.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771865188.0925872
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-20] 200-day SMA = 316.15 ¢/lb; last price = 285.61 ¢/lb; 20-day SMA = 284.33 ¢/lb; 50-day SMA = 288.15 ¢/lb (Investing.com).  RSI(14) = 49.15 and MACD(12,26) = -0.46 (Investing.com).  Pivot support: 284.34 ¢/lb (S1) & 283.15 ¢/lb (S2); resistance: 286.80 ¢/lb (R1) & 288.07 ¢/lb (R2) (Investing.com).  [2026-02-18] Contracts rebounded from a 7.25-month low on technical short-covering (Barchart).\n[ANALYSIS]: TECHNICAL POSITION – Price sits in a narrow 284–288 ¢/lb range, almost on top of the 20-day SMA and only 1 % below the 50-day SMA, but still ≈10 % under the 200-day SMA.  That configuration signals a market trying to stabilise in the short-term while the longer-term trend remains down.  The momentum gauges corroborate that pause: RSI is almost exactly neutral at 49, and MACD is fractionally negative, implying neither strong selling nor fresh upside energy.  Short-covering cited on 18 Feb explains the recent bounce but does not yet prove a durable change in trend; a close above the 50-day SMA followed by a higher-high above 288 ¢ would be needed to shift the technical bias to positive. \n\nFUNDAMENTAL CONTEXT – The previous note attributed the down-trend to ‘abundant supply (e.g., record Brazilian crop)’ without citing a source; that was speculative.  While Brazil’s 2025/26 harvest prospects are generally described as large by agencies such as Conab, no concrete production figure was provided in the evidence set.  Therefore, drawing a direct causal link between the 200-day down-trend and supply overhang is not justified on the data shown.\n\nSENTIMENT CALL – Because short-term signals are flat and longer-term signals are negative, the most defensible stance is NEUTRAL-to-SLIGHTLY-BEARISH.  A confirmed break below 283 ¢ would revive downside momentum; conversely, reclaiming 288–290 ¢ on volume would challenge the bearish narrative.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771865188.0925882
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-23] Coffee futures (KC) fell to 279.40 USd/Lbs (15-month low), down >20% in 30 days. [2026-02-23] IV for March 2026 (KCH26) is ~51%, while May 2026 (KCK26) is 38.86%. [2026-02-23] Historical Volatility (HV) exceeds 70%, making option premiums 'cheap' relative to realized movement. [2026-02-05] Brazil's Conab projects record 2026 crop of 66.2 million bags.\n[ANALYSIS]: The previous analysis suffered from the 'Gambler's Fallacy,' assuming that a 20% decline necessitates a bullish mean reversion despite the overwhelming fundamental supply glut (record Brazil crop). Furthermore, it misdiagnosed the volatility landscape; with Historical Volatility (>70%) significantly exceeding Implied Volatility (~51%), the market is crashing faster than options are pricing in. In this environment, selling premiums (short gamma) via a Bull Put Spread is dangerously exposed to continued downside velocity. The revised analysis aligns with the fundamental bearish trend. The 'cheap' volatility relative to realized movement suggests that buying downside protection (Long Puts or Bear Spreads) is statistically superior to trying to catch a falling knife.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771865188.0925896
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T16:31:56.325975+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771864316.3266108
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T14:31:19.249492+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771857079.2504168
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T18:34:32.754018+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771871672.7549286
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T17:33:53.397959+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771868033.3985264
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T18:46:33.064900+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771872393.067466
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-23T16:31:57.597222+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771864317.5987258
    },
    "PriceSentinel": {
      "data": {
        "status": "IDLE",
        "last_check_utc": "2026-02-23T18:30:27.450504+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771871427.4511206
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "IDLE",
        "last_check_utc": "2026-02-23T18:30:30.460505+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771871430.461176
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.955,
        "timestamp": "2026-02-23T18:31:30.972607+00:00"
      },
      "timestamp": 1771871491.8159873
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.008,
        "timestamp": "2026-02-23T18:31:31.161473+00:00"
      },
      "timestamp": 1771871491.8159897
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-23T18:31:31.636263+00:00"
      },
      "timestamp": 1771871491.8159904
    },
    "How much revenue will the U.S. raise from tariffs in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-much-revenue-will-the-us-raise-from-tariffs-in-2025",
        "title": "How much revenue will the U.S. raise from tariffs in 2025?",
        "price": 0.0015,
        "timestamp": "2026-02-23T18:31:31.815256+00:00"
      },
      "timestamp": 1771871491.8159916
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 44% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.44106463878326996
          },
          "timestamp": "2026-02-23T17:51:02.411531+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 31% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3063380281690141
          },
          "timestamp": "2026-02-23T18:00:06.037966+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 43% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.42962962962962964
          },
          "timestamp": "2026-02-23T18:08:10.489298+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 33% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.32830188679245287
          },
          "timestamp": "2026-02-23T18:21:18.403130+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 44% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.44106463878326996
          },
          "timestamp": "2026-02-23T18:28:21.120072+00:00"
        }
      ],
      "timestamp": 1771871301.1210794
    }
  }
}