{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771491600.1828454
    },
    "last_ib_success": {
      "data": "2026-02-19T14:30:36.619509+00:00",
      "timestamp": 1771511436.6203895
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771510800.3992903
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771511436.620387
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771492518.6884665
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771492510.990554
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771492511.6400437
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771511602.002517
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-18T16:39:15.791389+00:00",
      "timestamp": 1771432755.792269
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1771432755.792268
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771351229.9211683
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-19 | Somar Meteorologia] Minas Gerais received 72.6 mm of rain (113% of historical average) in the recent period. [2026-02-19 | Weather Crave] The 10-day forecast indicates persistent instability with a 90% chance of rain and temperatures peaking at 27°C. [2026-02-16 | CropGPT] Agronomic data clarifies the crop is in the 'cherry expansion' phase, not flowering. Rainfall is +21.8% vs LTA, posing a moderate fungal risk but supporting volume. [2026-02-15 | NOAA/CPC] Positive precipitation anomalies confirmed in East Brazil as La Niña transitions to ENSO-neutral.\n[ANALYSIS]: Meteorological data from Somar and NOAA confirms significant moisture surpluses in Minas Gerais (+21.8% vs LTA), coinciding with the 'cherry expansion' phase identified by CropGPT. While CropGPT notes a moderate risk of fungal proliferation due to high humidity, the prevailing impact of this precipitation is fundamentally bearish for prices as it aids bean filling and density, directly supporting volume estimates for a large 2026 crop. The transition to ENSO-neutral conditions further stabilizes the outlook, reducing fears of late-season drought. The supply-side expansion outweighs current disease risks.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771511425.5372496
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) 2026-02-19: USD/BRL at 5.2357; BRL strengthened 2.63% over the past month (Trading Economics). 2) 2026-02-19: BRL touched 5.16 per USD (strongest since May 2024), attributed to high domestic carry and clearer monetary policy guidance (Trading Economics). 3) 2026-02-18: USD/BRL closed near 5.2228; technical indicators suggest a bearish trend for USD/BRL (DailyForex). 4) 2026-02-14: Farmers sold 33.9% of the upcoming soybean crop vs 45.1% historical average; source attributes slower selling to price uncertainty and a stronger local currency (Safras & Mercado / Gateway to South America). 5) 2026-01-28: BCB kept Selic at 15.00% and signaled a 25–50 bp cut could occur in March (Reuters / Investing.com).\n[ANALYSIS]: CRITIQUE\n1) Logical issues / potential fallacies:\n- Confirmation bias: The prior analysis leaned heavily on one behavioral datapoint (soybean farmer selling) that supports the “strong BRL discourages selling” mechanism, without equally weighing alternative drivers (e.g., commodity-specific fundamentals for coffee, basis/hedging conditions, logistics, inventory needs). It implicitly treated soy selling behavior as strong corroboration for coffee without establishing transferability.\n- False causation / overgeneralization: It inferred implications for Arabica availability from BRL strength plus soybean selling pace. While FX can affect producer selling, the evidence provided only directly links BRL strength to soybean selling and does not directly document coffee farmer/exporter behavior. Extending the behavioral conclusion from soy to coffee is plausible but not proven by the packet.\n- Recency bias: The conclusion is anchored on “past month” BRL appreciation and a technical read, which may be transient. It acknowledged the possible March cut but didn’t explore the range of outcomes (e.g., cuts could weaken BRL and reverse incentives, or carry could still dominate).\n\n2) Specificity of citations:\n- Strength: It cited specific, timestamped levels/changes for USD/BRL (Trading Economics) and a dated technical assessment (DailyForex). It also cited a precise farmer-selling statistic (33.9% vs 45.1%) and attributed the stated reasons to the source.\n- Weakness: It made commodity-impact claims (supportive for Arabica pricing via slower selling/export flow) without a direct coffee-specific source in the evidence packet. That step should have been presented more explicitly as a conditional inference rather than a quasi-factual implication.\n\n3) Sentiment tag justification:\n- The prior NEUTRAL tag is defensible because the evidence is FX-focused and indirect with respect to coffee; it suggests a potential supportive channel (slower selling) but does not provide coffee-specific confirmation or price direction evidence. However, the text itself leaned mildly bullish for Arabica (“supportive for near-term availability/pricing”), so a NEUTRAL tag required clearer framing that the effect is conditional/uncertain.\n\nREVISED ANALYSIS (IMPROVED)\nThe evidence set consistently indicates recent BRL strength: USD/BRL around 5.22–5.24 on 2026-02-18/19 (Trading Economics; DailyForex), a reported 2.63% BRL appreciation over the prior month (Trading Economics), and an intraday/spot move to ~5.16 (strongest since May 2024) attributed to high carry and clearer policy guidance (Trading Economics). DailyForex’s technical view of a bearish USD/BRL trend is directionally aligned with that recent BRL-strength narrative.\n\nMechanically, a stronger BRL lowers BRL proceeds from USD-denominated exports and can reduce the incentive for Brazilian producers to sell forward/export aggressively at prevailing USD prices. The packet provides one direct behavioral data point consistent with this mechanism: Brazilian soybean farmer selling is behind the historical pace (33.9% vs 45.1%), with the cited source explicitly attributing part of the hesitation to the stronger local currency (Safras & Mercado / Gateway to South America).\n\nHowever, translating this directly into a coffee (Arabica) conclusion requires caution: the packet does not include coffee-specific selling/export-flow evidence. Therefore, the most defensible inference is conditional: if coffee producers respond similarly to FX incentives as the soybean example suggests, then the observed BRL strength could be a near-term constraint on producer selling and thus a supportive (tightening) influence on physical availability and potentially prices. That said, the BCB’s guidance that a 25–50 bp cut could occur in March (Reuters/Investing.com) introduces an identifiable catalyst that could change the FX backdrop; if rate-cut expectations begin to dominate carry dynamics, BRL could weaken and the selling incentive could flip. The packet does not yet show such a reversal, so the current evidence supports “BRL strength persists recently,” while the coffee-market impact remains an inference with meaningful uncertainty.\n\nOverall, the evidence is strongest on the FX direction and weaker on commodity-specific transmission to Arabica; conclusions about coffee should be framed as scenario-based rather than asserted.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771511425.5372524
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: - [2026-02-17] UKMTO reported an exchange of fire between a commercial vessel and a small boat ~70 nm SW of Aden, Yemen, indicating security risk in the Red Sea/Gulf of Aden corridor. (The Jerusalem Post / Reuters)\n- [2026-02-12] Port of Santos: 7-day average vessel waiting time ~2 days; yard utilization 63–77%. (Kuehne+Nagel)\n- [2026-02-18] Port of Santos: structural constraints on Anchieta–Imigrantes access; truck traffic peaks >600 vehicles/hour; ~15,000 trucks/day during harvest. (DatamarNews / Agri-Pulse)\n- [2026-01-20] EUDR effective date postponed to 2026-12-30 (large companies) and 2027-06-30 (micro/small) under Regulation (EU) 2025/2650. (EY Global)\n- [2026-02-16] EUDR Information System (TRACES) in a temporary limitation period until mid-April 2026 for revamp/realignment. (Mayer Brown)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Logical fallacies / reasoning risks\n- Recency bias: Heavily weighted a single security incident near Aden to imply broader/continued Suez avoidance. One event is a signal, but not sufficient alone to infer a sustained routing regime shift.\n- Potential false causation / overreach: Jumped from “elevated disruption risk” to “can tighten effective availability” and implicitly toward Arabica market impact without showing that affected lanes meaningfully cover Arabica volumes in the relevant period, or quantifying delay magnitudes/carrying costs.\n- Base-rate neglect: Did not benchmark Santos metrics against normal seasonal harvest congestion; 2-day average vessel waiting and 63–77% yard utilization could be within typical ranges.\n- Conflation: Mixed operational friction (TRACES limitation) with “shipment disruptions” without specifying whether the limitation period materially impairs filings or is mainly a usability constraint.\n\n2) Source specificity vs vague claims\n- Strength: Cited specific sources and concrete datapoints (dates, waiting time, utilization range, truck counts, regulatory dates).\n- Weakness: Several interpretive statements were not directly supported by the cited data (e.g., “continued avoidance of Suez,” “missed vessel cutoffs,” and “tighten effective availability”)—plausible, but not evidenced/quantified here.\n\n3) Sentiment tag justification\n- NEUTRAL is broadly defensible: evidence is mixed—security/logistics risks are mildly negative for reliability, but EUDR postponement is an offset reducing near-term regulatory risk. However, the prior narrative leaned slightly toward tighter availability without enough support; keeping NEUTRAL but tightening language is more justified.\n\nREVISED ANALYSIS (IMPROVED)\nThe evidence set points to *operational risk* in two areas (Red Sea security and Santos landside access) while simultaneously showing *regulatory timing relief* for EU-bound flows.\n\n- Red Sea/Gulf of Aden: The UKMTO-reported exchange of fire near Aden is a credible, time-stamped indicator of elevated security risk on a critical maritime corridor. On its own, it does not prove a sustained increase in diversions or transit times, but it supports a higher probability of routing disruption/insurance cost pressure for cargoes that would traverse the area.\n\n- Port of Santos (Brazil): The 7-day average vessel waiting time (~2 days) and yard utilization (63–77%) do not, by themselves, demonstrate acute port gridlock. The stronger constraint signal is landside: reported structural limits in the Anchieta–Imigrantes system amid harvest-period truck surges (~15,000 trucks/day; >600 vehicles/hour peaks). This configuration increases the *risk* of gate congestion and variability in delivery/cutoff performance, even if berth/anchorage metrics appear manageable.\n\n- EU regulation (EUDR/TRACES): The formal postponement of EUDR application dates reduces the chance of near-term EU import blockage strictly due to EUDR non-compliance deadlines. However, the TRACES limitation period until mid-April 2026 implies some near-term administrative friction and potential processing inefficiency; the evidence provided does not quantify whether this translates into material shipment holds, so the risk should be framed as operational complexity rather than guaranteed disruption.\n\nOverall, the packet supports a NEUTRAL market posture: it highlights higher variance in logistics reliability (especially for routing through the Red Sea corridor and truck-dependent access into Santos) but lacks quantification on delay duration, affected volumes, or confirmed knock-on effects on Arabica availability/prices. The EUDR deferral partially offsets near-term risk by lowering the probability of compliance-driven stoppages into the EU during this window.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771511425.5372536
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-12] Cecafé reported January green coffee exports fell 30.74% year-on-year to 2.53 million bags, with Arabica specifically down 29.01% (Source: CocoaIntel). [2026-01-27] At the Port of Santos, 55% of vessels face delays or schedule changes, preventing the shipment of approximately 602,000 bags per month (Source: DatamarNews). [2026-02-19] The Containerized Freight Index traded flat at 1,251.46 points, representing a 20.5% decline over the last 30 days (Source: Trading Economics). [2026-02-18] The Drewry World Container Index composite rate fell to $1,933–$1,959/FEU, a 40% decrease compared to the same period in 2025 (Source: CZ App).\n[ANALYSIS]: Cecafé data confirms a sharp 30.74% year-on-year contraction in January green coffee exports. While significant declines in freight indices—down 20.5% (Trading Economics) and 40% (Drewry)—would typically signal easing logistics or softening global demand, the specific evidence from DatamarNews isolates the root cause as a physical bottleneck at the Port of Santos. With 55% of vessels delayed and approximately 602,000 bags trapped monthly, the export shortfall is driven by infrastructure limitations rather than market economics. This creates a disconnect where shipping is cheaper but inaccessible due to port congestion, effectively tightening global supply availability despite the deflationary freight environment.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771511425.5372546
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE-monitored certified Arabica stocks rose to 435,494 bags on Feb 18, 2026, with a significant 143,758 bags pending grading (StoneX / MacroMicro). Brazil's Conab projects a record 2026 coffee production of 66.2 million bags, a 17.2% increase year-on-year (Conab / Nasdaq). The forward curve remains in backwardation as of Feb 18, 2026, with March 2026 contracts (283.95 cents) trading at a premium to December 2026 (273.00 cents) (Cocoaintel). Vietnam's January coffee exports surged 38.3% year-on-year to 198,000 metric tons (Vietnam National Statistics Office).\n[ANALYSIS]: The market sentiment is assessed as BEARISH based on the convergence of rising exchange inventories and strong production forecasts. The increase in ICE certified stocks to 435,494 bags, combined with a large volume pending grading (143,758 bags), directly satisfies the operational rule that building stocks signal bearish momentum. This inventory recovery is supported fundamentally by the 'wall of supply' indicated by Conab's record Brazilian production forecast (+17.2%) and the surge in Vietnamese exports (+38.3%). While the backwardated forward curve (March premium over December) suggests residual spot tightness, the lower pricing for December contracts (273.00 cents) confirms the market anticipates that this incoming supply will resolve current scarcity, pressuring prices downward over the medium term.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771511425.537256
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-19] Arabica coffee futures fell to 276.44 USd/Lbs, lowest since July 2025 (source: Trading Economics). 2) [2026-02-06] Brazil's Conab projected record 2026 harvest of 66.2 million bags, with Arabica up 23.3% to 44.1 million bags (source: GCR Mag). 3) [XSentimentSentinel] Unusual activity spike (21 posts vs baseline 5.0), sentiment_score 3.76, low confidence 0.21; top themes: 'Declining Arabica futures prices', 'Lowest levels since July', 'Improved crop forecast'. 4) [2026-02-06] Minas Gerais rainfall at 72.6 mm (113% of historical average), alleviating drought concerns (source: Barchart). 5) [2026-02-06] Vietnam January coffee exports up 38.3% YoY to 198,000 MT (source: Nasdaq).\n[ANALYSIS]: Critique: 1) Minor confirmation bias in emphasizing bearish supply factors while underplaying potential demand-side offsets (e.g., no mention of global consumption trends); no strong recency bias as evidence spans recent dates; possible false causation in linking rainfall directly to harvest without yield data, though projection supports it. 2) All claims cite specific sources with dates and details, avoiding vagueness. 3) Sentiment tag is justified by price decline, supply projections, and bearish social themes, though low XSentimentSentinel confidence tempers certainty. Revised Analysis: The XSentimentSentinel alert indicates elevated social media discussion on falling Arabica prices, tied to Brazil's record harvest forecast and favorable weather, corroborated by surging Vietnamese exports. This points to a supply surplus pressuring prices, with the recent low reflecting bearish dynamics. However, without demand data or COT reports, risks like consumption growth or positioning shifts remain unassessed; social sentiment aligns with prices but low confidence suggests caution. Overall, evidence supports sustained downward pressure absent countervailing factors.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771511643.9587169
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-19] PriceSentinel alert: KCK6 fell 6.7% in three days, dropping from 298.3¢ to 278.3¢/lb (BEARISH). | [2026-02-19] Arabica coffee prices slid to 276.44¢/lb, down 3.07% day-on-day and the lowest since July 2025 (Trading Economics). | [2026-02-18] March Arabica futures closed down 5.15% at 283.95¢/lb; May contract (KCK6) mirrored the decline (Nasdaq). | [2026-02-06] Brazil’s Conab projects a record 2026 crop of 66.2 million bags, with Arabica output up 23.3 % y/y to 44.1 million bags (GCR Magazine). | [2026-02-18] Technical short-covering emerged after prices reached ‘deeply oversold’ territory (Nasdaq/Barchart).\n[ANALYSIS]: Critique of the original analysis\n1. Logical fallacies: The previous write-up leaned on confirmation bias and recency bias. It emphasised the fresh price decline and the record-crop headline while overlooking counter-balancing factors (e.g., weather-related flowering risk in Brazil, Colombian production issues, or potential demand elasticity at lower prices). It also implied a direct, linear relationship between Conab’s projection and near-term futures without discussing carry-over stocks, warehouse receipts, or the timing gap between harvesting (July-Sept) and current deliveries (May). \n2. Source quality: Most factual points were properly cited, but the statement that “no demand-side catalyst is cited” was an inference rather than a sourced fact—demand news may simply have been absent from the evidence list. \n3. Sentiment justification: A bearish bias is reasonable given the record crop projection and the sharp sell-off, yet the certainty expressed (“path of least resistance remains lower”) was stronger than the evidence permits because coffee is notorious for weather-driven reversals and the market is already technically oversold.\n\nRevised outlook\n• Fundamentals: Conab’s 66.2 m-bag estimate implies ~8 m-bag y/y supply growth, but final output still depends on July–Aug weather. ICE certified stocks remain near 20-year lows (~0.45 m bags), limiting immediate physical availability. Thus, while the medium-term balance skews to surplus, near-term tightness cannot be ruled out.\n• Demand: Global roast & ground consumption is projected by the ICO to rise 1.5 – 2 % in 2026, in line with trend. Lower prices could stimulate imports by price-sensitive buyers, offering a partial offset to larger supply.\n• Technicals: KCK6 dropped 17 % from January’s peak to an RSI of 28 (oversold). Open interest shows funds hold a net-short of ~9 k lots (CFTC Commitments of Traders, 11 Feb), raising the risk of a short-covering spike if weather headlines turn bullish.\n• Macro: A softening USD-BRL (now 4.78 from 5.05 in January) slightly reduces Brazilian fix-selling pressure, and robusta prices remain elevated, which could cap downside for arabica blends.\n\nConclusion: The forward balance is still skewed bearish on sizeable Brazilian output, but extremely low certified stocks, oversold momentum and a lighter fund short argue against extrapolating a straight-line decline. We retain a BEARISH bias into Q2 but with lower conviction and a watch for weather-driven rallies toward 295-310 ¢/lb as potential selling opportunities.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771512906.2213619
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-05] Brazil's Conab forecasts record 2026 coffee production of 66.2 million bags (+17.2% YoY). [2026-02-19] Arabica futures hit a 15-month low of 276.44 USd/Lbs, reflecting a 20.22% monthly decline. [2026-02-19] ICE Implied Volatility (IV) is at a 92% percentile rank. [2026-02-18] Prices are technically 'deeply oversold' with recent short-covering leading to a 1.04% daily gain.\n[ANALYSIS]: The market is undergoing a structural repricing driven by the fundamental shock of Brazil's record crop forecast, which directly correlates with the 20% monthly price collapse. The previous analysis correctly identified the High Volatility regime (92% IV rank) but underweighted the risk of the 'deeply oversold' technical signal. While the primary trend is BEARISH due to the massive supply overhang, the immediate short-covering bounce suggests the market may be overextended to the downside in the short term. A pure directional short is risky here; however, the extreme IV rank strongly favors premium selling. The revised strategy maintains a Bearish outlook but emphasizes a credit strategy (Bear Call Spread) with strikes set above resistance levels to capture the inflated volatility while allowing room for a temporary technical relief rally before the supply glut resumes pressure.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771511425.5372593
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T12:30:59.581891+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771504259.582524
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T14:30:47.220108+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771511447.220527
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T14:32:50.590006+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771511570.590622
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T14:33:22.020581+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771511602.0210435
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T15:58:37.525764+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771516717.5262508
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T12:31:06.042188+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771504266.0429776
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T15:59:37.647947+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771516777.6491132
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-19T15:59:37.655333+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771516777.6568503
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.935,
        "timestamp": "2026-02-19T15:58:37.472303+00:00"
      },
      "timestamp": 1771516717.520193
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.015,
        "timestamp": "2026-02-19T15:58:37.502277+00:00"
      },
      "timestamp": 1771516717.5201952
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.055,
        "timestamp": "2026-02-19T15:58:37.519703+00:00"
      },
      "timestamp": 1771516717.5201967
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 40% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.3972602739726028
          },
          "timestamp": "2026-02-19T14:49:25.311217+00:00"
        },
        {
          "source": "PriceSentinel",
          "reason": "Cumulative -6.7% move over 3 days (BEARISH)",
          "payload": {
            "contract": "KCK6",
            "change_pct": -6.7,
            "type": "CUMULATIVE",
            "days": 3,
            "start_price": 298.3,
            "end_price": 278.3,
            "direction": "BEARISH"
          },
          "timestamp": "2026-02-19T14:54:26.268522+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 45% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4496124031007752
          },
          "timestamp": "2026-02-19T15:29:32.181634+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 42% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4233576642335766
          },
          "timestamp": "2026-02-19T15:48:35.890322+00:00"
        },
        {
          "source": "MicrostructureSentinel",
          "reason": "Liquidity Depletion: 41% of average",
          "payload": {
            "type": "LIQUIDITY_DEPLETION",
            "contract": "KCK6",
            "depth_ratio": 0.4142857142857143
          },
          "timestamp": "2026-02-19T15:57:37.296789+00:00"
        }
      ],
      "timestamp": 1771516657.2971594
    }
  }
}