{
  "sensors": {
    "cleanup_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771318800.1389136
    },
    "last_ib_success": {
      "data": "2026-02-17T15:59:06.681476+00:00",
      "timestamp": 1771343946.684205
    },
    "drawdown_check_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771338000.464724
    },
    "orchestrator_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771338004.0098944
    },
    "monitor_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771319750.5361917
    },
    "dashboard_orders_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771343946.6842005
    },
    "sentinel_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771341752.2862985
    },
    "microstructure_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1771319745.6414924
    },
    "x_sentiment": {
      "data": {
        "sentiment_sensor_status": "ONLINE",
        "consecutive_failures": 0,
        "degraded_until": null
      },
      "timestamp": 1771341909.3324008
    },
    "test_utilities_ib_status": {
      "data": "CONNECTED",
      "timestamp": 1770921415.7071493
    },
    "test_utilities_last_error": {
      "data": "[Errno 111] Connection refused",
      "timestamp": 1770921197.5728812
    },
    "last_ib_failure": {
      "data": "2026-02-17T15:21:28.654079+00:00",
      "timestamp": 1771341688.6610985
    },
    "sentinel_last_error": {
      "data": "[Errno 111] Connect call failed ('127.0.0.1', 4001)",
      "timestamp": 1771341688.6610968
    },
    "drawdown_check_last_error": {
      "data": "",
      "timestamp": 1770991215.70366
    }
  },
  "test": {
    "_test": {
      "data": "ok",
      "timestamp": 1771293090.546468
    }
  },
  "reports": {
    "agronomist": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-10] Somar Meteorologia reported Minas Gerais received 72.6 mm of rain in the week ended Feb 6, representing 113% of the historical average. [2026-02-17] Raw research findings explicitly state the crop is currently in the 'grain filling' stage. [2026-02-11] Forecasts indicate instabilities will decrease in the Southeast, with the sun appearing more frequently. [2026-02-06] Conab forecasts a record 2026 coffee crop of 66.2 million bags.\n[ANALYSIS]: The premise regarding 'flowering' is factually incorrect for this time of year; evidence confirms the crop is in the critical 'grain filling' stage. The recent precipitation in Minas Gerais (113% of historical average) was ideally timed to support bean sizing, while the forecast for drier, sunnier weather mitigates fungal risks and aids maturation. These conditions directly validate Conab's projection of a record 66.2 million bag harvest. The convergence of optimal agrometeorological conditions and record production estimates signals a robust supply surplus, supporting a negative price outlook.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771339107.1479025
    },
    "macro": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-17] USD/BRL rose slightly to 5.2445, but BRL has strengthened 2.34% over the past month. (Trading Economics)\n2) [2026-02-14] Farmers sold 33.9% of the 2025/26 soybean crop vs 45.1% historical average, citing price uncertainty and a stronger Real. (Gateway to South America / Safras & Mercado)\n3) [2026-02-10] Farmers reluctant to sell due to strengthening BRL, high transport costs, and abundant supply. (Ukragroconsult)\n4) [2026-02-09] Focus Report projects end-2026 Selic at 12.25% and USD/BRL at 5.50. (InfoMoney / Banco Central do Brasil)\n5) [2026-01-28] BCB held Selic at 15.00% and signaled rate cuts would begin in March. (Reuters / Investing.com)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Logical fallacies / reasoning risks:\n- Cross-commodity extrapolation (weak analog): The strongest behavioral evidence cited is soybean farmer selling (2,3), but the conclusion extends it to coffee producer selling. That’s not a strict fallacy, but it is a material inference jump without coffee-specific confirmation.\n- Potential confirmation bias: The analysis leans on items (2,3) that support “strong BRL discourages selling,” while not addressing alternative drivers mentioned in the same evidence (e.g., high transport costs, abundant supply) and how those could offset or dominate FX effects.\n- Possible over-causation: It implies restrained selling would “tighten near-term export availability” for Arabica without providing coffee flow/export data. The mechanism is plausible, but the evidence provided does not establish that it is occurring in coffee.\n- Time-horizon mismatch / mild recency bias: It weights “past month BRL appreciation” heavily versus longer-run context, while also introducing end-2026 forecasts. Mixing near-term spot moves with long-dated forecasts can blur what is actionable now.\n\n2) Source specificity vs vagueness:\n- Strength: The prior write-up did cite specific figures and sources (e.g., USD/BRL 5.2445; -2.34% over a month; 33.9% vs 45.1% average; Selic 15.00%; Focus projections 12.25% and 5.50).\n- Weakness: The step from FX conditions to Arabica supply impact was not backed by a source specific to coffee (no coffee producer selling pace, export line-ups, or ICO/CECAFE-type shipment data in the packet). That part was necessarily more interpretive than evidenced.\n\n3) Sentiment tag justification:\n- NEUTRAL is defensible. The near-term FX implication (stronger BRL tends to discourage selling) is arguably supportive for Arabica prices, but it is based on non-coffee evidence and is counterbalanced by forward-looking projections of BRL weakening (which would be a headwind). Given the evidentiary gap for coffee-specific flows, a non-committal tag fits.\n\nREVISED ANALYSIS (IMPROVED)\n- Current FX backdrop: The BRL has appreciated about 2.34% over the past month even though USD/BRL ticked up on the day to ~5.2445 (1). Taken at face value, that recent appreciation reduces BRL-denominated returns from USD-priced exports.\n- Documented producer behavior (non-coffee): In Brazilian agriculture, sources report slower forward selling of soybeans (33.9% sold vs 45.1% historical) explicitly linked to a stronger Real and price uncertainty (2), and broader reluctance to sell tied to BRL strength alongside other constraints like transport costs and abundant supply (3). This supports the general mechanism: BRL appreciation can delay producer selling.\n- Limits of inference to Arabica: The packet does not provide coffee-specific selling pace, exporter line-ups, or shipment data. Therefore, we cannot conclude that Arabica exports are currently tightening; we can only say that the FX environment is consistent with (i.e., does not contradict) a tendency for Brazilian producers/exporters to be less aggressive sellers, based on analogous agricultural behavior.\n- Policy/forward FX expectations: The Selic remains high at 15.00% with guidance pointing to cuts starting in March (5). Market expectations (Focus) look for a lower Selic (12.25%) and a weaker BRL (USD/BRL 5.50) by end-2026 (4). If that path materializes, it would likely reduce the “strong BRL discourages selling” effect over time and could eventually encourage more export selling, but this is forecast risk rather than current fact.\n- Net takeaway for Arabica: Near-term, the observed BRL strengthening is mildly supportive for the idea of restrained Brazilian selling incentives, but due to the lack of coffee-specific flow evidence and the presence of non-FX drivers in the cited reports (transport costs, supply conditions), the appropriate stance remains cautious/neutral rather than directional.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771339107.1479044
    },
    "geopolitical": {
      "data": {
        "data": "[EVIDENCE]: 1) [2026-02-16] Maersk Latin America Market Update: “tighter conditions and longer waiting times” persist at Santos, Paranaguá, and Itapoá terminals. (Maersk)\n2) [2026-02-09] Maersk CEO: full return to Red Sea unfeasible due to insufficient military escort ships; two specific services returning. (Seatrade Maritime)\n3) [2026-02-16] Industry polls: most carriers remain cautious; full-scale Red Sea return not viewed as ready. (Container News)\n4) [2026-02-14] Global liner prices fell 4.7% to $2,107 per 40-foot container (week ended Jan 29, 2026). (Gulf News)\n5) [2026-02-11] European Commission: will not reopen EUDR core text; targeted tweaks to product list by April 2026. (Euractiv)\n[ANALYSIS]: CRITIQUE OF PRIOR ANALYSIS\n1) Logical fallacies / reasoning issues\n- Potential false causation / weak inference: I treated the 4.7% decline in a global liner price index as evidence of “easing congestion,” and then used that to temper the Brazil/Red Sea bottleneck story. But a global index can fall for reasons unrelated to physical port congestion (seasonality, demand softening, capacity changes, contract vs spot mix). The evidence only states prices fell; it does not explicitly attribute the move to easing congestion in Brazil or on Red Sea-linked lanes.\n- Over-aggregation (composition fallacy): I implied that falling global container rates meaningfully offsets corridor-specific disruptions. Brazil export congestion (Santos/Paranaguá/Itapoá) can remain severe even if the global average rate is down.\n- Scope mismatch: I referenced “Asia–Europe lanes” and “Suez reliance,” which is directionally reasonable given Red Sea context, but the evidence provided does not specifically connect these Red Sea constraints to coffee flows or quantify impacts on coffee-linked corridors.\n- Recency/selection risk: The packet is dominated by mid-February items; conclusions about broader trend (“mixed signals”) could be overly driven by a small, recent sample without baseline comparison.\n\n2) Source specificity vs vagueness\n- Strength: I did cite the specific Maersk update for Brazil port conditions and named terminals, which is concrete.\n- Weakness: I made broader claims like “easing congestion” and “broader freight conditions” without tying them to a clearly defined metric beyond the single liner price datapoint. Also, I implied practical impacts on coffee exports without any cited coffee-specific shipment data (rollovers, dwell times, export volumes), which makes that part more inferential than evidentiary.\n\n3) Sentiment tag justification\n- “NEUTRAL” is mostly defensible because the evidence is mixed: clear Brazil-side tightness + persistent Red Sea risk, but one datapoint suggests lower freight prices. However, since the price decline is not proven to be caused by improved physical fluidity (and may not offset localized disruptions), the tone arguably should be “neutral-to-bearish” on logistics risk for near-term physical supply reliability.\n\nREVISED / IMPROVED ANALYSIS\nFrom the provided facts, near-term logistics risk looks elevated for Brazil-origin shipments due to confirmed tighter conditions and longer waiting times at key southern Brazil terminals (Santos/Paranaguá/Itapoá per Maersk). Separately, Red Sea/Suez uncertainty likely remains a persistent routing risk (Maersk CEO plus carrier polling indicate a broad return is not feasible/“not ready”), implying continued detours or security-related constraints for corridors that would otherwise transit the Red Sea.\n\nThe falling global liner price datapoint indicates that overall container pricing pressure has eased at the aggregate level, but it should not be used as a direct proxy for improved operational conditions in the specific Brazil coffee export corridor (or for Red Sea-linked reliability) without additional corridor-level evidence. Therefore, the most supported conclusion is: localized bottlenecks (Brazil ports) and geopolitical routing constraints (Red Sea) are still meaningful risks to shipment timing and reliability, even if global freight rates are drifting lower.\n\nImplication for Arabica (limited to what this evidence supports): higher probability of export delays/variability from Brazil due to port-side congestion signals; global rate softness may reduce cost pressure but does not materially negate the timing/reliability risk indicated by Maersk’s port update. EUDR developments here are best characterized as a medium-term compliance/planning variable rather than an immediate physical logistics constraint, since the Commission is not reopening the core text and only considering targeted product-list tweaks by April 2026.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771339107.1479056
    },
    "supply_chain": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-11] Brazil exported 2.78 million bags of coffee in January 2026, a 30.8% decline compared to January 2025 (Source: Cecafé). [2026-02-11] The Port of Santos handled 81% of shipments, where 'logistical bottlenecks and ship delays continue to generate extra costs' despite lower volumes (Source: Cecafé / DatamarNews). [2026-02-12] Drewry World Container Index decreased 1% to $1,933 per 40ft container, marking the fifth consecutive weekly decline (Source: Drewry). [2026-02-16] The Containerized Freight Index traded flat at 1251.46 points, down 20.50% over the past month (Source: Trading Economics).\n[ANALYSIS]: The revised analysis identifies a critical divergence between global shipping trends and local Brazilian execution. While global indicators (Drewry WCI, Containerized Freight Index) show falling rates and easing capacity constraints, Brazil is experiencing a localized supply shock, evidenced by the severe 30.8% year-over-year drop in exports. The fact that the Port of Santos continues to face 'logistical bottlenecks' and delays even as volumes decrease suggests deep structural inefficiencies rather than temporary congestion. This physical restriction of coffee flow from the world's largest producer overrides the deflationary signal from broader global freight indices, creating a net bullish setup for coffee prices due to immediate supply scarcity.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BULLISH]",
        "confidence": 0.8,
        "sentiment": "BULLISH"
      },
      "timestamp": 1771339107.1479065
    },
    "inventory": {
      "data": {
        "data": "[EVIDENCE]: ICE Coffee C certified stocks rose to 436,081 bags on Feb 13, 2026 (MacroMicro / CocoaIntel). The forward curve remains in backwardation with March 2026 holding a ~2.30 cent premium over May 2026 (StoneX). Brazil's 2026 production is forecast at a record 66.2 million bags, up 17.2% YoY (Conab / Nasdaq). Global shipments for Dec 2025 rose 10.45% YoY to 11.94 million bags (ICO).\n[ANALYSIS]: The revised analysis maintains a BEARISH sentiment but upgrades the confidence level significantly. The previous analysis correctly identified the trend but suffered from under-confidence given the weight of the fundamental evidence. The confluence of a record Brazilian crop forecast (+17.2%) and a double-digit rise in global shipments (+10.45%) represents a structural shift from deficit to surplus that outweighs the technical signal of the forward curve. While the backwardation (~2.30 cents) indicates residual short-term tightness, the consistent build in ICE certified stocks proves that high prices have successfully stimulated supply flow to the exchange. The fundamental 'wall of supply' from Brazil is the dominant market driver, rendering the backwardation a lagging rather than leading indicator.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771339107.1479073
    },
    "sentiment": {
      "data": {
        "data": "[EVIDENCE]: 1. XSentimentSentinel alert shows unusual activity spike with 13 posts (vs. baseline 4.1), sentiment_score 5.12, top themes including 'Futures rally', 'Firm farm-gate prices', and 'Uganda coffee earnings' (source: XSentimentSentinel). 2. [2026-02-17] Arabica coffee futures fell to 284.69 USd/Lbs, down 3.89% from the previous day, after a prior rally (source: Trading Economics). 3. [2026-02-12] UCDA reported rally in Liffe Robusta and New York Arabica futures due to tighter global supply signs, supporting firm farm-gate prices (Arabica Parchment UGX 15,000-16,000/kg) (source: Uganda Coffee Development Authority). 4. Uganda's December 2025 coffee exports up 21.67% YoY to 502,582 bags, earnings up 30.29% to USD 149.86 million; past year record 8.2 million bags earning USD 2.3 billion (source: UCDA / CocoaIntel).\n[ANALYSIS]: Critique: 1. Logical fallacies include recency bias by emphasizing the latest price decline without quantifying the prior rally's magnitude or duration, potentially overstating its reversal impact; no clear confirmation bias, but false causation is present in linking Uganda's export surge directly to downward price pressure without evidence that Ugandan supply specifically influenced global futures (Uganda is a smaller producer compared to Brazil). 2. All claims are tied to specific sources with dates and metrics, avoiding vagueness. 3. The NEUTRAL sentiment tag is justified, as evidence balances positive sentiment/export data against the bearish price drop, but could be refined to acknowledge slight bullish tilt from sentiment score.\n\nThe X sentiment spike reflects optimism from recent rallies and Uganda's strong exports/earnings, indicating perceived demand strength and supply tightness that bolstered prices earlier. However, the February 17 price drop of 3.89% to 284.69 USd/Lbs suggests the rally's reversal, likely due to broader supply expectations (e.g., Brazilian harvests) outweighing regional positives. Uganda's export growth signals robust local production but represents only ~5-10% of global supply, limiting its bearish influence on futures. Firm farm-gate prices in Uganda highlight resilience in producer economics despite global volatility. Overall, the mixed signals point to short-term bearish pressure on prices amid lingering bullish sentiment from supply chain strength.\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: NEUTRAL]",
        "confidence": 0.65,
        "sentiment": "NEUTRAL"
      },
      "timestamp": 1771341986.7613378
    },
    "technical": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-17] ICE Coffee (KCH27) close = 282.90 ¢/lb; 200-day SMA = 296.44 ¢/lb; RSI-14 = 38.15 (Barchart).  [2026-02-17] Pivot levels: S1 280.08 ¢, S2 277.27 ¢, R1 287.68 ¢, R2 292.47 ¢ (Barchart).  Week ending 2026-02-11: CFTC Managed-Money net-long 6,542 lots (down from 18,214 the prior week) – shows funds turning defensive (CFTC).  Brazil CONAB 2026/27 crop estimate 69.9 M bags (+4 % YoY), signalling ample supply (CONAB bulletin 2026-02-15).  6-month momentum score on Investing.com = ‘Strong Sell’.\n[ANALYSIS]: Self-critique (brief)\n• Confirmation / selection bias: The original write-up focused almost exclusively on bearish inputs (price < SMA, record crop) and ignored possible bullish counter-points such as approaching technical oversold levels, seasonality (frost risk mid-year), or recent reductions in managed-money length that could set the stage for a short-covering bounce.\n• Recency bias: A single trading day’s data were treated as definitive; longer-term context (multi-year trend, volatility) was not explored.\n• Source specificity: Most data were sourced precisely, but the phrase “flagged as Strong Sell on 6-month lows” was vague. I now give explicit CFTC and CONAB references.\n• Sentiment tag: ‘Bearish’ was reasonable, but the language \"strong sell\" may have overstated conviction given RSI was only mid-30s (not <30) and key support (280 ¢) had not broken.\n\nRevised view\nTechnical: KCH27 remains in a down-channel, trading 4.6 % under its 200-day SMA—so primary trend is still lower. However, RSI at 38 is nearing, not yet breaching, typical oversold territory (<30). The contract is resting on the 280–277 ¢ support band; a decisive daily close below 277 ¢ would open 270 ¢/lb next, while a rebound above 288 ¢ would target the 292–296 ¢ zone where the 200-day SMA sits.\nPositioning: Managed-money length has collapsed 64 % in two weeks, meaning much of the momentum-selling may already be in the market, increasing the probability of a short-covering rally if fresh bearish catalysts fail to appear.\nFundamentals: CONAB’s larger-than-expected Brazilian crop projection justifies a generally bearish supply backdrop, but it is early in the growing season; weather risks (frosts in June–August, excessive rains) remain latent upside threats. Demand growth (specialty and soluble) is tracking trend but not accelerating.\nBottom line: Primary trend = down; momentum = weak but not extreme; positioning = lightening; fundamentals = supply-heavy but weather sensitive. Risk-reward slightly favours patience on new shorts until either (a) 277 ¢ breaks or (b) rallies back to ~296 ¢ fail. Near term bias stays BEARISH, yet with reduced conviction compared with the original call.\nTrade colour (not advice): Sellers could trail stops just above 293 ¢; would-be buyers might wait for either an intraday capitulation below 277 ¢ followed by quick recovery or an RSI sub-30 print accompanied by CFTC shorts rebuilding.\n\n[CONFIDENCE]: 0.65\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.65,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771339107.1479094
    },
    "volatility": {
      "data": {
        "data": "[EVIDENCE]: [2026-02-17] Coffee futures (KCK26) trading at 286.03 cents/lb (-4% daily, ~-20% monthly). Implied Volatility (IV) is 35.93%, with an inverted term structure (Front-month ~36% > Back-month ~30.68%). Market assessment deems premiums 'cheap' relative to realized volatility.\n[ANALYSIS]: The market is experiencing a severe bearish correction, confirmed by the 20% monthly decline and inverted volatility term structure, which signals immediate distress. While the previous analysis labeled this a 'LOW_VOL regime', this is technically a misnomer; absolute volatility is high (~36%), but premiums are 'cheap' relative to the extreme Realized Volatility (RV). The dislocation where IV < RV suggests option prices have not fully priced in the velocity of the crash. Therefore, buying premium (Long Put) remains the optimal approach to capture further downside while mitigating the high gamma risk associated with selling strategies in a crashing market.\n[CONFIDENCE]: 0.8\n[SENTIMENT TAG]: [SENTIMENT: BEARISH]",
        "confidence": 0.8,
        "sentiment": "BEARISH"
      },
      "timestamp": 1771339107.14791
    }
  },
  "sentinel_health": {
    "WeatherSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:30.640764+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771336410.6414568
    },
    "LogisticsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:31.759031+00:00",
        "interval_seconds": 21600,
        "error": null
      },
      "timestamp": 1771336411.7598903
    },
    "NewsSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T15:54:28.741220+00:00",
        "interval_seconds": 7200,
        "error": null
      },
      "timestamp": 1771343668.7418098
    },
    "XSentimentSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T15:25:09.370671+00:00",
        "interval_seconds": 5400,
        "error": null
      },
      "timestamp": 1771341909.3713164
    },
    "PredictionMarketSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T15:56:30.198989+00:00",
        "interval_seconds": 300,
        "error": null
      },
      "timestamp": 1771343790.1995935
    },
    "MacroContagionSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T13:53:32.806963+00:00",
        "interval_seconds": 14400,
        "error": null
      },
      "timestamp": 1771336412.8074965
    },
    "PriceSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T15:59:31.038287+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771343971.039901
    },
    "MicrostructureSentinel": {
      "data": {
        "status": "OK",
        "last_check_utc": "2026-02-17T15:20:25.103246+00:00",
        "interval_seconds": 60,
        "error": null
      },
      "timestamp": 1771341625.103881
    }
  },
  "prediction_market_state": {
    "Fed decisions (Dec-Mar)": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "next-three-fed-decisions-847",
        "title": "Fed decisions (Dec-Mar)",
        "price": 0.93,
        "timestamp": "2026-02-17T15:56:29.551072+00:00"
      },
      "timestamp": 1771343790.1909883
    },
    "Will tariffs generate >$250b in 2025?": {
      "data": {
        "severity_hwm": 0,
        "hwm_timestamp": null,
        "slug": "will-tariffs-generate-250b-in-2025",
        "title": "Will tariffs generate >$250b in 2025?",
        "price": 0.0145,
        "timestamp": "2026-02-17T15:56:29.726954+00:00"
      },
      "timestamp": 1771343790.1909919
    },
    "How many Fed rate cuts in 2026?": {
      "data": {
        "severity_hwm": 7,
        "hwm_timestamp": "2026-02-17T09:37:51.681485+00:00",
        "slug": "how-many-fed-rate-cuts-in-2026",
        "title": "How many Fed rate cuts in 2026?",
        "price": 0.245,
        "timestamp": "2026-02-17T15:56:30.190174+00:00"
      },
      "timestamp": 1771343790.1909933
    }
  },
  "sentinel_history": {
    "events": {
      "data": [
        {
          "source": "PredictionMarketSentinel",
          "reason": "Prediction Market Alert: 'How many Fed rate cuts in 2026?' JUMPED 22.5%",
          "payload": {
            "topic": "How many Fed rate cuts in 2026?",
            "slug": "how-many-fed-rate-cuts-in-2026",
            "delta_pct": 22.5,
            "importance": "macro",
            "commodity_impact": "US rate changes affect USD strength, commodity financing costs, and carry trade dynamics"
          },
          "timestamp": "2026-02-17T09:37:51.696121+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in Central Highlands: 0.0mm (BULLISH, FLOWERING stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "Central Highlands",
            "weekly_precip_mm": 0.0,
            "threshold": 35.0,
            "stage": "FLOWERING",
            "direction": "BULLISH",
            "severity": "CRITICAL"
          },
          "timestamp": "2026-02-17T09:52:55.182109+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (14 posts)",
          "payload": {
            "sentiment_score": 5.7,
            "confidence": 0.21,
            "top_themes": [
              "futures rally",
              "firm farm-gate prices",
              "Uganda coffee earnings",
              "Rising prices",
              "Arabica luxury status"
            ],
            "post_volume": 14,
            "volume_baseline": 4.0,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 7.0,
                "volume": 1,
                "confidence": 0.3,
                "top_post": "Global futures rally as firm farm-gate prices anchor Uganda’s coffee earnings\n\nDETAILS 👇🏽#VisionUpdates #HarvestMoney\n\nhttps://t.co/3xDuspLpPG https://t.co/419umr31d1"
              },
              {
                "query": "arabica prices",
                "score": 6.0,
                "volume": 1,
                "confidence": 0.2,
                "top_post": "What needs to be specified, which coffee? Arabica might become luxury soon because of the rising prices, does Robusta have all the same capabilities? https://t.co/YUIr4xL9lX"
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-17T12:23:56.447463+00:00"
        },
        {
          "source": "WeatherSentinel",
          "reason": "DROUGHT in Colombia Huila: 13.1mm (NEUTRAL, VEGETATIVE stage)",
          "payload": {
            "type": "DROUGHT",
            "region": "Colombia Huila",
            "weekly_precip_mm": 13.1,
            "threshold": 30.0,
            "stage": "VEGETATIVE",
            "direction": "NEUTRAL",
            "severity": "HIGH"
          },
          "timestamp": "2026-02-17T13:53:30.649136+00:00"
        },
        {
          "source": "XSentimentSentinel",
          "reason": "UNUSUAL X ACTIVITY SPIKE (13 posts)",
          "payload": {
            "sentiment_score": 5.12,
            "confidence": 0.21,
            "top_themes": [
              "Futures rally",
              "Firm farm-gate prices",
              "Uganda coffee earnings",
              "Supply chain control and improvements",
              "Traceability and sustainability"
            ],
            "post_volume": 13,
            "volume_baseline": 4.1,
            "volume_spike": true,
            "query_results": [
              {
                "query": "coffee futures",
                "score": 6.0,
                "volume": 1,
                "confidence": 0.2,
                "top_post": "Global futures rally as firm farm-gate prices anchor Uganda’s coffee earnings\n\nDETAILS 👇🏽#VisionUpdates #HarvestMoney\n\nhttps://t.co/3xDuspLpPG https://t.co/419umr31d1"
              },
              {
                "query": "arabica prices",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.1,
                "top_post": null
              },
              {
                "query": "KC futures",
                "score": 5.0,
                "volume": 0,
                "confidence": 0.2,
                "top_post": null
              }
            ]
          },
          "timestamp": "2026-02-17T15:25:09.396920+00:00"
        }
      ],
      "timestamp": 1771341909.3974473
    }
  }
}